{
  "flashCards": [
    {
      "title": "Instruction Following Model",
      "definition": "AI system designed to execute tasks based on specific commands or instructions provided by users.",
      "year": 2021,
      "slug": "instruction-following-model"
    },
    {
      "title": "Wake Sleep",
      "definition": "Biologically inspired algorithm used within unsupervised learning to train deep belief networks.",
      "year": 1995,
      "slug": "wake-sleep"
    },
    {
      "title": "Next Word Prediction",
      "definition": "Enables language models to predict the most probable subsequent word in a text sequence using generative AI techniques.",
      "year": 1950,
      "slug": "next-word-prediction"
    },
    {
      "title": "Vector Operation",
      "definition": "Essential mathematical operations on vectors used for computations in AI to facilitate algorithms in data representation, transformation, and manipulation.",
      "year": 0,
      "slug": "vector-operation"
    },
    {
      "title": "Agent",
      "definition": "System capable of perceiving its environment through sensors and acting upon that environment to achieve specific goals.",
      "year": 1963,
      "slug": "agent"
    },
    {
      "title": "Invariance",
      "definition": "Property of a model or algorithm that ensures its output remains unchanged when specific transformations are applied to the input data.",
      "year": 1965,
      "slug": "invariance"
    },
    {
      "title": "Surprise",
      "definition": "Measuring the degree of unexpectedness or novelty in AI systems.",
      "year": 1948,
      "slug": "surprise"
    },
    {
      "title": "Misuse",
      "definition": "Application of AI technologies in ways that are unethical, illegal, or harmful to individuals or society.",
      "year": 2016,
      "slug": "misuse"
    },
    {
      "title": "Affective Computation",
      "definition": "Field within AI that focuses on the design of systems and devices capable of recognizing, interpreting, processing, and simulating human emotions.",
      "year": 1995,
      "slug": "affective-computation"
    },
    {
      "title": "Decomposition",
      "definition": "Process of breaking down a complex problem into smaller, more manageable parts that can be solved individually.",
      "year": 1965,
      "slug": "decomposition"
    },
    {
      "title": "Ontology",
      "definition": "Structured framework that categorizes and organizes information or data into a hierarchy of concepts and relationships, facilitating the sharing and reuse of knowledge across systems and domains.",
      "year": 1976,
      "slug": "ontology"
    },
    {
      "title": "Kernel Method",
      "definition": "A set of algorithms that enable machine learning models to perform in high-dimensional spaces without directly computing those dimensions.",
      "year": 1999,
      "slug": "kernel-method"
    },
    {
      "title": "NLD (Neural Lie Detectors)",
      "definition": "AI systems designed to identify dishonesty or inconsistencies in the outputs or decisions of other AI models by analyzing their responses or behavior.",
      "year": 2021,
      "slug": "nld-neural-lie-detectors"
    },
    {
      "title": "Conditional Generation",
      "definition": "Process where models produce output based on specified conditions or constraints.",
      "year": 2014,
      "slug": "conditional-generation"
    },
    {
      "title": "Self-Reasoning Token",
      "definition": "AI mechanism designed to enhance the planning capabilities of language models by allowing them to anticipate and prepare for future outputs.",
      "year": 2022,
      "slug": "self-reasoning-token"
    },
    {
      "title": "Noise",
      "definition": "Irrelevant or meaningless data in a dataset or unwanted variations in signals that can interfere with the training and performance of AI models.",
      "year": 1936,
      "slug": "noise"
    },
    {
      "title": "DoLa (Decoding by Contrasting Layers)",
      "definition": "Novel method for enhancing language model performance by focusing on contrasting the outputs of different layers to improve decoding accuracy.",
      "year": 2023,
      "slug": "dola-decoding-by-contrasting-layers"
    },
    {
      "title": "AI Failure Modes",
      "definition": "Diverse scenarios where AI systems do not perform as expected or generate unintended consequences.",
      "year": 2016,
      "slug": "ai-failure-modes"
    },
    {
      "title": "Generalization",
      "definition": "Ability of a ML model to perform well on new, unseen data that was not included in the training set.",
      "year": 1956,
      "slug": "generalization"
    },
    {
      "title": "Intelligence Explosion",
      "definition": "Hypothetical scenario where an AI system rapidly improves its own capabilities and intelligence, leading to a superintelligent AI far surpassing human intelligence.",
      "year": 1965,
      "slug": "intelligence-explosion"
    },
    {
      "title": "Syntactic Templates",
      "definition": "Predefined structures that define the permissible syntax patterns for sentences in natural language processing (NLP) to facilitate parsing and generation tasks.",
      "year": 2021,
      "slug": "syntactic-templates"
    },
    {
      "title": "Empathic AI",
      "definition": "AI systems designed to recognize, understand, and respond to human emotions in a nuanced and contextually appropriate manner.",
      "year": 2015,
      "slug": "empathic-ai"
    },
    {
      "title": "Sampling",
      "definition": "Fundamental technique used to reduce computational cost and simplify data management",
      "year": 1936,
      "slug": "sampling"
    },
    {
      "title": "Shared Awareness",
      "definition": "Collective understanding and perception of information among multiple agents, both human and machine, in a given environment.",
      "year": 2021,
      "slug": "shared-awareness"
    },
    {
      "title": "Cosine Similarity",
      "definition": "Measures the cosine of the angle between two vectors in a multidimensional space, often used to determine how similar two items are.",
      "year": 1957,
      "slug": "cosine-similarity"
    },
    {
      "title": "Capsule Networks",
      "definition": "Type of artificial neural network designed to improve the processing of spatial hierarchical information by encoding data into small groups of neurons called capsules.",
      "year": 2017,
      "slug": "capsule-networks"
    },
    {
      "title": "Gorilla Program",
      "definition": "Concept in AI that illustrates the potential risk of superintelligent machines surpassing human control.",
      "year": 1996,
      "slug": "gorilla-program"
    },
    {
      "title": "Fast Takeoff",
      "definition": "Rapid transition from human-level to superintelligent AI, occurring in a very short period of time.",
      "year": 1998,
      "slug": "fast-takeoff"
    },
    {
      "title": "Matrix Models",
      "definition": "Mathematical frameworks that use matrices with parameters to represent and solve complex problems, often in ML, statistics, and systems theory.",
      "year": 1983,
      "slug": "matrix-models"
    },
    {
      "title": "Association Rule",
      "definition": "Method in data mining for discovering interesting relationships, patterns, or correlations among a large set of data items.",
      "year": 1993,
      "slug": "association-rule"
    },
    {
      "title": "SSL (Self-Supervised Learning)",
      "definition": "Type of ML where the system learns to predict part of its input from other parts, using its own data structure as supervision.",
      "year": 2018,
      "slug": "ssl-self-supervised-learning"
    },
    {
      "title": "Log Likelihood",
      "definition": "Logarithm of the likelihood function, used in statistical models to measure how well a model explains a given set of data.",
      "year": 1912,
      "slug": "log-likelihood"
    },
    {
      "title": "Full-Sequence Diffusion",
      "definition": "Approach in diffusion models where the entire sequence of data undergoes the diffusion process simultaneously rather than segment by segment.",
      "year": 2023,
      "slug": "full-sequence-diffusion"
    },
    {
      "title": "Tree of Thought",
      "definition": "A cognitive framework within AI that models decision-making processes using tree-like structures to simulate human-like reasoning and planning.",
      "year": 2023,
      "slug": "tree-of-thought"
    },
    {
      "title": "SLM (Sparse Linear Model)",
      "definition": "Predictive model that uses a sparse representation of the underlying data to make accurate predictions.",
      "year": 2010,
      "slug": "slm-sparse-linear-model"
    },
    {
      "title": "Model Level",
      "definition": "Abstraction layer at which an AI or ML model operates, focusing on the specific details and mechanics of the model's architecture and functioning.",
      "year": 2018,
      "slug": "model-level"
    },
    {
      "title": "Permutation",
      "definition": "Arrangement of all or part of a set of objects in a specific order.",
      "year": 1936,
      "slug": "permutation"
    },
    {
      "title": "Sovereign AI",
      "definition": "Hypothetical form of AI that operates independently with its own autonomy, potentially possessing the ability to make decisions and take actions without human intervention.",
      "year": 2021,
      "slug": "sovereign-ai"
    },
    {
      "title": "Model Distillation",
      "definition": "ML technique where a larger, more complex model (teacher) is used to train a smaller, simpler model (student) to approximate the teacher's predictions while maintaining similar performance.",
      "year": 2015,
      "slug": "model-distillation"
    },
    {
      "title": "Ensemble Methods",
      "definition": "ML technique where multiple models are trained and used collectively to solve a problem.",
      "year": 1996,
      "slug": "ensemble-methods"
    },
    {
      "title": "Shors Algorithm",
      "definition": "A quantum algorithm that efficiently solves integer factorization, potentially threatening classical encryption systems.",
      "year": 1994,
      "slug": "shors-algorithm"
    },
    {
      "title": "Cognitive Computing",
      "definition": "Computer systems that simulate human thought processes to solve complex problems.",
      "year": 2011,
      "slug": "cognitive-computing"
    },
    {
      "title": "Self-Awareness",
      "definition": "Nn entity's ability to recognize itself as an individual, distinct from its environment and other entities, often involving introspection and a sense of identity.",
      "year": 1980,
      "slug": "self-awareness"
    },
    {
      "title": "AMI (Advanced Machine Intelligence)",
      "definition": "Refers to high-level AI systems possessing the capability to perform complex cognitive tasks with or without human-like reasoning.",
      "year": 2020,
      "slug": "ami-advanced-machine-intelligence"
    },
    {
      "title": "Conditional Probability",
      "definition": "Measures the likelihood of an event occurring, given that another event has already occurred.",
      "year": 1763,
      "slug": "conditional-probability"
    },
    {
      "title": "Bias-Variance Trade-off",
      "definition": "In ML, achieving optimal model performance involves balancing bias and variance to minimize overall error.",
      "year": 0,
      "slug": "bias-variance-trade-off"
    },
    {
      "title": "Contextual Embedding",
      "definition": "Vector representations of words or tokens in a sentence that capture their meanings based on the surrounding context, enabling dynamic and context-sensitive understanding of language.",
      "year": 2018,
      "slug": "contextual-embedding"
    },
    {
      "title": "DAG (Directed Acyclic Graphs)",
      "definition": "Graph that consists of vertices connected by edges, with the directionality from one vertex to another and no possibility of forming a cycle.",
      "year": 1955,
      "slug": "dag-directed-acyclic-graphs"
    },
    {
      "title": "Inductive Reasoning",
      "definition": "Logical process where specific observations or instances are used to form broader generalizations and theories.",
      "year": 1960,
      "slug": "inductive-reasoning"
    },
    {
      "title": "Brain Organoid Reservoir Computing",
      "definition": "Combines the use of brain organoids—3D cultures of human brain cells—with reservoir computing principles to create advanced computational models for studying neural dynamics and intelligence.",
      "year": 2021,
      "slug": "brain-organoid-reservoir-computing"
    },
    {
      "title": "Control Problem",
      "definition": "Challenge of ensuring that highly advanced AI systems act in alignment with human values and intentions.",
      "year": 2000,
      "slug": "control-problem"
    },
    {
      "title": "Intention",
      "definition": "Planned or desired outcome that an agent aims to achieve through its actions.",
      "year": 1990,
      "slug": "intention"
    },
    {
      "title": "Data Blending",
      "definition": "Process of combining data from multiple sources into a single, cohesive dataset for analysis.",
      "year": 2010,
      "slug": "data-blending"
    },
    {
      "title": "Natural Language",
      "definition": "Any language that has developed naturally among humans, used for everyday communication, such as English, Mandarin, or Spanish.",
      "year": 1956,
      "slug": "natural-language"
    },
    {
      "title": "Image-to-Text Model",
      "definition": "AI systems that convert visual information from images into descriptive textual representations, enabling machines to understand and communicate the content of images.",
      "year": 2014,
      "slug": "image-to-text-model"
    },
    {
      "title": "Word Salad",
      "definition": "Disorganized and nonsensical sequence of words or letters, often making it difficult or impossible to derive coherent meaning from the text.",
      "year": 2021,
      "slug": "word-salad"
    },
    {
      "title": "BQL (Binary Quantization Learning)",
      "definition": "ML method that aims to reduce model complexity and computational cost by quantizing weights and activations to binary values.",
      "year": 2020,
      "slug": "bql-binary-quantization-learning"
    },
    {
      "title": "Flexible Semantics",
      "definition": "Ability of a system to adapt and interpret meaning in a dynamic, context-sensitive manner, particularly within language processing and understanding.",
      "year": 2019,
      "slug": "flexible-semantics"
    },
    {
      "title": "Retrieval-Based Model",
      "definition": "Algorithms that generate responses by selecting them from a predefined set of responses, based on the input they receive.",
      "year": 2019,
      "slug": "retrieval-based-model"
    },
    {
      "title": "Kaleidoscope Hypothesis",
      "definition": "Approach in AI that focuses on the dynamic and context-specific evaluation of machine learning models, particularly in settings where model behavior must adapt to varying real-world conditions.",
      "year": 2022,
      "slug": "kaleidoscope-hypothesis"
    },
    {
      "title": "Transformer",
      "definition": "Deep learning model architecture designed for handling sequential data, especially effective in natural language processing tasks.",
      "year": 2017,
      "slug": "transformer"
    },
    {
      "title": "Counterfactual Explanations",
      "definition": "Statements or scenarios that explain how a different outcome could have been achieved by altering specific inputs or conditions in an AI system.",
      "year": 2017,
      "slug": "counterfactual-explanations"
    },
    {
      "title": "Red Teaming",
      "definition": "Practice where a team independently challenges a system, project, or policy to identify vulnerabilities, improve security, and test the effectiveness of defenses, often applied in cybersecurity and, increasingly, in AI safety and ethics.",
      "year": 1990,
      "slug": "red-teaming"
    },
    {
      "title": "Attestation",
      "definition": "Process of verifying the integrity and authenticity of a system or software, ensuring that it has not been tampered with or compromised.",
      "year": 2020,
      "slug": "attestation"
    },
    {
      "title": "Seq2Seq (Sequence to Sequence)",
      "definition": "Neural network architecture designed to transform sequences of data, such as converting a sentence from one language to another or translating speech into text.",
      "year": 2014,
      "slug": "seq2seq-sequence-to-sequence"
    },
    {
      "title": "Internet Scale",
      "definition": "Systems, applications, or analyses designed to handle and process the vast and diverse data sets available across the entire internet.",
      "year": 2018,
      "slug": "internet-scale"
    },
    {
      "title": "DPO (Direct Preference Optimization)",
      "definition": "ML technique used to optimize models based directly on user preferences rather than traditional loss functions.",
      "year": 2023,
      "slug": "dpo-direct-preference-optimization"
    },
    {
      "title": "Training Compute",
      "definition": "The computational resources required to train an AI model, which fundamentally influence the efficiency, cost, and performance of the training process.",
      "year": 2018,
      "slug": "training-compute"
    },
    {
      "title": "SLAPA (Self-Learning Agent for Performing APIs)",
      "definition": "AI agent designed to autonomously learn and interact with APIs to perform tasks more effectively over time.",
      "year": 2023,
      "slug": "slapa-self-learning-agent-for-performing-apis"
    },
    {
      "title": "MDL (Minimum Description Length)",
      "definition": "Principle formalization of Occam's Razor in information theory, advocating that the best hypothesis for a given set of data is the one that leads to the shortest total description of the data and the hypothesis.",
      "year": 1978,
      "slug": "mdl-minimum-description-length"
    },
    {
      "title": "Image-to-Image Model",
      "definition": "A neural network framework that transforms an input image into an output image, maintaining the semantic context of visual data.",
      "year": 2016,
      "slug": "image-to-image-model"
    },
    {
      "title": "Policy Parameters",
      "definition": "Variables in a ML model, particularly in RL, that define the behavior of the policy by determining the actions an agent takes in different states.",
      "year": 1992,
      "slug": "policy-parameters"
    },
    {
      "title": "Fabless",
      "definition": "Company which designs and markets hardware while outsourcing the manufacturing of silicon wafers and chips to specialized semiconductor foundries.",
      "year": 1984,
      "slug": "fabless"
    },
    {
      "title": "Xavier's Initialization",
      "definition": "Weight initialization technique designed to keep the variance of the outputs of a neuron approximately equal to the variance of its inputs across layers in a deep neural network.",
      "year": 2010,
      "slug": "xaviers-initialization"
    },
    {
      "title": "NLP (Natural Language Processing)",
      "definition": "Field of AI that focuses on the interaction between computers and humans through natural language.",
      "year": 1950,
      "slug": "nlp-natural-language-processing"
    },
    {
      "title": "Equivariance",
      "definition": "Property of a function whereby the function commutes with the actions of a group, meaning that transformations applied to the input result in proportional transformations in the output.",
      "year": 2016,
      "slug": "equivariance"
    },
    {
      "title": "Irreducibility",
      "definition": "A characteristic of certain complex systems or models where they cannot be simplified further without losing essential properties or predictive power.",
      "year": 1936,
      "slug": "irreducibility"
    },
    {
      "title": "MLP (Multilayer Perceptron)",
      "definition": "Type of artificial neural network comprised of multiple layers of neurons, with each layer fully connected to the next, commonly used for tasks involving classification and regression.",
      "year": 1986,
      "slug": "mlp-multilayer-perceptron"
    },
    {
      "title": "SVM (Support Vector Machine)",
      "definition": "Supervised ML model used primarily for classification and regression tasks, which finds the optimal hyperplane that best separates different classes in the data.",
      "year": 1995,
      "slug": "svm-support-vector-machine"
    },
    {
      "title": "Reflective Programming",
      "definition": "Programming paradigm that allows a program to inspect and modify its own structure and behavior at runtime.",
      "year": 1983,
      "slug": "reflective-programming"
    },
    {
      "title": "Self-Supervised Pretraining",
      "definition": "ML approach where a model learns to predict parts of the input data from other parts without requiring labeled data, which is then fine-tuned on downstream tasks.",
      "year": 2019,
      "slug": "self-supervised-pretraining"
    },
    {
      "title": "Model Layer",
      "definition": "Discrete level in a neural network where specific computations or transformations are applied to the input data, progressively abstracting and refining the information as it moves through the network.",
      "year": 2014,
      "slug": "model-layer"
    },
    {
      "title": "Data Efficient Learning",
      "definition": "ML approach that requires fewer data to train a functional model.",
      "year": 2012,
      "slug": "data-efficient-learning"
    },
    {
      "title": "Group-Based Alignment",
      "definition": "Process of coordinating multiple AI systems or agents to work together harmoniously, ensuring their actions align with shared goals and values.",
      "year": 2022,
      "slug": "group-based-alignment"
    },
    {
      "title": "Inference",
      "definition": "Process by which a trained neural network applies learned patterns to new, unseen data to make predictions or decisions.",
      "year": 1965,
      "slug": "inference"
    },
    {
      "title": "GCN (Graph Convolutional Networks)",
      "definition": "Class of neural networks designed to operate on graph-structured data, leveraging convolutional layers to aggregate and transform features from graph nodes and their neighbors.",
      "year": 2016,
      "slug": "gcn-graph-convolutional-networks"
    },
    {
      "title": "SSM (State-Space Model)",
      "definition": "Mathematical frameworks used to model dynamic systems by describing their states in space and how these states evolve over time under the influence of inputs, disturbances, and noise.",
      "year": 1960,
      "slug": "ssm-state-space-model"
    },
    {
      "title": "Search",
      "definition": "The process within AI of exploring possible actions or solutions in order to achieve goals or solve problems.",
      "year": 1960,
      "slug": "search"
    },
    {
      "title": "RLHF++",
      "definition": "Advanced form of RLFH (Reinforcement Learning from Human Feedback), a technique used in ML to enhance model performance by incorporating human feedback into the training process.",
      "year": 2023,
      "slug": "rlhf-plus-plus"
    },
    {
      "title": "LLM (Large Language Model)",
      "definition": "Advanced AI systems trained on extensive datasets to understand, generate, and interpret human language.",
      "year": 2018,
      "slug": "llm-large-language-model"
    },
    {
      "title": "Perceptron Convergence",
      "definition": "A phenomena where a perceptron algorithm effectively stabilizes, ensuring that it can find a solution for linearly separable datasets after a finite number of iterations.",
      "year": 1969,
      "slug": "perceptron-convergence"
    },
    {
      "title": "PPML (Privacy-Preserving Machine Learning)",
      "definition": "Techniques that protect user data privacy during the machine learning process, without compromising the utility of the models.",
      "year": 2017,
      "slug": "ppml-privacy-preserving-machine-learning"
    },
    {
      "title": "Criteria Drift",
      "definition": "Phenomenon where the criteria used to evaluate a ML model change over time, leading to a potential decline in the model's performance.",
      "year": 2020,
      "slug": "criteria-drift"
    },
    {
      "title": "Moloch",
      "definition": "Metaphorical force or systemic dynamic that leads groups or individuals to pursue short-term goals at the expense of long-term well-being or optimal outcomes.",
      "year": 2010,
      "slug": "moloch"
    },
    {
      "title": "MoE (Mixture of Experts)",
      "definition": "ML architecture that utilizes multiple specialist models (experts) to handle different parts of the input space, coordinated by a gating mechanism that decides which expert to use for each input.",
      "year": 1991,
      "slug": "moe-mixture-of-experts"
    },
    {
      "title": "Cognitive Architecture",
      "definition": "A theory or model that outlines the underlying structure and mechanisms of the human mind or AI systems, guiding the integration of various cognitive processes.",
      "year": 1976,
      "slug": "cognitive-architecture"
    },
    {
      "title": "Machine Time",
      "definition": "The time a computer system or a machine spends executing tasks, often used in contrast with human interaction or waiting times. It encompasses the processing time required by the hardware to complete computations or operations.",
      "year": 2020,
      "slug": "machine-time"
    },
    {
      "title": "Toy Diagram",
      "definition": "A simplified visual representation used to illustrate complex AI concepts or models in an accessible and comprehensible manner.",
      "year": 1956,
      "slug": "toy-diagram"
    },
    {
      "title": "Statistical AI",
      "definition": "Utilizes statistical methods to analyze data and make probabilistic inferences, aimed at emulating aspects of human intelligence through quantitative models.",
      "year": 1980,
      "slug": "statistical-ai"
    },
    {
      "title": "Logits",
      "definition": "Raw, unnormalized outputs of the last layer in a neural network before applying the softmax function in classification tasks.",
      "year": 1958,
      "slug": "logits"
    },
    {
      "title": "UTM (Universal Turing Machine)",
      "definition": "Theoretical construct in computer science that can simulate any other Turing machine's computing process given the appropriate input and its own machine's description.",
      "year": 1936,
      "slug": "utm-universal-turing-machine"
    },
    {
      "title": "AIT (Algorithmic Information Theory)",
      "definition": "Studies the complexity of strings and the amount of information they contain, using algorithms and computational methods.",
      "year": 1965,
      "slug": "ait-algorithmic-information-theory"
    },
    {
      "title": "Sentiment Classifier",
      "definition": "NLP tool that identifies and categorizes opinions expressed in a piece of text.",
      "year": 2001,
      "slug": "sentiment-classifier"
    },
    {
      "title": "TFIDF (Term Frequency-Inverse Document Frequency)",
      "definition": "Numerical statistic used to evaluate the importance of a word within a document relative to a collection of documents.",
      "year": 1972,
      "slug": "tfidf-term-frequency-inverse-document-frequency"
    },
    {
      "title": "Joint Embedding Architecture",
      "definition": "Neural network design that learns to map different forms of data (e.g., images and text) into a shared embedding space, facilitating tasks like cross-modal retrieval and multi-modal representation learning.",
      "year": 2019,
      "slug": "joint-embedding-architecture"
    },
    {
      "title": "Autonomous Learning",
      "definition": "Systems capable of learning and adapting their strategies or knowledge without human intervention, based on their interactions with the environment.",
      "year": 1990,
      "slug": "autonomous-learning"
    },
    {
      "title": "Hash Table",
      "definition": "Data structure that stores key-value pairs and allows for fast data retrieval by using a hash function to compute an index into an array of buckets or slots, from which the desired value can be found.",
      "year": 1953,
      "slug": "hash-table"
    },
    {
      "title": "Fourier Features",
      "definition": "Technique used in ML to transform input data into a higher-dimensional space using sine and cosine functions, which can help models learn more complex patterns.",
      "year": 2021,
      "slug": "fourier-features"
    },
    {
      "title": "Next Token Prediction",
      "definition": "Technique used in language modeling where the model predicts the following token based on the previous ones.",
      "year": 2018,
      "slug": "next-token-prediction"
    },
    {
      "title": "ACO (Ant Colony Optimization)",
      "definition": "Probabilistic technique for solving computational problems which can be reduced to finding good paths through graphs, inspired by the behavior of ants seeking paths between their colony and food sources.",
      "year": 1992,
      "slug": "aco-ant-colony-optimization"
    },
    {
      "title": "Causal AI",
      "definition": "A form of AI that reasons using cause and effect logic to provide interpretable predictions and decisions.",
      "year": 2018,
      "slug": "causal-ai"
    },
    {
      "title": "Multi-Class Activation",
      "definition": "A technique used in ML algorithms to manage problems where there are more than two classes or categories.",
      "year": 2015,
      "slug": "multi-class-activation"
    },
    {
      "title": "Supervised Classifier",
      "definition": "Algorithm that, given a set of labeled training data, learns to predict the labels of new, unseen data.",
      "year": 1959,
      "slug": "supervised-classifier"
    },
    {
      "title": "Motor Learning",
      "definition": "Process by which robots or AI systems acquire, refine, and optimize motor skills through experience and practice.",
      "year": 1956,
      "slug": "motor-learning"
    },
    {
      "title": "Counterfactual Fairness",
      "definition": "ML concept that ensures decisions remain fair by being unaffected by sensitive attributes, such as race or gender, in hypothetical scenarios where these attributes are altered.",
      "year": 2017,
      "slug": "counterfactual-fairness"
    },
    {
      "title": "Instrumental Convergence",
      "definition": "Suggests that diverse intelligent agents will likely pursue common sub-goals, such as self-preservation and resource acquisition, to achieve their primary objectives.",
      "year": 2013,
      "slug": "instrumental-convergence"
    },
    {
      "title": "Occam's Razor",
      "definition": "Principle that, among competing models with similar predictive power, the simplest one should be chosen.",
      "year": 1317,
      "slug": "occams-razor"
    },
    {
      "title": "Planetary Scale System",
      "definition": "These systems refer to AI-driven platforms that operate on a global scale, integrating vast data sets and computational resources to tackle complex, worldwide challenges.",
      "year": 0,
      "slug": "planetary-scale-system"
    },
    {
      "title": "PQ (Product Quantization)",
      "definition": "Technique used in large-scale vector quantization for efficient similarity search and data compression by decomposing high-dimensional vectors into smaller sub-vectors and quantizing each sub-vector separately.",
      "year": 2010,
      "slug": "pq-product-quantization"
    },
    {
      "title": "Kaggle Effect",
      "definition": "Phenomenon where ML models developed on Kaggle competitions perform well on specific datasets but may not generalize as effectively to real-world applications due to the unique constraints and optimizations used in these competitions.",
      "year": 2010,
      "slug": "kaggle-effect"
    },
    {
      "title": "ReAct (Reason+Act)",
      "definition": "AI framework for integrating reasoning and acting capabilities, enabling models to make decisions based on both logic and learned actions.",
      "year": 2023,
      "slug": "react-reasonact"
    },
    {
      "title": "Video-to-Text Model",
      "definition": "Transforms video content into descriptive text, allowing machines to automatically generate narratives or summaries from visual data.",
      "year": 2015,
      "slug": "video-to-text-model"
    },
    {
      "title": "Fab",
      "definition": "A fabrication facility, or fab, is where microchips are manufactured using sophisticated processes involving advanced materials and photolithography.",
      "year": 1970,
      "slug": "fab"
    },
    {
      "title": "EEG-to-Text",
      "definition": "A method to transcribe brainwaves into readable text using AI.",
      "year": 2017,
      "slug": "eeg-to-text"
    },
    {
      "title": "Stochastic Parrot",
      "definition": "Language models that generate text based on probabilistic predictions, often criticized for parroting information without understanding.",
      "year": 2021,
      "slug": "stochastic-parrot"
    },
    {
      "title": "Static Inference",
      "definition": "Process of performing predictions using a pre-trained machine learning model without updating the model parameters during runtime.",
      "year": 2018,
      "slug": "static-inference"
    },
    {
      "title": "On-the-fly Program Synthesis",
      "definition": "Automatic creation of executable code in real-time, typically during the execution of a program or in response to specific, immediate computational needs.",
      "year": 2021,
      "slug": "on-the-fly-program-synthesis"
    },
    {
      "title": "Uncertainty Estimation",
      "definition": "Assessment of the confidence level in AI predictions, highlighting areas where model outputs require cautious interpretation.",
      "year": 0,
      "slug": "uncertainty-estimation"
    },
    {
      "title": "Teacher Model",
      "definition": "Pre-trained, high-performing model that guides the training of a simpler, student model, often in the context of knowledge distillation.",
      "year": 2015,
      "slug": "teacher-model"
    },
    {
      "title": "Generative",
      "definition": "Subset of AI technologies capable of generating new content, ideas, or data that mimic human-like outputs.",
      "year": 1980,
      "slug": "generative"
    },
    {
      "title": "Silent Collapse",
      "definition": "Gradual degradation in the performance of AI models when trained on synthetic data produced by other AIs, leading to a decline in output quality over successive iterations.",
      "year": 2022,
      "slug": "silent-collapse"
    },
    {
      "title": "Exponential Slope Blindness",
      "definition": "Human cognitive bias that makes it difficult to perceive and understand the implications of exponential growth accurately.",
      "year": 2022,
      "slug": "exponential-slope-blindness"
    },
    {
      "title": "Preference Model",
      "definition": "Computational framework used to predict and understand an individual's preferences, often applied in recommendation systems and decision-making processes.",
      "year": 1995,
      "slug": "preference-model"
    },
    {
      "title": "Representation Engineering",
      "definition": "The process of designing and selecting the most effective data representations to improve the performance of AI models.",
      "year": 0,
      "slug": "representation-engineering"
    },
    {
      "title": "Linear Complexity",
      "definition": "Situation where the time or space required to solve a problem increases linearly with the size of the input.",
      "year": 1936,
      "slug": "linear-complexity"
    },
    {
      "title": "Computronium Maximizer",
      "definition": "A hypothetical AI system designed to transform all available matter into computronium, an optimized form of matter for computational purposes.",
      "year": 0,
      "slug": "computronium-maximizer"
    },
    {
      "title": "Price Per Token",
      "definition": "Cost of processing a single token used in NLP tasks, particularly when interacting with AI models like GPT.",
      "year": 2022,
      "slug": "price-per-token"
    },
    {
      "title": "Active Externalism",
      "definition": "Theory that cognitive processes can extend beyond the human mind to include external devices or environments as integral components of thinking.",
      "year": 1998,
      "slug": "active-externalism"
    },
    {
      "title": "EBM (Energy-Based Model)",
      "definition": "Class of deep learning models that learn to associate lower energy levels with more probable configurations of the input data.",
      "year": 1985,
      "slug": "ebm-energy-based-model"
    },
    {
      "title": "xLSTM",
      "definition": "Extended form of Long Short-Term Memory (LSTM), integrating enhancements for scalability and efficiency in DL models.",
      "year": 2018,
      "slug": "xlstm"
    },
    {
      "title": "Max Pooling",
      "definition": "Downsampling technique that reduces the dimensionality of input data by selecting the maximum value from a specified subset of the data.",
      "year": 1990,
      "slug": "max-pooling"
    },
    {
      "title": "Assistant Model",
      "definition": "An AI model designed to assist users by providing responses, recommendations, or information based on natural language input.",
      "year": 2020,
      "slug": "assistant-model"
    },
    {
      "title": "Shoggoth",
      "definition": "A meme in AI discourse highlighting the potential uncontrollable, alien nature of advanced AI systems, often embodying concerns about opaque decision processes and unanticipated outcomes.",
      "year": 2010,
      "slug": "shoggoth"
    },
    {
      "title": "DBN (Deep Belief Network)",
      "definition": "A type of artificial neural network that is deeply structured with multiple layers of latent variables, or hidden units.",
      "year": 2006,
      "slug": "dbn-deep-belief-network"
    },
    {
      "title": "Discount Factor",
      "definition": "Multiplicative factor used to reduce future values or rewards to their present value in decision-making processes, particularly in reinforcement learning.",
      "year": 1989,
      "slug": "discount-factor"
    },
    {
      "title": "Wavelet",
      "definition": "Mathematical function used for analyzing localized variations of power within a time series or signal, providing a multi-resolution analysis.",
      "year": 1982,
      "slug": "wavelet"
    },
    {
      "title": "Abliteration",
      "definition": "Technique that uncensors language models by removing alignment restrictions without requiring retraining.",
      "year": 2022,
      "slug": "abliteration"
    },
    {
      "title": "Black Box Problem",
      "definition": "The difficulty in understanding and interpreting how an AI system, particularly ML models, makes decisions.",
      "year": 2016,
      "slug": "black-box-problem"
    },
    {
      "title": "DNC (Differential Neural Computer)",
      "definition": "Advanced type of artificial neural network that integrates an external memory module, enabling it to store and retrieve information similar to a computer, enhancing its capability to solve complex tasks requiring long-term dependencies.",
      "year": 2016,
      "slug": "dnc-differential-neural-computer"
    },
    {
      "title": "Paperclip Maximizer",
      "definition": "Theoretical AI designed to maximize the production of paperclips, illustrating the potential dangers of an AI system pursuing a goal without proper constraints.",
      "year": 2003,
      "slug": "paperclip-maximizer"
    },
    {
      "title": "Initialization",
      "definition": "Process of setting the initial values of the parameters (weights and biases) of a model before training begins.",
      "year": 2010,
      "slug": "initialization"
    },
    {
      "title": "SAE (Structural Adaptive Embeddings)",
      "definition": "Embedding technique that dynamically adapts to the structural properties of the data to improve the representation of complex relationships within the dataset.",
      "year": 2021,
      "slug": "sae-structural-adaptive-embeddings"
    },
    {
      "title": "Direct Manipulation",
      "definition": "An interaction style in user interfaces where users can directly interact with objects on the screen in a continuous and immediate manner.",
      "year": 1983,
      "slug": "direct-manipulation"
    },
    {
      "title": "Image-to-3D Model",
      "definition": "Utilizes AI techniques to convert 2D images into detailed three-dimensional models, facilitating applications in virtual reality, gaming, and design.",
      "year": 2021,
      "slug": "image-to-3d-model"
    },
    {
      "title": "GPS (General Problem Solver)",
      "definition": "Early AI program designed to simulate human problem-solving processes through a heuristic-based approach.",
      "year": 1957,
      "slug": "gps-general-problem-solver"
    },
    {
      "title": "Move 37",
      "definition": "Pivotal move made by AlphaGo in its second game against Go champion Lee Sedol, which showcased the superior strategic capabilities of AI in the game of Go.",
      "year": 2016,
      "slug": "move-37"
    },
    {
      "title": "Orchestration",
      "definition": "Systematic coordination and management of various models, algorithms, and processes to efficiently execute complex tasks and workflows.",
      "year": 2011,
      "slug": "orchestration"
    },
    {
      "title": "Lambda Calculus",
      "definition": "A formal system in mathematical logic and computer science for expressing computation based on function abstraction and application.",
      "year": 1930,
      "slug": "lambda-calculus"
    },
    {
      "title": "Reward Model Ensemble",
      "definition": "Combination of multiple reward models used together to evaluate and guide the learning process of reinforcement learning agents, aiming to improve robustness, accuracy, and generalization of the reward signal.",
      "year": 2021,
      "slug": "reward-model-ensemble"
    },
    {
      "title": "Bias Variance Curve",
      "definition": "A graphical representation illustrating the trade-off between bias and variance in a model's performance as model complexity changes.",
      "year": 0,
      "slug": "bias-variance-curve"
    },
    {
      "title": "Monte Carlo Estimation",
      "definition": "A technique used within AI to approximate the probability of an event by running several simulations and observations.",
      "year": 1949,
      "slug": "monte-carlo-estimation"
    },
    {
      "title": "Dataset",
      "definition": "Collection of related data points organized in a structured format, often used for training and testing machine learning models.",
      "year": 1962,
      "slug": "dataset"
    },
    {
      "title": "Natural Language Problem",
      "definition": "Challenges encountered in understanding, processing, or generating human language using computational methods.",
      "year": 1950,
      "slug": "natural-language-problem"
    },
    {
      "title": "LSTM (Long Short-Term Memory)",
      "definition": "Type of recurrent neural network architecture designed to learn long-term dependencies in sequential data.",
      "year": 1997,
      "slug": "lstm-long-short-term-memory"
    },
    {
      "title": "Turing Test",
      "definition": "Measure of a machine's ability to exhibit intelligent behavior equivalent to, or indistinguishable from, that of a human.",
      "year": 1950,
      "slug": "turing-test"
    },
    {
      "title": "Emergence",
      "definition": "Phenomenon where larger entities, patterns, and regularities arise through interactions among smaller or simpler entities that themselves do not exhibit such properties.",
      "year": 1986,
      "slug": "emergence"
    },
    {
      "title": "Agglomerative Clustering",
      "definition": "A type of hierarchical clustering method in AI used to merge data points into clusters based on similarity measures.",
      "year": 1963,
      "slug": "agglomerative-clustering"
    },
    {
      "title": "DL (Deep Learning)",
      "definition": "Subset of machine learning that involves neural networks with many layers, enabling the modeling of complex patterns in data.",
      "year": 1986,
      "slug": "dl-deep-learning"
    },
    {
      "title": "Text-to-Text Model",
      "definition": "A type of AI model designed to receive natural language input and transform it into another form of natural language output.",
      "year": 2020,
      "slug": "text-to-text-model"
    },
    {
      "title": "Artificial Neuron",
      "definition": "Computational models inspired by biological neurons, serving as the foundational units of artificial neural networks to process input and output signals.",
      "year": 1958,
      "slug": "artificial-neuron"
    },
    {
      "title": "Sparsity",
      "definition": "Technique and principle of having models that utilize minimal data representation and processing, typically through zero or near-zero values.",
      "year": 1986,
      "slug": "sparsity"
    },
    {
      "title": "Promptocracy",
      "definition": "Theoretical governance model where decision-making is guided by AI-generated prompts based on large datasets and probabilistic models.",
      "year": 2023,
      "slug": "promptocracy"
    },
    {
      "title": "Super Prompting",
      "definition": "Method in AI where specific, carefully crafted input prompts are used to guide a model towards generating more accurate or contextually appropriate outputs.",
      "year": 2023,
      "slug": "super-prompting"
    },
    {
      "title": "Low-Bit Palletization",
      "definition": "Process of reducing the bit depth of data representations to streamline computation and improve efficiency in neural network processing and other AI applications.",
      "year": 2021,
      "slug": "low-bit-palletization"
    },
    {
      "title": "ANN (Artificial Neural Networks)",
      "definition": "Computing systems inspired by the biological neural networks that constitute animal brains, designed to progressively improve their performance on tasks by considering examples.",
      "year": 1943,
      "slug": "ann-artificial-neural-networks"
    },
    {
      "title": "Synthetic Data Generation",
      "definition": "Creating artificial data programmatically, often used to train ML models where real data is scarce, sensitive, or biased.",
      "year": 2016,
      "slug": "synthetic-data-generation"
    },
    {
      "title": "Sparse Coupling",
      "definition": "Refers to the concept of using a reduced number of connections between components or nodes in a system to enhance computational efficiency and scalability.",
      "year": 2019,
      "slug": "sparse-coupling"
    },
    {
      "title": "Feature Importance",
      "definition": "Techniques used to identify and rank the significance of input variables (features) in contributing to the predictive power of a ML model.",
      "year": 1986,
      "slug": "feature-importance"
    },
    {
      "title": "Unverifyability",
      "definition": "Inability to confirm the correctness or truth of a system, model, or process, especially in complex AI systems where verification is either impossible or highly difficult.",
      "year": 2021,
      "slug": "unverifyability"
    },
    {
      "title": "Differentiable Parametric Curves",
      "definition": "Mathematical curves described by parametric equations that are differentiable, meaning they have continuous derivatives.",
      "year": 2019,
      "slug": "differentiable-parametric-curves"
    },
    {
      "title": "Variance Reduction Techniques",
      "definition": "Methods used in statistical modeling and ML to decrease the variability of estimation in order to improve accuracy and reliability of predictions.",
      "year": 1986,
      "slug": "variance-reduction-techniques"
    },
    {
      "title": "Random Walk",
      "definition": "Mathematical concept representing a path consisting of a succession of random steps on some mathematical space.",
      "year": 1900,
      "slug": "random-walk"
    },
    {
      "title": "Tensor",
      "definition": "Multi-dimensional array used in mathematics and computer science, serving as a fundamental data structure in neural networks for representing data and parameters.",
      "year": 1900,
      "slug": "tensor"
    },
    {
      "title": "Rainbow Teaming",
      "definition": "Approach that integrates multiple specialized teams, each representing a different function, to comprehensively assess and enhance an organization's security posture.",
      "year": 2022,
      "slug": "rainbow-teaming"
    },
    {
      "title": "Model Drift Minimization",
      "definition": "Strategies and methodologies to ensure that a ML model remains accurate and relevant over time as the underlying data changes.",
      "year": 2016,
      "slug": "model-drift-minimization"
    },
    {
      "title": "Exascale",
      "definition": "Computing systems capable of performing at least one exaflop, or a billion billion (quintillion) calculations per second.",
      "year": 2008,
      "slug": "exascale"
    },
    {
      "title": "Scaling Laws",
      "definition": "Mathematical relationships that describe how the performance of machine learning models, particularly deep learning models, improves as their size, the amount of data, or computational resources increases.",
      "year": 2020,
      "slug": "scaling-laws"
    },
    {
      "title": "Sequence Model",
      "definition": "Model designed to process and predict sequences of data, such as time series, text, or biological sequences.",
      "year": 2014,
      "slug": "sequence-model"
    },
    {
      "title": "State Representation",
      "definition": "The method by which an AI system formulates a concise and informative description of the environment's current situation or context.",
      "year": 1986,
      "slug": "state-representation"
    },
    {
      "title": "NIAN (Needle in a Needlestack)",
      "definition": "Idiom used to describe the difficulty of finding a specific piece of information or data within a vast, but homogeneous, dataset.",
      "year": 2022,
      "slug": "nian-needle-in-a-needlestack"
    },
    {
      "title": "Transfer Learning",
      "definition": "ML method where a model developed for a task is reused as the starting point for a model on a second task, leveraging the knowledge gained from the first task to improve performance on the second.",
      "year": 1995,
      "slug": "transfer-learning"
    },
    {
      "title": "Unembedding",
      "definition": "Process of reversing the transformation of data from its original high-dimensional space to a lower-dimensional space.",
      "year": 2021,
      "slug": "unembedding"
    },
    {
      "title": "Phase Transition",
      "definition": "Critical point where a small change in a parameter or condition causes a significant shift in the system's behavior or performance.",
      "year": 1869,
      "slug": "phase-transition"
    },
    {
      "title": "Guardrails",
      "definition": "Principles, policies, and technical measures implemented to ensure AI systems operate safely, ethically, and within regulatory and societal norms.",
      "year": 2021,
      "slug": "guardrails"
    },
    {
      "title": "Trigrams",
      "definition": "Specific type of n-gram where n is 3, commonly used in language modeling and predicting the next item in NLP.",
      "year": 1980,
      "slug": "trigrams"
    },
    {
      "title": "Hessian Matrix",
      "definition": "Square matrix of second-order partial derivatives of a scalar-valued function, crucial in optimization, particularly for understanding the curvature of multidimensional functions.",
      "year": 1841,
      "slug": "hessian-matrix"
    },
    {
      "title": "Recommendation Systems",
      "definition": "Algorithms designed to suggest relevant items to users (such as movies, books, products, etc.) based on their preferences and behaviors.",
      "year": 1992,
      "slug": "recommendation-systems"
    },
    {
      "title": "Neural Network",
      "definition": "Computing system designed to simulate the way human brains analyze and process information, using a network of interconnected nodes that work together to solve specific problems.",
      "year": 1943,
      "slug": "neural-network"
    },
    {
      "title": "CD (Contrastive Divergence)",
      "definition": "Algorithm used to approximate the gradient of the log-likelihood for training probabilistic models.",
      "year": 2002,
      "slug": "cd-contrastive-divergence"
    },
    {
      "title": "Adversarial Instructions",
      "definition": "Inputs designed to deceive AI models into making incorrect predictions or decisions, highlighting vulnerabilities in their learning algorithms.",
      "year": 2014,
      "slug": "adversarial-instructions"
    },
    {
      "title": "Reranking",
      "definition": "Process in which an initial set of items retrieved by a search algorithm is resorted using a secondary criterion or algorithm to better match user expectations or specific criteria.",
      "year": 2016,
      "slug": "reranking"
    },
    {
      "title": "LLE (Locally Linear Embedding)",
      "definition": "Nonlinear dimensionality reduction technique that preserves local neighborhood information to reduce high-dimensional data to a lower-dimensional space.",
      "year": 2000,
      "slug": "lle-locally-linear-embedding"
    },
    {
      "title": "Sparsability",
      "definition": "Ability of algorithms to effectively handle and process data matrices where most elements are zero (sparse), improving computational efficiency and memory usage.",
      "year": 2015,
      "slug": "sparsability"
    },
    {
      "title": "Blind Alley",
      "definition": "Situation in problem-solving where a path or strategy leads nowhere, offering no further possibilities for progress or solution.",
      "year": 1956,
      "slug": "blind-alley"
    },
    {
      "title": "Autograd",
      "definition": "Automatic differentiation system embedded within various ML frameworks that facilitates the computation of gradients, which are crucial for optimizing models during training.",
      "year": 2015,
      "slug": "autograd"
    },
    {
      "title": "Double Descent",
      "definition": "Phenomenon in ML where the prediction error on test data initially decreases, increases, and then decreases again as model complexity grows.",
      "year": 2019,
      "slug": "double-descent"
    },
    {
      "title": "Verification System",
      "definition": "A verification system ensures that a system meets specified requirements and functions correctly in its intended environment.",
      "year": 1980,
      "slug": "verification-system"
    },
    {
      "title": "Similarity Computation",
      "definition": "A mathematical process to quantify the likeness between data objects, often used in AI to enhance pattern recognition and data clustering.",
      "year": 1990,
      "slug": "similarity-computation"
    },
    {
      "title": "GPU (Graphics Processing Unit)",
      "definition": "Specialized electronic circuit designed to rapidly manipulate and alter memory to accelerate the creation of images in a frame buffer intended for output to a display device, but widely used in deep learning for its parallel processing capabilities.",
      "year": 1985,
      "slug": "gpu-graphics-processing-unit"
    },
    {
      "title": "Directed Evolution",
      "definition": "Use of evolutionary algorithms to iteratively improve ML models or algorithms by mimicking the process of natural selection.",
      "year": 1992,
      "slug": "directed-evolution"
    },
    {
      "title": "Compositional Reasoning",
      "definition": "Cognitive process of understanding complex concepts or systems by breaking them down into their constituent parts and understanding the relationships between these parts.",
      "year": 0,
      "slug": "compositional-reasoning"
    },
    {
      "title": "Supervision",
      "definition": "Use of labeled data to train ML models, guiding the learning process by providing input-output pairs.",
      "year": 1956,
      "slug": "supervision"
    },
    {
      "title": "ZSL (Zero-Shot Learning)",
      "definition": "ML technique where a model learns to recognize objects, tasks, or concepts it has never seen during training.",
      "year": 2009,
      "slug": "zsl-zero-shot-learning"
    },
    {
      "title": "Markov Blanket",
      "definition": "A concept in probabilistic graphical models representing a node's minimal set of dependencies, crucial for inferring the node's behavior in a network.",
      "year": 1988,
      "slug": "markov-blanket"
    },
    {
      "title": "Robustness",
      "definition": "Ability of an algorithm or model to deliver consistent and accurate results under varying operating conditions and input perturbations.",
      "year": 2015,
      "slug": "robustness"
    },
    {
      "title": "Path Integration",
      "definition": "Computational process by which an agent estimates its current position based on its previous position and the path it has taken, using internal cues rather than external landmarks.",
      "year": 1956,
      "slug": "path-integration"
    },
    {
      "title": "Denoising Autoencoder",
      "definition": "A neural network designed to reconstruct a clean input from a corrupted version, enhancing feature extraction by learning robust data representations.",
      "year": 2008,
      "slug": "denoising-autoencoder"
    },
    {
      "title": "DRL (Deep Reinforcement Learning)",
      "definition": "Combines neural networks with a reinforcement learning framework, enabling AI systems to learn optimal actions through trial and error to maximize a cumulative reward.",
      "year": 2013,
      "slug": "drl-deep-reinforcement-learning"
    },
    {
      "title": "SAIF (Secure AI Framework)",
      "definition": "Set of guidelines and best practices developed by Google to enhance the security of AI systems across various applications.",
      "year": 2023,
      "slug": "saif-secure-ai-framework"
    },
    {
      "title": "Autoencoder",
      "definition": "Type of artificial neural network used to learn efficient codings of unlabeled data, typically for the purpose of dimensionality reduction or feature learning.",
      "year": 1987,
      "slug": "autoencoder"
    },
    {
      "title": "Sequence Prediction",
      "definition": "Involves forecasting the next item(s) in a sequence based on the observed pattern of prior sequences.",
      "year": 2014,
      "slug": "sequence-prediction"
    },
    {
      "title": "Transformer Block",
      "definition": "A neural network architecture component essential for efficiently handling sequential data by capturing long-range dependencies using attention mechanisms.",
      "year": 2017,
      "slug": "transformer-block"
    },
    {
      "title": "Expressive Hidden States",
      "definition": "internal representations within a neural network that effectively capture and encode complex patterns and dependencies in the input data.",
      "year": 2017,
      "slug": "expressive-hidden-states"
    },
    {
      "title": "Compute Efficiency",
      "definition": "Effective use of computational resources to maximize performance and minimize waste.",
      "year": 0,
      "slug": "compute-efficiency"
    },
    {
      "title": "AST (Abstract Syntax Tree)",
      "definition": "Data structure significant in compiling or interpreting code, capturing hierarchical properties of the source code syntax.",
      "year": 1960,
      "slug": "ast-abstract-syntax-tree"
    },
    {
      "title": "Black Box",
      "definition": "System or model whose internal workings are not visible or understandable to the user, only the input and output are known.",
      "year": 1966,
      "slug": "black-box"
    },
    {
      "title": "FHE (Fully Homomorphic Encryption)",
      "definition": "Type of encryption that allows computation on ciphertexts, producing an encrypted result that, when decrypted, matches the result of operations performed on the plaintext.",
      "year": 2009,
      "slug": "fhe-fully-homomorphic-encryption"
    },
    {
      "title": "Image-to-Video Model",
      "definition": "Transforms static images into dynamic videos by using advanced AI algorithms to generate plausible temporal information.",
      "year": 2021,
      "slug": "image-to-video-model"
    },
    {
      "title": "Attention Matrix",
      "definition": "Component in attention mechanisms of neural networks that determines the importance of each element in a sequence relative to others, allowing the model to focus on relevant parts of the input when generating outputs.",
      "year": 2014,
      "slug": "attention-matrix"
    },
    {
      "title": "BERT (Bidirectional Encoder Representations from Transformers)",
      "definition": "Deep Learning model for NLP that significantly improves the understanding of context and the meaning of words in sentences by analyzing text bidirectionally.",
      "year": 2018,
      "slug": "bert-bidirectional-encoder-representations-from-transformers"
    },
    {
      "title": "CoT (Chain of Thought)",
      "definition": "Reasoning method employed in AI that mimics human-like thought processes to solve complex problems by breaking them down into a series of simpler, interconnected steps.",
      "year": 2022,
      "slug": "cot-chain-of-thought"
    },
    {
      "title": "Logistic Regression",
      "definition": "Statistical model that estimates the probability of a binary outcome, commonly used for classification tasks.",
      "year": 1958,
      "slug": "logistic-regression"
    },
    {
      "title": "ML (Machine Learning)",
      "definition": "Development of algorithms and statistical models that enable computers to perform tasks without being explicitly programmed for each one.",
      "year": 1959,
      "slug": "ml-machine-learning"
    },
    {
      "title": "Meta-Learning",
      "definition": "Learning to learn involves techniques that enable AI models to learn how to adapt quickly to new tasks with minimal data.",
      "year": 1991,
      "slug": "meta-learning"
    },
    {
      "title": "Base Model",
      "definition": "Pre-trained AI model that serves as a starting point for further training or adaptation on specific tasks or datasets.",
      "year": 2018,
      "slug": "base-model"
    },
    {
      "title": "Polymorphism",
      "definition": "Ability of objects to take on many forms, allowing methods to perform differently based on the object that invokes them.",
      "year": 1967,
      "slug": "polymorphism"
    },
    {
      "title": "Zero-shot Capability",
      "definition": "The ability of AI models to perform tasks or make predictions on new types of data that they have not encountered during training, without needing any example-specific fine-tuning.",
      "year": 2017,
      "slug": "zero-shot-capability"
    },
    {
      "title": "Surrogate Objective",
      "definition": "Alternative goal used to approximate or replace a primary objective in optimization problems, especially when the primary objective is difficult to evaluate directly.",
      "year": 2015,
      "slug": "surrogate-objective"
    },
    {
      "title": "SIMA (Scalable Instructable Multiworld Agent)",
      "definition": "AI agent designed to operate across multiple 3D virtual environments, following natural language instructions to accomplish varied tasks.",
      "year": 2021,
      "slug": "sima-scalable-instructable-multiworld-agent"
    },
    {
      "title": "DTW (Dynamic Time Warping)",
      "definition": "Algorithm used to measure similarity between two time series by aligning them in a nonlinear fashion, allowing for comparisons even when there are shifts and distortions in time.",
      "year": 1972,
      "slug": "dtw-dynamic-time-warping"
    },
    {
      "title": "RBMs (Restricted Boltzmann Machines)",
      "definition": "Type of generative stochastic artificial neural network that can learn a probability distribution over its set of inputs.",
      "year": 1986,
      "slug": "rbms-restricted-boltzmann-machines"
    },
    {
      "title": "Training",
      "definition": "Process of teaching a ML model to make accurate predictions or decisions, by adjusting its parameters based on data.",
      "year": 1956,
      "slug": "training"
    },
    {
      "title": "Function Approximation",
      "definition": "Method used in AI to estimate complex functions using simpler, computationally efficient models.",
      "year": 1962,
      "slug": "function-approximation"
    },
    {
      "title": "Categorical Deep Learning",
      "definition": "Application of DL techniques to analyze and predict categorical data, which includes discrete and typically non-numeric values that represent categories or classes.",
      "year": 2020,
      "slug": "categorical-deep-learning"
    },
    {
      "title": "Cooperativity",
      "definition": "How multiple agents or components work together in a system to achieve better performance or solutions than they could individually.",
      "year": 2016,
      "slug": "cooperativity"
    },
    {
      "title": "AlexNet",
      "definition": "Deep convolutional neural network that significantly advanced the field of computer vision by winning the ImageNet Large Scale Visual Recognition Challenge in 2012.",
      "year": 2012,
      "slug": "alexnet"
    },
    {
      "title": "Sequence Masking",
      "definition": "ML technique to prevent certain parts of input sequences from influencing the training process of models, particularly in natural language processing tasks.",
      "year": 2017,
      "slug": "sequence-masking"
    },
    {
      "title": "Discriminator",
      "definition": "Model that determines the likelihood of a given input being real or fake, typically used in generative adversarial networks (GANs).",
      "year": 2014,
      "slug": "discriminator"
    },
    {
      "title": "Effective Accelerationism",
      "definition": "Ideology that encourages the rapid advancement of technology, especially AI, to address global challenges and accelerate progress towards a technologically advanced future.",
      "year": 2021,
      "slug": "effective-accelerationism"
    },
    {
      "title": "Chinese Room",
      "definition": "Thought experiment by philosopher John Searle that challenges the notion that a computer running a program can truly \"understand\" language or exhibit consciousness, despite appearing to do so.",
      "year": 1980,
      "slug": "chinese-room"
    },
    {
      "title": "Heuristic Search Techniques",
      "definition": "Methods used in AI to find solutions or make decisions more efficiently by using rules of thumb or informed guesses to guide the search process.",
      "year": 1959,
      "slug": "heuristic-search-techniques"
    },
    {
      "title": "Parameterized",
      "definition": "Model or function in AI that utilizes parameters to make predictions or decisions.",
      "year": 1936,
      "slug": "parameterized"
    },
    {
      "title": "AI Auditing",
      "definition": "The process of examining, monitoring and improving AI systems to ensure ethical, fair, transparent, and accountable operation.",
      "year": 2016,
      "slug": "ai-auditing"
    },
    {
      "title": "Cross-Domain Competency",
      "definition": "Ability of an AI system to understand, learn, and apply knowledge and skills across multiple, varied domains or areas of expertise.",
      "year": 2021,
      "slug": "cross-domain-competency"
    },
    {
      "title": "Best-of-N",
      "definition": "A strategy in AI that involves generating multiple outputs and selecting the best one based on a predefined criterion or scoring function.",
      "year": 1971,
      "slug": "best-of-n"
    },
    {
      "title": "SoftMax",
      "definition": "Function that converts a vector of numerical values into a vector of probabilities, where the probabilities of each value are proportional to the exponentials of the input numbers.",
      "year": 1982,
      "slug": "softmax"
    },
    {
      "title": "Pretrained Model",
      "definition": "ML model that has been previously trained on a large dataset and can be fine-tuned or used as is for similar tasks or applications.",
      "year": 2013,
      "slug": "pretrained-model"
    },
    {
      "title": "Quantum Computing",
      "definition": "An area of computing focused on developing computer technology centered around the principles of quantum theory, which explains the behavior of energy and material on the quantum level.",
      "year": 1980,
      "slug": "quantum-computing"
    },
    {
      "title": "Generative AI",
      "definition": "Subset of AI technologies that can generate new content, ranging from text and images to music and code, based on learned patterns and data.",
      "year": 2014,
      "slug": "generative-ai"
    },
    {
      "title": "Panel-of-Experts",
      "definition": "Decision-making system where multiple experts provide their opinions or solutions, and the consensus or most supported option is chosen.",
      "year": 1986,
      "slug": "panel-of-experts"
    },
    {
      "title": "Variance Scaling",
      "definition": "Variance scaling is a technique used in machine learning to ensure weights of layers are initialized in a way that maintains consistent variance of activations throughout a neural network.",
      "year": 2015,
      "slug": "variance-scaling"
    },
    {
      "title": "Regularization",
      "definition": "Technique used in machine learning to reduce model overfitting by adding a penalty to the loss function based on the complexity of the model.",
      "year": 1970,
      "slug": "regularization"
    },
    {
      "title": "Super Alignment",
      "definition": "Theoretical concept in AI, primarily focusing on ensuring that advanced AI systems or AGI align closely with human values and ethics to prevent negative outcomes.",
      "year": 2023,
      "slug": "super-alignment"
    },
    {
      "title": "Memory Systems",
      "definition": "Mechanisms and structures designed to store, manage, and recall information, enabling machines to learn from past experiences and perform complex tasks.",
      "year": 1960,
      "slug": "memory-systems"
    },
    {
      "title": "GPU-Poor",
      "definition": "Scenario where there is a lack of adequate GPU resources available for computational tasks.",
      "year": 2022,
      "slug": "gpu-poor"
    },
    {
      "title": "Replaced Token Detection",
      "definition": "Method used in self-supervised learning where the task involves identifying or predicting tokens that have been intentionally altered or replaced in a given sequence.",
      "year": 2020,
      "slug": "replaced-token-detection"
    },
    {
      "title": "Chinchilla Scaling",
      "definition": "Strategy in training LLMs that optimizes the ratio of model size to training data size.",
      "year": 2021,
      "slug": "chinchilla-scaling"
    },
    {
      "title": "Parallelism",
      "definition": "Simultaneous execution of multiple processes or tasks to improve performance and efficiency.",
      "year": 1960,
      "slug": "parallelism"
    },
    {
      "title": "Mixture Model",
      "definition": "Probabilistic model that assumes that the data is generated from a mixture of several distributions, each representing a different subpopulation within the overall population.",
      "year": 1980,
      "slug": "mixture-model"
    },
    {
      "title": "FPGA (Field-Programmable Gate Array)",
      "definition": "Type of integrated circuit that can be configured by the customer or designer after manufacturing.",
      "year": 1985,
      "slug": "fpga-field-programmable-gate-array"
    },
    {
      "title": "Speech Processing",
      "definition": "Technology that enables computers to recognize, interpret, and generate human speech.",
      "year": 1952,
      "slug": "speech-processing"
    },
    {
      "title": "P-hacking",
      "definition": "Manipulation of data analysis to achieve statistically significant results, often by repeatedly testing different variables or subsets of data until desirable outcomes are found.",
      "year": 2014,
      "slug": "p-hacking"
    },
    {
      "title": "Instantiation",
      "definition": "Process of creating a specific instance of an abstract concept, algorithm, or data structure, allowing for its practical use and application.",
      "year": 1956,
      "slug": "instantiation"
    },
    {
      "title": "Backpropagation",
      "definition": "Algorithm used for training artificial neural networks, crucial for optimizing the weights to minimize error between predicted and actual outcomes.",
      "year": 1986,
      "slug": "backpropagation"
    },
    {
      "title": "Task Environment",
      "definition": "Setting or context within which an intelligent agent operates and attempts to achieve its objectives.",
      "year": 1956,
      "slug": "task-environment"
    },
    {
      "title": "LN (Layer Normalization)",
      "definition": "Technique in deep learning that standardizes the inputs of each layer independently, improving the stability of the neural network.",
      "year": 2016,
      "slug": "ln-layer-normalization"
    },
    {
      "title": "ACI (Agent-Computer Interface)",
      "definition": "Systems and methods that enable interactive communication between autonomous agents and computer programs.",
      "year": 2018,
      "slug": "aci-agent-computer-interface"
    },
    {
      "title": "Data Mining",
      "definition": "Extracting valuable information from large datasets to identify patterns, trends, and relationships that may not be immediately apparent.",
      "year": 1990,
      "slug": "data-mining"
    },
    {
      "title": "Diffusion Forcing",
      "definition": "Intentional manipulation of diffusion models to guide the generation of data towards desired outcomes.",
      "year": 2021,
      "slug": "diffusion-forcing"
    },
    {
      "title": "Hypothesis Testing",
      "definition": "A statistical method used to make decisions or inferences about one or more data sets.",
      "year": 1933,
      "slug": "hypothesis-testing"
    },
    {
      "title": "Dual Use Foundational Model",
      "definition": "AI systems designed for general purposes that can be adapted for both beneficial and potentially harmful applications.",
      "year": 2021,
      "slug": "dual-use-foundational-model"
    },
    {
      "title": "ASL (AI Safety Level)",
      "definition": "Tiered system for categorizing the risk levels associated with AI systems to guide their development and deployment responsibly.",
      "year": 0,
      "slug": "asl-ai-safety-level"
    },
    {
      "title": "Superintelligence",
      "definition": "A form of AI that surpasses the cognitive performance of humans in virtually all domains of interest, including creativity, general wisdom, and problem-solving.",
      "year": 1998,
      "slug": "superintelligence"
    },
    {
      "title": "SIL (Simulator in the Loop)",
      "definition": "Methodology in which a simulator is integrated into the control loop of a system, providing a virtual environment for real-time testing and validation of algorithms, control strategies, or system performance.",
      "year": 2020,
      "slug": "sil-simulator-in-the-loop"
    },
    {
      "title": "Neuroevolution",
      "definition": "AI approach that uses evolutionary algorithms to develop and optimize artificial neural networks.",
      "year": 1986,
      "slug": "neuroevolution"
    },
    {
      "title": "Hyperparameter Tuning",
      "definition": "Process of optimizing the parameters of a ML model that are not learned from data, aiming to improve model performance.",
      "year": 1986,
      "slug": "hyperparameter-tuning"
    },
    {
      "title": "Unstructured Data",
      "definition": "Data that lacks a pre-defined format or organization, making it challenging to collect, process, and analyze using conventional database tools.",
      "year": 1990,
      "slug": "unstructured-data"
    },
    {
      "title": "Inference-Time Reasoning",
      "definition": "Process by which a trained AI model applies learned patterns to new data to make decisions or predictions during its operational phase.",
      "year": 0,
      "slug": "inference-time-reasoning"
    },
    {
      "title": "Bayesian Inference",
      "definition": "Method of statistical inference in which Bayes' theorem is used to update the probability estimate for a hypothesis as more evidence or information becomes available.",
      "year": 1763,
      "slug": "bayesian-inference"
    },
    {
      "title": "Incidental Polysemanticity",
      "definition": "Phenomenon where a neural network, particularly in large language models, learns to associate multiple meanings or interpretations with a single internal representation or neuron, often without explicit instruction.",
      "year": 2020,
      "slug": "incidental-polysemanticity"
    },
    {
      "title": "Discriminative AI",
      "definition": "Algorithms that learn the boundary between classes of data, focusing on distinguishing between different outputs given an input.",
      "year": 2014,
      "slug": "discriminative-ai"
    },
    {
      "title": "Unhobbling",
      "definition": "Process of unlocking latent capabilities in AI models by addressing limitations and inefficiencies, thus significantly enhancing their practical utility.",
      "year": 2022,
      "slug": "unhobbling"
    },
    {
      "title": "Clanker",
      "definition": "Slang term used pejoratively to refer to robots or AI systems, especially those seen as replacements for human jobs, reflecting anti-AI sentiment in popular discourse.",
      "year": 2010,
      "slug": "clanker"
    },
    {
      "title": "Rightsizing",
      "definition": "Adjusting the computational resources allocated to AI systems to match the workload requirements optimally.",
      "year": 2020,
      "slug": "rightsizing"
    },
    {
      "title": "Segmentation",
      "definition": "Process in AI that subdivides an image or dataset into multiple parts to simplify and/or change the perspective of comprehension.",
      "year": 1965,
      "slug": "segmentation"
    },
    {
      "title": "LoRA (Low-Rank Adaptation)",
      "definition": "Technique for fine-tuning LLMs in a parameter-efficient manner.",
      "year": 2021,
      "slug": "lora-low-rank-adaptation"
    },
    {
      "title": "Hyperspherical Representation Learning",
      "definition": "Technique of learning representations within a multidimensional sphere to leverage inherent geometric properties.",
      "year": 2021,
      "slug": "hyperspherical-representation-learning"
    },
    {
      "title": "Biomarkers",
      "definition": "Identifiable biological indicators that offer valuable insights into the health or disease status of an individual in the context of AI.",
      "year": 1950,
      "slug": "biomarkers"
    },
    {
      "title": "Video-to-Image Model",
      "definition": "AI systems designed to extract and generate specific static images from video inputs for analysis or utility purposes.",
      "year": 2021,
      "slug": "video-to-image-model"
    },
    {
      "title": "Fact-Checking AI",
      "definition": "An application of AI designed to authenticate and validate the truthfulness of information.",
      "year": 2019,
      "slug": "fact-checking-ai"
    },
    {
      "title": "Compute",
      "definition": "Processing power and resources required to run AI algorithms and models.",
      "year": 1946,
      "slug": "compute"
    },
    {
      "title": "Neurogenesis",
      "definition": "Process by which new neurons are formed in the brain.",
      "year": 1962,
      "slug": "neurogenesis"
    },
    {
      "title": "CUDA (Compute Unified Device Architecture)",
      "definition": "Parallel computing platform and application programming interface (API) that allows software developers and software engineers to use a graphics processing unit (GPU) for general purpose processing.",
      "year": 2007,
      "slug": "cuda-compute-unified-device-architecture"
    },
    {
      "title": "Church-Turing Thesis",
      "definition": "A hypothesis proposing that any computational problem solvable by a human using algorithms can also be solved by a Turing machine, which forms a foundation for the theoretical limits of computation.",
      "year": 1936,
      "slug": "church-turing-thesis"
    },
    {
      "title": "Algorithmic Probability",
      "definition": "Quantifies the likelihood that a random program will produce a specific output on a universal Turing machine, forming a core component of algorithmic information theory.",
      "year": 1960,
      "slug": "algorithmic-probability"
    },
    {
      "title": "Inverse Problems",
      "definition": "Determining the underlying causes or parameters from observed data, essentially reversing the usual process of predicting effects from known causes.",
      "year": 1923,
      "slug": "inverse-problems"
    },
    {
      "title": "Cybernetics",
      "definition": "Interdisciplinary study of control and communication in living organisms and machines.",
      "year": 1948,
      "slug": "cybernetics"
    },
    {
      "title": "Hypernetwork",
      "definition": "Neural network that generates the weights for another neural network, enabling dynamic adaptation and increased flexibility in learning and generalization.",
      "year": 2016,
      "slug": "hypernetwork"
    },
    {
      "title": "Adaptive Problem Solving",
      "definition": "The capacity of AI systems to modify their approaches to problem-solving based on new data, feedback, or changing environments, enhancing their efficiency and effectiveness over time.",
      "year": 1956,
      "slug": "adaptive-problem-solving"
    },
    {
      "title": "Feature Design",
      "definition": "Process of selecting, modifying, or creating new features from raw data to improve the performance of machine learning models.",
      "year": 1986,
      "slug": "feature-design"
    },
    {
      "title": "Distillation",
      "definition": "Process of compressing a larger, complex model (the teacher) into a smaller, simpler model (the student) while retaining much of the original model's performance.",
      "year": 2015,
      "slug": "distillation"
    },
    {
      "title": "Recognition Model",
      "definition": "Element of AI that identifies patterns and features in data through learning processes.",
      "year": 2014,
      "slug": "recognition-model"
    },
    {
      "title": "Symbolic Regression",
      "definition": "Type of regression analysis that searches for mathematical expressions to best fit a given set of data points.",
      "year": 1989,
      "slug": "symbolic-regression"
    },
    {
      "title": "Generative Workflow",
      "definition": "Process of using AI to automatically create content, such as text, images, or music, based on learned patterns from data.",
      "year": 2021,
      "slug": "generative-workflow"
    },
    {
      "title": "Dimension",
      "definition": "Number of features or attributes that represent a data point in a vector space.",
      "year": 1936,
      "slug": "dimension"
    },
    {
      "title": "Generator Verifier Gap",
      "definition": "The difference between the capability of AI models to generate data and the ability to verify its authenticity or accuracy.",
      "year": 2020,
      "slug": "generator-verifier-gap"
    },
    {
      "title": "Valence",
      "definition": "Emotional value associated with a particular stimulus, often used in AI to fine-tune emotional processing.",
      "year": 1995,
      "slug": "valence"
    },
    {
      "title": "LVLMs (Large Vision Language Models)",
      "definition": "Advanced AI systems designed to integrate and interpret both visual and textual data, enabling more sophisticated understanding and generation based on both modalities.",
      "year": 2023,
      "slug": "lvlms-large-vision-language-models"
    },
    {
      "title": "Autoregressive Prediction",
      "definition": "Involves predicting future values in a sequence based on past values using a self-referential model.",
      "year": 1970,
      "slug": "autoregressive-prediction"
    },
    {
      "title": "Wait Calculation",
      "definition": "Assessing whether to proceed with projects immediately or wait for future advancements in AI that could offer significant benefits.",
      "year": 2022,
      "slug": "wait-calculation"
    },
    {
      "title": "General World Model",
      "definition": "AI systems designed to generate internal representations of the world, enabling them to predict and interact with their environment effectively across a broad range of scenarios.",
      "year": 2020,
      "slug": "general-world-model"
    },
    {
      "title": "Alignment Platform",
      "definition": "Framework designed to ensure that AI operates in ways that are aligned with human values, ethics, and objectives.",
      "year": 2021,
      "slug": "alignment-platform"
    },
    {
      "title": "Vanishing Gradient",
      "definition": "Phenomenon in neural networks where gradients of the network's parameters become very small, effectively preventing the weights from changing their values during training.",
      "year": 1991,
      "slug": "vanishing-gradient"
    },
    {
      "title": "Church Encoding",
      "definition": "A technique in mathematical logic and computer science to represent data and operators in the lambda calculus.",
      "year": 1940,
      "slug": "church-encoding"
    },
    {
      "title": "LFMs (Liquid Foundation Models)",
      "definition": "'New category of generative AI models designed by Liquid AI, optimized for both efficiency and scalability across various data types like text, audio, and video. '",
      "year": 2023,
      "slug": "lfms-liquid-foundation-models"
    },
    {
      "title": "Latent Space",
      "definition": "Abstract, multi-dimensional representation of data where similar items are mapped close together, commonly used in ML and AI models.",
      "year": 2013,
      "slug": "latent-space"
    },
    {
      "title": "LAQ (Locally-Adaptive Quantization)",
      "definition": "Technique used in data compression and neural network optimization that adjusts quantization levels based on local data characteristics to improve accuracy and efficiency.",
      "year": 2021,
      "slug": "laq-locally-adaptive-quantization"
    },
    {
      "title": "Ground Truth",
      "definition": "Data that is considered a true, accurate, or actual representation used for comparison with analytical model outputs.",
      "year": 1956,
      "slug": "ground-truth"
    },
    {
      "title": "AI Watchdog",
      "definition": "Organizations, frameworks, or systems designed to monitor, regulate, and guide the development and deployment of artificial intelligence technologies to ensure they adhere to ethical standards, legal requirements, and societal expectations.",
      "year": 2019,
      "slug": "ai-watchdog"
    },
    {
      "title": "MPC (Model-Predictive Control)",
      "definition": "Control algorithm that uses a model of the system to predict future states and optimizes control actions over a future time horizon.",
      "year": 1970,
      "slug": "mpc-model-predictive-control"
    },
    {
      "title": "MDPO (Mirror Descent Policy Optimization)",
      "definition": "Optimization algorithm used in reinforcement learning to update policies by leveraging the mirror descent technique, which balances exploration and exploitation more effectively than traditional gradient descent methods.",
      "year": 2020,
      "slug": "mdpo-mirror-descent-policy-optimization"
    },
    {
      "title": "GPT (Generative Pre-Trained Transformer)",
      "definition": "Type of neural network architecture that excels in generating human-like text based on the input it receives.",
      "year": 2018,
      "slug": "gpt-generative-pre-trained-transformer"
    },
    {
      "title": "Roko's Basilisk",
      "definition": "Thought experiment proposing that a future all-powerful AI could punish those who did not help bring about its existence.",
      "year": 2010,
      "slug": "rokos-basilisk"
    },
    {
      "title": "Inductive Bias",
      "definition": "Assumptions integrated into a learning algorithm to enable it to generalize from specific instances to broader patterns or concepts.",
      "year": 1986,
      "slug": "inductive-bias"
    },
    {
      "title": "Stateful",
      "definition": "System or application that saves client data from previous sessions to influence and personalize future interactions.",
      "year": 1960,
      "slug": "stateful"
    },
    {
      "title": "Activation Data",
      "definition": "Intermediate outputs produced by neurons in a neural network when processing input data, which are used to evaluate and update the network during training.",
      "year": 2015,
      "slug": "activation-data"
    },
    {
      "title": "Fourier Analysis",
      "definition": "Mathematical method for decomposing functions or signals into their constituent frequencies.",
      "year": 1822,
      "slug": "fourier-analysis"
    },
    {
      "title": "Deterministic Quoting",
      "definition": "Method ensuring that AI-generated quotations from source materials are verbatim and not subject to AI-induced hallucinations.",
      "year": 2022,
      "slug": "deterministic-quoting"
    },
    {
      "title": "Embedding Space",
      "definition": "Mathematical representation where high-dimensional vectors of data points, such as text, images, or other complex data types, are transformed into a lower-dimensional space that captures their essential properties.",
      "year": 2013,
      "slug": "embedding-space"
    },
    {
      "title": "MDO (Multidomain Operations)",
      "definition": "Strategic and tactical integration of capabilities across multiple domains—such as land, sea, air, space, and cyberspace—enabled and enhanced by artificial intelligence and advanced technologies.",
      "year": 2017,
      "slug": "mdo-multidomain-operations"
    },
    {
      "title": "LDA (Latent Dirichlet Allocation)",
      "definition": "Generative statistical model often used in natural language processing to discover hidden (or latent) topics within a collection of documents.",
      "year": 2003,
      "slug": "lda-latent-dirichlet-allocation"
    },
    {
      "title": "Fourier Transform",
      "definition": "Mathematical transformation that decomposes a function or signal into its constituent frequencies, often used in AI for signal processing and data analysis.",
      "year": 0,
      "slug": "fourier-transform"
    },
    {
      "title": "MCTS (Monte Carlo Tree Search)",
      "definition": "A heuristic search algorithm utilized in decision-making processes often associated with game playing to explore large decision spaces by executing randomized simulations.",
      "year": 2006,
      "slug": "mcts-monte-carlo-tree-search"
    },
    {
      "title": "Goal",
      "definition": "Desired outcome or objective that an AI system is programmed to achieve.",
      "year": 1960,
      "slug": "goal"
    },
    {
      "title": "NeRF (Neural Radiance Fields)",
      "definition": "Technique for creating high-quality 3D models from a set of 2D images using deep learning.",
      "year": 2020,
      "slug": "nerf-neural-radiance-fields"
    },
    {
      "title": "Router",
      "definition": "Mechanism that directs queries to the most suitable model or sub-component within a multi-model or multi-component architecture to optimize performance and accuracy.",
      "year": 1981,
      "slug": "router"
    },
    {
      "title": "TTS (Text-to-Speech)",
      "definition": "Converts written text into spoken voice output, enabling computers to read text aloud.",
      "year": 1968,
      "slug": "tts-text-to-speech"
    },
    {
      "title": "Adapter Layer",
      "definition": "Neural network layer used to enable transfer learning by adding small, trainable modules to a pre-trained model, allowing it to adapt to new tasks with minimal additional training.",
      "year": 2019,
      "slug": "adapter-layer"
    },
    {
      "title": "Hallucination",
      "definition": "Generation of inaccurate, fabricated, or irrelevant output by a model, not grounded in the input data or reality.",
      "year": 2020,
      "slug": "hallucination"
    },
    {
      "title": "Co-Pilot",
      "definition": "System designed to assist humans in various tasks by offering suggestions, automating routine tasks, and enhancing decision-making processes.",
      "year": 2021,
      "slug": "co-pilot"
    },
    {
      "title": "Accelerator",
      "definition": "Hardware designed to speed up specific types of computations, such as those needed for AI model training and inference.",
      "year": 1970,
      "slug": "accelerator"
    },
    {
      "title": "Model Management",
      "definition": "Practices and technologies used to handle various lifecycle stages of machine learning models including development, deployment, monitoring, and maintenance.",
      "year": 2018,
      "slug": "model-management"
    },
    {
      "title": "MLE (Maximum Likelihood Estimation)",
      "definition": "Statistical method used to estimate the parameters of a probability distribution by maximizing a likelihood function.",
      "year": 1912,
      "slug": "mle-maximum-likelihood-estimation"
    },
    {
      "title": "Video-to-Video Model",
      "definition": "A model that transforms input videos into an output video with altered or enhanced visual characteristics while retaining the temporal coherence of the original.",
      "year": 2018,
      "slug": "video-to-video-model"
    },
    {
      "title": "DNN (Deep Neural Networks)",
      "definition": "Advanced neural network architectures with multiple layers that enable complex pattern recognition and learning from large amounts of data.",
      "year": 1986,
      "slug": "dnn-deep-neural-networks"
    },
    {
      "title": "Output Verifier",
      "definition": "Mechanism used to confirm that the output of a system, particularly in software or hardware systems, matches the expected results, ensuring accuracy and correctness.",
      "year": 2022,
      "slug": "output-verifier"
    },
    {
      "title": "Deepfakes",
      "definition": "Synthetic media produced by AI technologies that superimpose existing images or videos onto source images or videos to create realistic likenesses.",
      "year": 2017,
      "slug": "deepfakes"
    },
    {
      "title": "TEM (Trusted Execution Monitor)",
      "definition": "Security component that ensures the integrity and confidentiality of code and data within a computer system by managing and protecting execution environments.",
      "year": 2021,
      "slug": "tem-trusted-execution-monitor"
    },
    {
      "title": "Knowledge Representation",
      "definition": "Method by which AI systems formalize and utilize the knowledge necessary to solve complex tasks.",
      "year": 1956,
      "slug": "knowledge-representation"
    },
    {
      "title": "Data Imputation",
      "definition": "Process of replacing missing or incomplete data within a dataset with substituted values to maintain the dataset's integrity and usability.",
      "year": 0,
      "slug": "data-imputation"
    },
    {
      "title": "Confusion Matrix",
      "definition": "Table used to evaluate the performance of a classification model by visualizing its true versus predicted values.",
      "year": 1954,
      "slug": "confusion-matrix"
    },
    {
      "title": "EMT (Extended Mind Transformer)",
      "definition": "Transformer model architecture that integrates external memory systems to enhance the model's ability to handle long-range dependencies and maintain relevant information over extended inputs.",
      "year": 2021,
      "slug": "emt-extended-mind-transformer"
    },
    {
      "title": "Decision Tree",
      "definition": "Flowchart-like tree structure where each internal node represents a \"test\" on an attribute, each branch represents the outcome of the test, and each leaf node represents a class label (decision taken after computing all attributes).",
      "year": 1966,
      "slug": "decision-tree"
    },
    {
      "title": "Prompt",
      "definition": "User-generated input or question designed to elicit a specific response or output from the model.",
      "year": 2020,
      "slug": "prompt"
    },
    {
      "title": "Collaborative Intelligence",
      "definition": "Synergy between human intelligence and AI to achieve outcomes neither could accomplish alone.",
      "year": 2016,
      "slug": "collaborative-intelligence"
    },
    {
      "title": "Dropout",
      "definition": "Regularization technique used in neural networks to prevent overfitting by randomly omitting a subset of neurons during training.",
      "year": 2012,
      "slug": "dropout"
    },
    {
      "title": "Negation Problem",
      "definition": "Challenges in handling and interpreting negations correctly in AI systems, affecting model predictions and natural language understanding.",
      "year": 2020,
      "slug": "negation-problem"
    },
    {
      "title": "Autoregressive Sequence Generator",
      "definition": "A predictive model harnessed in AI tasks, particularly involving times series, which leverages its own prior outputs as inputs in subsequent predictions.",
      "year": 2014,
      "slug": "autoregressive-sequence-generator"
    },
    {
      "title": "One-Shot Learning",
      "definition": "ML technique where a model learns information about object categories from a single training example.",
      "year": 2006,
      "slug": "one-shot-learning"
    },
    {
      "title": "Cognitive Flexibility",
      "definition": "Mental ability to switch between thinking about two different concepts, or to think about multiple concepts simultaneously.",
      "year": 1990,
      "slug": "cognitive-flexibility"
    },
    {
      "title": "Symbolic Computing",
      "definition": "A paradigm in AI that uses symbolic representations of problems and logic-based reasoning to perform computational tasks and solve complex problems.",
      "year": 1956,
      "slug": "symbolic-computing"
    },
    {
      "title": "Scientific Computing",
      "definition": "Computational methods and tools to solve complex scientific and engineering problems.",
      "year": 1946,
      "slug": "scientific-computing"
    },
    {
      "title": "Random Forest",
      "definition": "Robust ML algorithm that combines multiple decision trees to improve prediction accuracy and prevent overfitting.",
      "year": 2001,
      "slug": "random-forest"
    },
    {
      "title": "Dot Product Similarity",
      "definition": "Measures the similarity between two vectors by calculating the sum of the products of their corresponding entries.",
      "year": 1957,
      "slug": "dot-product-similarity"
    },
    {
      "title": "Transfer Capability",
      "definition": "A feature of AI systems that allows acquired knowledge in one domain or task to be applied to another distinct but related domain or task.",
      "year": 1997,
      "slug": "transfer-capability"
    },
    {
      "title": "SSF (Stochastic Similarity Filter)",
      "definition": "Moderates GPU usage by skipping processing of similar consecutive input images, thereby improving computational efficiency in real-time image and video generation tasks.",
      "year": 2021,
      "slug": "ssf-stochastic-similarity-filter"
    },
    {
      "title": "Infinite Context Window",
      "definition": "Method in NLP where a model has potential to consider entire available preceding information for predictions.",
      "year": 2023,
      "slug": "infinite-context-window"
    },
    {
      "title": "Lovelace Test",
      "definition": "Designed to determine a machine's capability to create art or other outputs that it was not explicitly programmed to generate, challenging it to fool a human into believing the outputs were created by a human.",
      "year": 2001,
      "slug": "lovelace-test"
    },
    {
      "title": "Actor-Critic Models",
      "definition": "'Reinforcement learning architecture that includes two components: an actor that determines the actions to take and a critic that evaluates those actions to improve the policy.'",
      "year": 1977,
      "slug": "actor-critic-models"
    },
    {
      "title": "Linear Separability",
      "definition": "The ability of a dataset to be perfectly separated into two classes using a straight line in two dimensions or a hyperplane in higher dimensions.",
      "year": 1960,
      "slug": "linear-separability"
    },
    {
      "title": "Residual Connections",
      "definition": "DL architecture feature designed to help alleviate the vanishing gradient problem by allowing gradients to flow through a network more effectively.",
      "year": 2015,
      "slug": "residual-connections"
    },
    {
      "title": "Bayesian Optimization",
      "definition": "Strategy for optimizing complex, expensive-to-evaluate functions by building a probabilistic model of the function and using it to select the most promising points to evaluate.",
      "year": 1978,
      "slug": "bayesian-optimization"
    },
    {
      "title": "Polymathic AI",
      "definition": "AI systems that possess a wide range of skills and knowledge, enabling them to perform tasks across various domains, much like a human polymath.",
      "year": 2022,
      "slug": "polymathic-ai"
    },
    {
      "title": "Narrow AI",
      "definition": "Also known as Weak AI, refers to AI systems designed to perform a specific task or a narrow range of tasks with a high level of proficiency.",
      "year": 2005,
      "slug": "narrow-ai"
    },
    {
      "title": "CLI (Command Line Interface)",
      "definition": "Text-based user interface used to interact with software or operating systems through commands, rather than graphical elements.",
      "year": 1964,
      "slug": "cli-command-line-interface"
    },
    {
      "title": "Parametric Memory",
      "definition": "Memory architecture where specific memories or facts are stored using parameterized models, often used to improve efficiency in storing and retrieving information in machine learning systems.",
      "year": 2021,
      "slug": "parametric-memory"
    },
    {
      "title": "Verifier Theory",
      "definition": "Concept in computational complexity theory that focuses on the role of a verifier in determining the correctness of a solution to a problem within a given complexity class.",
      "year": 2022,
      "slug": "verifier-theory"
    },
    {
      "title": "Attention Pattern",
      "definition": "Mechanism that selectively focuses on certain parts of the input data to improve processing efficiency and performance outcomes.",
      "year": 2017,
      "slug": "attention-pattern"
    },
    {
      "title": "Parametric Knowledge",
      "definition": "Information and patterns encoded within the parameters of a machine learning model, which are learned during the training process.",
      "year": 2021,
      "slug": "parametric-knowledge"
    },
    {
      "title": "Contrastive Learning",
      "definition": "ML technique used primarily in unsupervised learning that improves model performance by teaching the model to distinguish between similar and dissimilar data points.",
      "year": 2018,
      "slug": "contrastive-learning"
    },
    {
      "title": "Chatbot",
      "definition": "Software application designed to simulate conversation with human users, often over the Internet.",
      "year": 1966,
      "slug": "chatbot"
    },
    {
      "title": "RAG (Retrieval-Augmented Generation)",
      "definition": "Combines the retrieval of informative documents from a large corpus with the generative capabilities of neural models to enhance language model responses with real-world knowledge.",
      "year": 2020,
      "slug": "rag-retrieval-augmented-generation"
    },
    {
      "title": "Catastrophic Forgetting",
      "definition": "Phenomenon where a neural network forgets previously learned information upon learning new data.",
      "year": 1991,
      "slug": "catastrophic-forgetting"
    },
    {
      "title": "Structured Data",
      "definition": "Information that is highly organized and formatted in a way that is easily searchable and accessible by computer systems, typically stored in databases.",
      "year": 1960,
      "slug": "structured-data"
    },
    {
      "title": "Cross Validation",
      "definition": "Statistical method used to estimate the skill of ML models on unseen data by partitioning the original dataset into a training set to train the model and a test set to evaluate it.",
      "year": 1931,
      "slug": "cross-validation"
    },
    {
      "title": "Information Gap",
      "definition": "Discrepancy between the information needed to solve a problem or make a decision and the information that is actually available.",
      "year": 1989,
      "slug": "information-gap"
    },
    {
      "title": "FCN (Fully Convolutional Networks)",
      "definition": "Neural network architecture designed specifically for image segmentation tasks, where the goal is to classify each pixel of an image into a category.",
      "year": 2015,
      "slug": "fcn-fully-convolutional-networks"
    },
    {
      "title": "Human-Level AI",
      "definition": "AI systems that can perform any intellectual task with the same proficiency as a human being.",
      "year": 1956,
      "slug": "human-level-ai"
    },
    {
      "title": "Sequential Models",
      "definition": "Type of data models in AI where the arrangement of data points or events adhere to a specific order for predictive analysis and pattern recognition.",
      "year": 2014,
      "slug": "sequential-models"
    },
    {
      "title": "Explainability",
      "definition": "Ability of a system to transparently convey how it arrived at a decision, making its operations understandable to humans.",
      "year": 2016,
      "slug": "explainability"
    },
    {
      "title": "Automaton",
      "definition": "A self-operating machine or control mechanism designed to follow a predetermined sequence of operations or respond to encoded instructions.",
      "year": 1956,
      "slug": "automaton"
    },
    {
      "title": "Private Cloud Compute",
      "definition": "Dedicated cloud infrastructure to provide cloud computing services exclusively to a single organization, ensuring enhanced control, privacy, and security.",
      "year": 2008,
      "slug": "private-cloud-compute"
    },
    {
      "title": "Probabilistic Inferencing",
      "definition": "A technique in AI focused on drawing conclusions based on the probability of different outcomes, given partial or uncertain information.",
      "year": 1985,
      "slug": "probabilistic-inferencing"
    },
    {
      "title": "Open-Ended AI",
      "definition": "AI systems designed to adapt and improve continuously, capable of generating creative or novel solutions without a predefined endpoint or specific task.",
      "year": 2021,
      "slug": "open-ended-ai"
    },
    {
      "title": "Transposed Convolutional Layer",
      "definition": "Type of neural network layer that performs the opposite operation of a traditional convolutional layer, effectively upscaling input feature maps to a larger spatial resolution.",
      "year": 2010,
      "slug": "transposed-convolutional-layer"
    },
    {
      "title": "Triple",
      "definition": "Data structure in the form of a three-part entity consisting of a subject, predicate, and object, commonly used in semantic web technologies and knowledge graphs.",
      "year": 1999,
      "slug": "triple"
    },
    {
      "title": "Salience",
      "definition": "Quality by which certain aspects of a dataset or information stand out as particularly noticeable or important in a given context.",
      "year": 1988,
      "slug": "salience"
    },
    {
      "title": "RLHF (Reinforcement Learning from Human Feedback)",
      "definition": "Technique that combines reinforcement learning (RL) with human feedback to guide the learning process towards desired outcomes.",
      "year": 2016,
      "slug": "rlhf-reinforcement-learning-from-human-feedback"
    },
    {
      "title": "Policy Learning",
      "definition": "Branch of reinforcement learning where the objective is to find an optimal policy that dictates the best action to take in various states to maximize cumulative reward.",
      "year": 1992,
      "slug": "policy-learning"
    },
    {
      "title": "Early Exit Loss",
      "definition": "An optimization technique in AI models that balances overall accuracy and computational efficiency.",
      "year": 2018,
      "slug": "early-exit-loss"
    },
    {
      "title": "Interestingness",
      "definition": "Measure of how engaging or surprising information is, often used in ML and computational creativity to prioritize novel and useful data.",
      "year": 1999,
      "slug": "interestingness"
    },
    {
      "title": "Information Integration",
      "definition": "Process of combining data from different sources to provide a unified view.",
      "year": 1989,
      "slug": "information-integration"
    },
    {
      "title": "IRL (Inverse Reinforcement Learning)",
      "definition": "Technique in which an algorithm learns the underlying reward function of an environment based on observed behavior from an agent, essentially inferring the goals an agent is trying to achieve.",
      "year": 2000,
      "slug": "irl-inverse-reinforcement-learning"
    },
    {
      "title": "Matryoshka Embedding",
      "definition": "Method of representing nested structures in data using embeddings that encapsulate multiple layers of information, similar to Russian Matryoshka nesting dolls.",
      "year": 2022,
      "slug": "matryoshka-embedding"
    },
    {
      "title": "C2PA (Coalition for Content Provenance and Authenticity)",
      "definition": "Initiative focused on establishing industry standards for authenticating digital media content to combat misinformation and ensure content provenance.",
      "year": 2021,
      "slug": "c2pa-coalition-for-content-provenance-and-authenticity"
    },
    {
      "title": "Parameter",
      "definition": "Variable that is internal to the model and whose value is estimated from the training data.",
      "year": 1936,
      "slug": "parameter"
    },
    {
      "title": "Causal Transformer",
      "definition": "A neural network model that utilizes causality to improve sequence prediction tasks.",
      "year": 2020,
      "slug": "causal-transformer"
    },
    {
      "title": "Distillation Method",
      "definition": "A technique used to streamline complex AI models by transferring the knowledge of a large model into a smaller, more efficient model without significant loss in performance.",
      "year": 2015,
      "slug": "distillation-method"
    },
    {
      "title": "Symbolic AI",
      "definition": "Also known as Good Old-Fashioned AI (GOFAI), involves the manipulation of symbols to represent problems and compute solutions through rules.",
      "year": 1956,
      "slug": "symbolic-ai"
    },
    {
      "title": "Attention Masking",
      "definition": "Technique used in models based on transformers, where it manipulates the handling of sequence order and irrelevant elements in ML tasks.",
      "year": 2017,
      "slug": "attention-masking"
    },
    {
      "title": "Nationalization",
      "definition": "Government's takeover or control of AI technology and assets, typically to secure national interests, enhance regulatory oversight, or maintain sovereignty over critical technological infrastructure.",
      "year": 2023,
      "slug": "nationalization"
    },
    {
      "title": "Knowledge Graph",
      "definition": "Organizes and represents data as an interconnected network of entities (such as objects, events, concepts) and their relationships.",
      "year": 2012,
      "slug": "knowledge-graph"
    },
    {
      "title": "A-Life (Artificial Life)",
      "definition": "Studies the simulation of life processes within computers or synthetic systems to gain insights into biological phenomena.",
      "year": 1987,
      "slug": "a-life-artificial-life"
    },
    {
      "title": "Imitation Learning",
      "definition": "AI technique where models learn to perform tasks by mimicking human behavior or strategies demonstrated in training data.",
      "year": 2016,
      "slug": "imitation-learning"
    },
    {
      "title": "HPOC (Human Point of Contact)",
      "definition": "Designated person responsible for overseeing and managing interactions between an AI system and its users or other systems.",
      "year": 0,
      "slug": "hpoc-human-point-of-contact"
    },
    {
      "title": "Discontinuous Jump",
      "definition": "Sudden, significant leap in the performance or capability of an AI system, deviating sharply from its previous trajectory of incremental improvements.",
      "year": 0,
      "slug": "discontinuous-jump"
    },
    {
      "title": "Solution Space",
      "definition": "Refers to the set of all possible solutions to a given problem or decision-making scenario.",
      "year": 1956,
      "slug": "solution-space"
    },
    {
      "title": "Autonomous Agents",
      "definition": "Systems capable of independent action in dynamic, unpredictable environments to achieve designated objectives.",
      "year": 1959,
      "slug": "autonomous-agents"
    },
    {
      "title": "Numerosity",
      "definition": "Understanding of the quantitative attributes revolving around the number of elements in a data set.",
      "year": 2015,
      "slug": "numerosity"
    },
    {
      "title": "AGI (Artificial General Intelligence)",
      "definition": "AI capable of understanding, learning, and applying knowledge across a wide range of tasks, matching or surpassing human intelligence.",
      "year": 1956,
      "slug": "agi-artificial-general-intelligence"
    },
    {
      "title": "Streaming",
      "definition": "Continuous generation and delivery of text in real-time as the model processes input sequentially.",
      "year": 1995,
      "slug": "streaming"
    },
    {
      "title": "Neurosymbolic AI",
      "definition": "Integration of neural networks with symbolic AI to create systems that can both understand and manipulate symbols in a manner similar to human cognitive processes.",
      "year": 2017,
      "slug": "neurosymbolic-ai"
    },
    {
      "title": "Confidential Computing",
      "definition": "Security measure that protects data in use by performing computation in a hardware-based environment, preventing unauthorized access or visibility even if the system is compromised.",
      "year": 2015,
      "slug": "confidential-computing"
    },
    {
      "title": "In-Context Learning",
      "definition": "Method where an AI model uses the context provided in a prompt to guide its responses without additional external training.",
      "year": 2020,
      "slug": "in-context-learning"
    },
    {
      "title": "Thought Token",
      "definition": "Computational abstraction used in NLP models to represent and manipulate complex ideas or concepts within sequences of text.",
      "year": 2022,
      "slug": "thought-token"
    },
    {
      "title": "GQN (Generative Query Network)",
      "definition": "Neural network architecture designed to enable machines to understand and generate visual scenes from different viewpoints based on limited observations.",
      "year": 2018,
      "slug": "gqn-generative-query-network"
    },
    {
      "title": "Socratic Model",
      "definition": "Conversational AI that is designed to engage in dialogue in a manner akin to Socratic questioning, aiming to stimulate critical thinking and draw out ideas and underlying presuppositions.",
      "year": 2022,
      "slug": "socratic-model"
    },
    {
      "title": "MCP neuron",
      "definition": "Early computational model of a biological neuron forming the basis for artificial neural networks.",
      "year": 1958,
      "slug": "mcp-neuron"
    },
    {
      "title": "Process Reward Model",
      "definition": "A framework used to assess and guide AI systems by providing feedback mechanisms that evaluate and reinforce desired outcomes within a given process.",
      "year": 2021,
      "slug": "process-reward-model"
    },
    {
      "title": "AI Winter",
      "definition": "Periods of reduced funding and interest in AI research and development, often due to unmet expectations and lack of significant progress.",
      "year": 1984,
      "slug": "ai-winter"
    },
    {
      "title": "Markov Chain",
      "definition": "Stochastic model describing a sequence of possible events in which the probability of each event depends only on the state attained in the previous event.",
      "year": 1906,
      "slug": "markov-chain"
    },
    {
      "title": "Grounding",
      "definition": "Process of linking abstract symbols or data representations to real-world meanings or experiences, enabling the system to understand and act based on those symbols in a meaningful way.",
      "year": 1980,
      "slug": "grounding"
    },
    {
      "title": "Ensamble Algorithm",
      "definition": "Combines multiple machine learning models to improve overall performance by reducing bias, variance, or noise.",
      "year": 1992,
      "slug": "ensamble-algorithm"
    },
    {
      "title": "AutoML (Automated Machine Learning)",
      "definition": "Streamlines the process of applying ML by automating the tasks of selecting the appropriate algorithms and tuning their hyperparameters.",
      "year": 2015,
      "slug": "automl-automated-machine-learning"
    },
    {
      "title": "Teacher-Guided Rejection Sampling",
      "definition": "Advanced ML technique that refines a model by iteratively sampling and accepting data based on evaluations from multiple expert models (teachers).",
      "year": 2022,
      "slug": "teacher-guided-rejection-sampling"
    },
    {
      "title": "Volumetric AI",
      "definition": "AI techniques to process, analyze, and generate three-dimensional volumetric data, often used in fields like medical imaging, 3D reconstruction, and virtual reality.",
      "year": 2021,
      "slug": "volumetric-ai"
    },
    {
      "title": "GAN (Generative Adversarial Network)",
      "definition": "Class of AI algorithms used in unsupervised ML, implemented by a system of two neural networks contesting with each other in a game.",
      "year": 2014,
      "slug": "gan-generative-adversarial-network"
    },
    {
      "title": "Out of Distribution",
      "definition": "Data that differs significantly from the training data used to train a machine learning model, leading to unreliable or inaccurate predictions.",
      "year": 2017,
      "slug": "out-of-distribution"
    },
    {
      "title": "Autocomplete",
      "definition": "Feature in software applications that predicts and suggests possible completions for a user’s input, such as text or code, based on partial input data.",
      "year": 1960,
      "slug": "autocomplete"
    },
    {
      "title": "Stacking",
      "definition": "ML ensemble technique that combines multiple classification or regression models via a meta-classifier or meta-regressor to improve prediction accuracy.",
      "year": 1992,
      "slug": "stacking"
    },
    {
      "title": "QA (Question Answering)",
      "definition": "Field of natural language processing focused on building systems that automatically answer questions posed by humans in a natural language.",
      "year": 1960,
      "slug": "qa-question-answering"
    },
    {
      "title": "Hierarchy of Generalizations",
      "definition": "Conceptual framework in ML that organizes features or representations from specific to general, often used in neural networks to capture varying levels of abstraction in data.",
      "year": 0,
      "slug": "hierarchy-of-generalizations"
    },
    {
      "title": "Traceability",
      "definition": "Ability to track and document the origins, evolution, and interactions of data, models, and decisions throughout the AI lifecycle.",
      "year": 2016,
      "slug": "traceability"
    },
    {
      "title": "Unified Embedding",
      "definition": "A technique that integrates multiple types of data into a single, cohesive representation to improve the performance of AI models in tasks such as multimodal learning, natural language processing, or cross-domain applications.",
      "year": 2018,
      "slug": "unified-embedding"
    },
    {
      "title": "Branching Factor",
      "definition": "Number of possible actions or moves that can be taken from any given point in a decision-making process, such as in game trees or search algorithms.",
      "year": 1956,
      "slug": "branching-factor"
    },
    {
      "title": "Context Window",
      "definition": "Predefined span of text surrounding a specific word or phrase that algorithms analyze to determine its meaning, relevance, or relationship with other words.",
      "year": 2023,
      "slug": "context-window"
    },
    {
      "title": "Constitutional AI",
      "definition": "Development of foundational principles and regulations that govern the design, deployment, and operation of AI systems to ensure they adhere to ethical standards, human rights, and democratic values.",
      "year": 2023,
      "slug": "constitutional-ai"
    },
    {
      "title": "TRPO (Trust Region Policy Optimization)",
      "definition": "Advanced algorithm used in RL to ensure stable and reliable policy updates by optimizing within a trust region, thus preventing drastic policy changes.",
      "year": 2015,
      "slug": "trpo-trust-region-policy-optimization"
    },
    {
      "title": "Hierarchical Planning",
      "definition": "Approach to solving complex problems by breaking them down into more manageable sub-problems, organizing these into a hierarchy.",
      "year": 1970,
      "slug": "hierarchical-planning"
    },
    {
      "title": "Precomputed Policy",
      "definition": "A strategy computed in advance for decision-making processes in AI systems, particularly within reinforcement learning, to optimize future actions.",
      "year": 2018,
      "slug": "precomputed-policy"
    },
    {
      "title": "ASIC (Application-Specific Integrated Circuit)",
      "definition": "A microchip designed for a specific application or function, particularly used in electronics where high efficiency and low power consumption are required.",
      "year": 1970,
      "slug": "asic-application-specific-integrated-circuit"
    },
    {
      "title": "Bias-Variance Dilemma",
      "definition": "Fundamental problem in supervised ML that involves a trade-off between a model’s ability to minimize error due to bias and error due to variance.",
      "year": 1992,
      "slug": "bias-variance-dilemma"
    },
    {
      "title": "Model Collapse",
      "definition": "Phenomenon where a ML model, particularly in unsupervised or generative learning, repeatedly produces identical or highly similar outputs despite varying inputs, leading to a loss of diversity in the generated data.",
      "year": 2021,
      "slug": "model-collapse"
    },
    {
      "title": "Benchmark",
      "definition": "Standard or set of standards used to measure and compare the performance of algorithms, models, or systems.",
      "year": 1979,
      "slug": "benchmark"
    },
    {
      "title": "Token Processing",
      "definition": "The breaking down of text into tokens, such as words or subwords, which are then used as elemental units for many NLP tasks.",
      "year": 1980,
      "slug": "token-processing"
    },
    {
      "title": "Vectorization",
      "definition": "Process of converting non-numeric data into numeric format so that it can be used by ML algorithms.",
      "year": 1986,
      "slug": "vectorization"
    },
    {
      "title": "Subsymbolic AI",
      "definition": "AI approaches that do not use explicit symbolic representation of knowledge but instead rely on distributed, often neural network-based methods to process and learn from data.",
      "year": 1986,
      "slug": "subsymbolic-ai"
    },
    {
      "title": "ControlNet",
      "definition": "Neural network architecture designed to add spatial conditioning controls to diffusion models, enabling precise manipulation without altering the original model's integrity.",
      "year": 2021,
      "slug": "controlnet"
    },
    {
      "title": "Parameter Size",
      "definition": "Count of individual weights in a ML model that are learned from data during training.",
      "year": 2018,
      "slug": "parameter-size"
    },
    {
      "title": "CLIP (Contrastive Language–Image Pre-training)",
      "definition": "Machine learning model developed by OpenAI that learns visual concepts from natural language descriptions, enabling it to understand images in a manner aligned with textual descriptions.",
      "year": 2021,
      "slug": "clip-contrastive-languageimage-pre-training"
    },
    {
      "title": "Toy Program",
      "definition": "Simple, small-scale software application created primarily for educational purposes, testing, or proof of concept rather than for real-world use.",
      "year": 1956,
      "slug": "toy-program"
    },
    {
      "title": "Complex Interaction",
      "definition": "Intricate, multi-layered exchanges or behaviors between components of an AI system, or between the AI system and its environment, which may involve non-linear dynamics and feedback loops.",
      "year": 0,
      "slug": "complex-interaction"
    },
    {
      "title": "VQA (Visual Question Answering)",
      "definition": "Field of AI where systems are designed to answer questions about visual content, such as images or videos.",
      "year": 2015,
      "slug": "vqa-visual-question-answering"
    },
    {
      "title": "Instruction-Following",
      "definition": "Ability to accurately understand and execute tasks based on given directives.",
      "year": 2021,
      "slug": "instruction-following"
    },
    {
      "title": "Negative Feedback",
      "definition": "Control mechanism where the output of a system is fed back into the system in a way that counteracts fluctuations from a setpoint, thereby promoting stability.",
      "year": 1868,
      "slug": "negative-feedback"
    },
    {
      "title": "Meta Prompt",
      "definition": "AI technique that emphasizes the structural and syntactical framework of prompts to guide models in problem-solving and task execution, prioritizing the 'how' of information presentation over the 'what'.",
      "year": 2022,
      "slug": "meta-prompt"
    },
    {
      "title": "Vector Database",
      "definition": "Specialized database optimized for storing and querying vectors, which are arrays of numbers representing data in high-dimensional space.",
      "year": 2020,
      "slug": "vector-database"
    },
    {
      "title": "JEST (Multimodal Contrastive Learning with Joint Example Selection)",
      "definition": "AI technique that enhances the learning of shared representations across different modalities by jointly selecting and leveraging relevant examples.",
      "year": 2022,
      "slug": "jest-multimodal-contrastive-learning-with-joint-example-selection"
    },
    {
      "title": "A-B Testing",
      "definition": "Method used to compare two versions of a variable to determine which one performs better in achieving a specific outcome.",
      "year": 1908,
      "slug": "a-b-testing"
    },
    {
      "title": "Jagged Frontier",
      "definition": "Metaphorically describes an area of AI research characterized by rapid, uneven advances and significant uncertainties or complexities.",
      "year": 2019,
      "slug": "jagged-frontier"
    },
    {
      "title": "Overhang",
      "definition": "Disparity between the minimum computation needed for a certain performance level and the actual computation used in training a model, often leading to superior model performance.",
      "year": 2019,
      "slug": "overhang"
    },
    {
      "title": "Inductive Prior",
      "definition": "Set of assumptions or biases that a ML model uses to infer patterns from data and make predictions, effectively guiding the learning process based on prior knowledge or expected behavior.",
      "year": 0,
      "slug": "inductive-prior"
    },
    {
      "title": "HPC (High Performance Compute)",
      "definition": "A practice of aggregating computing power in a way that delivers significantly higher performance than an average desktop or workstation.",
      "year": 1960,
      "slug": "hpc-high-performance-compute"
    },
    {
      "title": "Object Detection",
      "definition": "Computer vision technique that identifies and locates objects within an image or video frame.",
      "year": 2001,
      "slug": "object-detection"
    },
    {
      "title": "Clustering",
      "definition": "Unsupervised learning method used to group a set of objects in such a way that objects in the same group (called a cluster) are more similar to each other than to those in other groups.",
      "year": 1936,
      "slug": "clustering"
    },
    {
      "title": "GLU (Gated Linear Unit)",
      "definition": "Neural network component that uses a gating mechanism to control information flow, improving model efficiency and performance.",
      "year": 2016,
      "slug": "glu-gated-linear-unit"
    },
    {
      "title": "Token",
      "definition": "Basic unit of data processed in NLP tasks, representing words, characters, or subwords.",
      "year": 1980,
      "slug": "token"
    },
    {
      "title": "Prompt Chaining",
      "definition": "Technique in AI and ML where multiple prompts or tasks are sequentially connected, allowing the output of one step to become the input for the next, effectively enabling more complex and nuanced operations.",
      "year": 2022,
      "slug": "prompt-chaining"
    },
    {
      "title": "Regime",
      "definition": "Distinct operational or behavioral mode in which an AI system functions, characterized by specific patterns or properties of data, parameters, or algorithms.",
      "year": 2018,
      "slug": "regime"
    },
    {
      "title": "Convolution",
      "definition": "Mathematical operation used in signal processing and image processing to combine two functions, resulting in a third function that represents how one function modifies the other.",
      "year": 1800,
      "slug": "convolution"
    },
    {
      "title": "Convergence",
      "definition": "The point at which an algorithm or learning process stabilizes, reaching a state where further iterations or data input do not significantly alter its outcome.",
      "year": 2014,
      "slug": "convergence"
    },
    {
      "title": "TPU (Tensor Processing Units)",
      "definition": "Specialized hardware accelerators designed to significantly speed up the calculations required for ML tasks.",
      "year": 2016,
      "slug": "tpu-tensor-processing-units"
    },
    {
      "title": "Composability",
      "definition": "Design feature in software systems that allows different components to be selected and assembled in various combinations to satisfy specific user requirements.",
      "year": 1980,
      "slug": "composability"
    },
    {
      "title": "IR (Information Retrieval)",
      "definition": "Process of obtaining relevant information from a large repository based on user queries.",
      "year": 1950,
      "slug": "ir-information-retrieval"
    },
    {
      "title": "Translational",
      "definition": "Process or approach of converting scientific research into practical applications.",
      "year": 2003,
      "slug": "translational"
    },
    {
      "title": "Adaptive Dual-Scale Denoising",
      "definition": "Denoising approach designed to balance both local and global feature extraction in models, particularly in the context of diffusion-based generative models.",
      "year": 2022,
      "slug": "adaptive-dual-scale-denoising"
    },
    {
      "title": "Transformative AI",
      "definition": "AI systems capable of bringing about profound, large-scale changes in society, potentially altering the economy, governance, and even human life itself.",
      "year": 2021,
      "slug": "transformative-ai"
    },
    {
      "title": "Similarity Masking",
      "definition": "Technique used to filter or obscure less important features in data based on their similarity to other features, enhancing the focus on distinct or more relevant aspects for tasks like ML or pattern recognition.",
      "year": 2017,
      "slug": "similarity-masking"
    },
    {
      "title": "Memory Extender",
      "definition": "Techniques or systems designed to enhance the memory capabilities of AI models, enabling them to retain and utilize more information over longer periods.",
      "year": 2022,
      "slug": "memory-extender"
    },
    {
      "title": "BoW (Bag-of-Words)",
      "definition": "Text representation technique used in NLP to simplify text content by treating it as an unordered set of words.",
      "year": 1954,
      "slug": "bow-bag-of-words"
    },
    {
      "title": "Prompt Engineering",
      "definition": "Process of carefully designing input prompts to elicit desired outputs from language models.",
      "year": 2021,
      "slug": "prompt-engineering"
    },
    {
      "title": "Classifier",
      "definition": "ML model that categorizes data into predefined classes.",
      "year": 2001,
      "slug": "classifier"
    },
    {
      "title": "xRx",
      "definition": "Flexible framework designed for building multimodal AI-powered systems that interact with users through a variety of inputs (like text, voice, and more) and outputs, while incorporating advanced reasoning capabilities.",
      "year": 2023,
      "slug": "xrx"
    },
    {
      "title": "Spillover",
      "definition": "Unintended consequences or effects that AI systems can have outside of their designed operational contexts.",
      "year": 2021,
      "slug": "spillover"
    },
    {
      "title": "Autonomous Reasoning",
      "definition": "Capacity of AI systems to make independent decisions or draw conclusions based on logic or data without human intervention.",
      "year": 2018,
      "slug": "autonomous-reasoning"
    },
    {
      "title": "Swarm Intelligence",
      "definition": "Form of AI inspired by the collective behavior of social insects and animals, used to solve complex problems through decentralized, self-organized systems.",
      "year": 1989,
      "slug": "swarm-intelligence"
    },
    {
      "title": "XenoCognition",
      "definition": "Exploration of cognition and intelligence in non-human entities, both biological and artificial, to broaden understanding of varied cognitive processes.",
      "year": 2022,
      "slug": "xenocognition"
    },
    {
      "title": "Prompt Caching",
      "definition": "Practice of storing previously used prompts and their corresponding AI-generated outputs to improve efficiency and reduce computational costs in AI systems.",
      "year": 2022,
      "slug": "prompt-caching"
    },
    {
      "title": "Proliferation Problem",
      "definition": "The issue of an overwhelming number of options or paths that an algorithm must consider, making computation impractically complex or resource-intensive.",
      "year": 2022,
      "slug": "proliferation-problem"
    },
    {
      "title": "Regression",
      "definition": "Statistical method used in ML to predict a continuous outcome variable based on one or more predictor variables.",
      "year": 1805,
      "slug": "regression"
    },
    {
      "title": "Exocortex",
      "definition": "External artificial extension of the human brain, designed to augment cognitive functions through advanced computing technologies.",
      "year": 2003,
      "slug": "exocortex"
    },
    {
      "title": "kNN (k-Nearest Neighbors)",
      "definition": "",
      "year": 1951,
      "slug": "k-nn-k-nearest-neighbors"
    },
    {
      "title": "RNN (Recurrent Neural Network)",
      "definition": "Class of neural networks where connections between nodes form a directed graph along a temporal sequence, enabling them to exhibit temporal dynamic behavior for a sequence of inputs.",
      "year": 1986,
      "slug": "rnn-recurrent-neural-network"
    },
    {
      "title": "Predictive Analytics",
      "definition": "Using statistical techniques and algorithms to analyze historical data and make predictions about future events.",
      "year": 1960,
      "slug": "predictive-analytics"
    },
    {
      "title": "Validation Data",
      "definition": "Subset of data used to assess the performance of a model during the training phase, separate from the training data itself.",
      "year": 1976,
      "slug": "validation-data"
    },
    {
      "title": "MLM (Masked-Language Modeling)",
      "definition": "Training technique where random words in a sentence are replaced with a special token, and the model learns to predict these masked words based on their context.",
      "year": 2018,
      "slug": "mlm-masked-language-modeling"
    },
    {
      "title": "Self-Correction",
      "definition": "An AI system's ability to recognize and rectify its own mistakes or errors without external intervention.",
      "year": 2021,
      "slug": "self-correction"
    },
    {
      "title": "Text to Action Model",
      "definition": "Process of interpreting and converting written or spoken language into executable actions by a system or application.",
      "year": 2022,
      "slug": "text-to-action-model"
    },
    {
      "title": "Persistency",
      "definition": "Persistent storage and retrieval of generated data and learned behaviors to maintain a model's performance and ensure its utility over time.",
      "year": 1980,
      "slug": "persistency"
    },
    {
      "title": "Speech-to-Text Model",
      "definition": "A computational model designed to convert spoken language into written text using AI and linguistic pattern recognition.",
      "year": 1980,
      "slug": "speech-to-text-model"
    },
    {
      "title": "VC Dimension (Vapnik-Chervonenkis)",
      "definition": "Measure of the capacity of a statistical classification algorithm, quantifying how complex the model is in terms of its ability to fit varied sets of data.",
      "year": 1971,
      "slug": "vc-dimension-vapnik-chervonenkis"
    },
    {
      "title": "Spatial Intelligence",
      "definition": "Ability of a system to understand, reason, and manipulate spatial relationships and properties within its environment.",
      "year": 1973,
      "slug": "spatial-intelligence"
    },
    {
      "title": "Frame Problem",
      "definition": "Challenge in AI of representing and updating the effects of actions in a dynamic world without having to explicitly state all conditions that remain unchanged.",
      "year": 1969,
      "slug": "frame-problem"
    },
    {
      "title": "NLP (Neuro-Linguistic Programming)",
      "definition": "Techniques and methodologies for understanding and generating human language by computers.",
      "year": 1970,
      "slug": "nlp-neuro-linguistic-programming"
    },
    {
      "title": "Alignment",
      "definition": "Process of ensuring that an AI system's goals and behaviors are consistent with human values and ethics.",
      "year": 2016,
      "slug": "alignment"
    },
    {
      "title": "ResNet (Residual Network)",
      "definition": "Type of CNN (Convolutional Neural Network) architecture that introduces residual learning to facilitate the training of much deeper networks by utilizing shortcut connections or skip connections that allow the gradient to bypass some layers.",
      "year": 2015,
      "slug": "resnet-residual-network"
    },
    {
      "title": "GFlowNet (Generative Flow Networks)",
      "definition": "Research direction at the intersection of reinforcement learning, deep generative models, and energy-based probabilistic modeling, aimed at improving generative active learning and unsupervised learning.",
      "year": 2021,
      "slug": "gflownet-generative-flow-networks"
    },
    {
      "title": "EDA (Exploratory Data Analysis)",
      "definition": "Technique used to analyze data sets to summarize their main characteristics, often with visual methods, before applying more formal modeling.",
      "year": 1977,
      "slug": "eda-exploratory-data-analysis"
    },
    {
      "title": "Cherry Picking",
      "definition": "Practice of selectively choosing the most favorable results from multiple outputs generated by an algorithm, often used to present the algorithm in a better light.",
      "year": 1955,
      "slug": "cherry-picking"
    },
    {
      "title": "Nowcasting",
      "definition": "Immediate forecast of economic or environmental conditions based on real-time data evolution using AI models.",
      "year": 1990,
      "slug": "nowcasting"
    },
    {
      "title": "Classification",
      "definition": "Supervised learning task in ML where the goal is to assign input data to one of several predefined categories.",
      "year": 1960,
      "slug": "classification"
    },
    {
      "title": "Embedding",
      "definition": "Representations of items, like words, sentences, or objects, in a continuous vector space, facilitating their quantitative comparison and manipulation by AI models.",
      "year": 2013,
      "slug": "embedding"
    },
    {
      "title": "Rank Fusion",
      "definition": "Technique used to combine multiple ranked lists of items, such as search engine results, into a single aggregated ranking that ideally reflects the consensus or most relevant ordering.",
      "year": 2006,
      "slug": "rank-fusion"
    },
    {
      "title": "Numerical Processing",
      "definition": "Algorithms and techniques for handling and analyzing numerical data to extract patterns, make predictions, or understand underlying trends.",
      "year": 1950,
      "slug": "numerical-processing"
    },
    {
      "title": "Raven's Progressive Matrices",
      "definition": "A non-verbal assessment tool commonly used to measure abstract reasoning, which is often regarded as a component of general intelligence.",
      "year": 1936,
      "slug": "ravens-progressive-matrices"
    },
    {
      "title": "ITM (Image-Text Matching)",
      "definition": "AI technique that involves automatically identifying correspondences between textual descriptions and visual elements within images.",
      "year": 2021,
      "slug": "itm-image-text-matching"
    },
    {
      "title": "Interpretability",
      "definition": "Extent to which a human can understand the cause of a decision made by an AI system.",
      "year": 2016,
      "slug": "interpretability"
    },
    {
      "title": "Brainoware",
      "definition": "AI systems designed to emulate the functions and processes of the human brain, focusing on cognitive and neural-inspired computing.",
      "year": 2023,
      "slug": "brainoware"
    },
    {
      "title": "Denoising",
      "definition": "Process of removing noise from data, particularly in the context of images and signals, to enhance the quality of the information.",
      "year": 2010,
      "slug": "denoising"
    },
    {
      "title": "Attention Projection Matrix",
      "definition": "Matrix used in attention mechanisms within neural networks, particularly in transformer models, to project input vectors into query, key, and value vectors.",
      "year": 2017,
      "slug": "attention-projection-matrix"
    },
    {
      "title": "Hidden Layer",
      "definition": "Layer of neurons in an artificial neural network that processes inputs from the previous layer, transforming the data before passing it on to the next layer, without direct exposure to the input or output data.",
      "year": 1986,
      "slug": "hidden-layer"
    },
    {
      "title": "Expert System",
      "definition": "Computer program designed to mimic the decision-making abilities of a human expert in a specific domain.",
      "year": 1965,
      "slug": "expert-system"
    },
    {
      "title": "Attention Block",
      "definition": "Core component in neural networks, particularly in transformers, designed to selectively focus on the most relevant parts of an input sequence when making predictions.",
      "year": 2017,
      "slug": "attention-block"
    },
    {
      "title": "Gradient Descent",
      "definition": "Optimization algorithm used to find the minimum of a function by iteratively moving towards the steepest descent direction.",
      "year": 1847,
      "slug": "gradient-descent"
    },
    {
      "title": "GAT (Graph Attention Network)",
      "definition": "Type of neural network that applies attention mechanisms directly to graphs to dynamically prioritize information from different nodes in the graph.",
      "year": 2017,
      "slug": "gat-graph-attention-network"
    },
    {
      "title": "Deterministic",
      "definition": "System or process is one that, given a particular initial state, will always produce the same output or result, with no randomness or unpredictability involved.",
      "year": 1937,
      "slug": "deterministic"
    },
    {
      "title": "Sample Efficiency",
      "definition": "Ability of a ML model to achieve high performance with a relatively small number of training samples.",
      "year": 2016,
      "slug": "sample-efficiency"
    },
    {
      "title": "Lost-in-the-Middle",
      "definition": "Issue in LLMs where they tend to struggle with retaining and processing information from the middle parts of long input sequences.",
      "year": 2023,
      "slug": "lost-in-the-middle"
    },
    {
      "title": "Non-Contrastive",
      "definition": "ML approach that focuses on learning useful representations of data without explicitly contrasting positive examples against negative examples.",
      "year": 2020,
      "slug": "non-contrastive"
    },
    {
      "title": "Siamese Network",
      "definition": "Type of neural network architecture that involves two or more identical subnetworks sharing the same parameters and weights, typically used for tasks like similarity learning and verification.",
      "year": 1994,
      "slug": "siamese-network"
    },
    {
      "title": "Artefactual Autopoiesis",
      "definition": "Design and creation of artificial systems capable of self-maintenance and reproduction, mirroring the autopoietic characteristics of living organisms.",
      "year": 2015,
      "slug": "artefactual-autopoiesis"
    },
    {
      "title": "Objective Function",
      "definition": "Objective function used in ML which quantitatively defines the goal of an optimization problem by measuring the performance of a model or solution.",
      "year": 1947,
      "slug": "objective-function"
    },
    {
      "title": "Brute Force",
      "definition": "Straightforward problem-solving approach that systematically enumerates all possible candidates to find a solution.",
      "year": 1956,
      "slug": "brute-force"
    },
    {
      "title": "Hebbian Learning",
      "definition": "Neural network learning rule based on the principle that synapses between neurons are strengthened when the neurons activate simultaneously.",
      "year": 1949,
      "slug": "hebbian-learning"
    },
    {
      "title": "Loss Landscape",
      "definition": "The topographical representation of a neural network's loss function showcasing the variations in loss values across different parameter settings.",
      "year": 2014,
      "slug": "loss-landscape"
    },
    {
      "title": "Contextual Retrieval",
      "definition": "AI-driven search technique that retrieves information based on the broader context of a query, rather than relying solely on exact keywords or phrases.",
      "year": 2019,
      "slug": "contextual-retrieval"
    },
    {
      "title": "Custom Instructions",
      "definition": "Directives or rules provided by users to AI systems, tailoring the AI's responses or behaviors to specific needs or contexts.",
      "year": 2023,
      "slug": "custom-instructions"
    },
    {
      "title": "NPC (Non-Player Character)",
      "definition": "Character in a virtual environment that operates under AI control, exhibiting behaviors or responses not directed by human players.",
      "year": 1974,
      "slug": "npc-non-player-character"
    },
    {
      "title": "Ethical AI",
      "definition": "Practice of creating AI technologies that follow clearly defined ethical guidelines and principles to benefit society while minimizing harm.",
      "year": 2016,
      "slug": "ethical-ai"
    },
    {
      "title": "Overfitting",
      "definition": "When a ML model learns the detail and noise in the training data to the extent that it negatively impacts the performance of the model on new data.",
      "year": 1976,
      "slug": "overfitting"
    },
    {
      "title": "ASR (Automatic Speech Recognition)",
      "definition": "Translates spoken language into written text, enabling computers to understand and process human speech.",
      "year": 1952,
      "slug": "asr-automatic-speech-recognition"
    },
    {
      "title": "SNARC (Stochastic Neural Analog Reinforcement Calculator)",
      "definition": "Recognized as one of the earliest electronic neural network machines, SNARC simulated a rat navigating a maze using analog components and probabilistic logic.",
      "year": 1950,
      "slug": "snarc-stochastic-neural-analog-reinforcement-calculator"
    },
    {
      "title": "Embodied Intelligence",
      "definition": "Intelligence emerging from the physical interaction of an agent with its environment, emphasizing the importance of a body in learning and cognition.",
      "year": 1991,
      "slug": "embodied-intelligence"
    },
    {
      "title": "FSL (Few-Shot Learning)",
      "definition": "ML approach that enables models to learn and make accurate predictions from a very small dataset.",
      "year": 2016,
      "slug": "fsl-few-shot-learning"
    },
    {
      "title": "Biocomputer",
      "definition": "Computational system that uses biological molecules, such as DNA and proteins, to perform data processing and storage tasks.",
      "year": 1961,
      "slug": "biocomputer"
    },
    {
      "title": "Test Time Compute",
      "definition": "Refers to the computational resources and processes required during the evaluation phase of an AI model on new, unseen data.",
      "year": 2020,
      "slug": "test-time-compute"
    },
    {
      "title": "Evolutionary Algorithm",
      "definition": "Optimization methods inspired by the process of natural selection where potential solutions evolve over generations to optimize a given objective function.",
      "year": 1960,
      "slug": "evolutionary-algorithm"
    },
    {
      "title": "Activation Beacon",
      "definition": "Method used in LLMs to extend the context window they can process by employing a technique of condensing and streamlining longer text sequences.",
      "year": 2023,
      "slug": "activation-beacon"
    },
    {
      "title": "GMM (Gaussian Mixture Models)",
      "definition": "Probabilistic models that assume all data points are generated from a mixture of a finite number of Gaussian distributions with unknown parameters.",
      "year": 1981,
      "slug": "gmm-gaussian-mixture-models"
    },
    {
      "title": "Video-to-3D model",
      "definition": "An AI technique that converts 2D video footage into three-dimensional digital models by analyzing and reconstructing the spatial geometry within the videos.",
      "year": 2010,
      "slug": "video-to-3d-model"
    },
    {
      "title": "ViTs (Vision Transformers)",
      "definition": "Class of DL models that apply the transformer architecture, originally designed for natural language processing, to computer vision tasks.",
      "year": 2020,
      "slug": "vits-vision-transformers"
    },
    {
      "title": "TTFT (Test Time Fine-Tuning)",
      "definition": "Process of adapting a pre-trained model using new data during the testing phase to improve its performance on specific tasks.",
      "year": 2020,
      "slug": "ttft-test-time-fine-tuning"
    },
    {
      "title": "Query",
      "definition": "Request made to a data management system or AI model to retrieve information or execute a command based on specific criteria.",
      "year": 2018,
      "slug": "query"
    },
    {
      "title": "LNN (Liquid Neural Network)",
      "definition": "Type of artificial neural network designed to process data that changes over time, such as time series data, by simulating a more dynamic and fluid-like behavior.",
      "year": 2018,
      "slug": "lnn-liquid-neural-network"
    },
    {
      "title": "WBE (Whole Brain Emulation)",
      "definition": "Hypothetical process of scanning a biological brain in detail and replicating its state and processes in a computational system to achieve functional and experiential equivalence.",
      "year": 2008,
      "slug": "wbe-whole-brain-emulation"
    },
    {
      "title": "TRL (Transfer Reinforcement Learning)",
      "definition": "Subfield of RL focused on leveraging knowledge gained from one or more source tasks to improve learning efficiency and performance in a different, but related, target task.",
      "year": 2019,
      "slug": "trl-transfer-reinforcement-learning"
    },
    {
      "title": "AV (Autonomous Vehicles)",
      "definition": "Self-driving cars that combine sensors, algorithms, and software to navigate and drive without human intervention.",
      "year": 1939,
      "slug": "av-autonomous-vehicles"
    },
    {
      "title": "Optimization Problem",
      "definition": "Optimization problem in AI which involves finding the best solution from all feasible solutions, given a set of constraints and an objective to achieve or optimize.",
      "year": 1951,
      "slug": "optimization-problem"
    },
    {
      "title": "Positional Encoding",
      "definition": "Technique used in neural network models, especially in transformers, to inject information about the order of tokens in the input sequence.",
      "year": 2017,
      "slug": "positional-encoding"
    },
    {
      "title": "Red Queen Effect",
      "definition": "The continuous need for systems or agents to adapt and evolve just to maintain their relative performance in a competitive or dynamic environment.",
      "year": 1973,
      "slug": "red-queen-effect"
    },
    {
      "title": "Bayesian Network",
      "definition": "Graphical model that represents probabilistic relationships among variables using directed acyclic graphs (DAGs).",
      "year": 1985,
      "slug": "bayesian-network"
    },
    {
      "title": "Predictive Processing",
      "definition": "An approach in cognitive science and AI that posits the brain as a hierarchical system constantly predicting sensory input to minimize the difference between expectation and perception.",
      "year": 2000,
      "slug": "predictive-processing"
    },
    {
      "title": "Privileged Instructions",
      "definition": "Commands in computing that can only be executed in a privileged mode, typically restricted to the operating system or other system-level software to manage hardware and critical operations securely.",
      "year": 1965,
      "slug": "privileged-instructions"
    },
    {
      "title": "Bias",
      "definition": "Systematic errors in data or algorithms that create unfair outcomes, such as privileging one arbitrary group of users over others.",
      "year": 1986,
      "slug": "bias"
    },
    {
      "title": "Validation Metric",
      "definition": "A validation metric is used to evaluate the performance of an AI model on a validation dataset, helping determine its accuracy, effectiveness, or other aspects critical to model selection and tuning.",
      "year": 0,
      "slug": "validation-metric"
    },
    {
      "title": "TTT (Test-Time Training)",
      "definition": "ML approach where the model adapts itself during the inference phase using auxiliary tasks and additional training data available at test time to improve performance.",
      "year": 2020,
      "slug": "ttt-test-time-training"
    },
    {
      "title": "Control Vector",
      "definition": "Computational mechanism used in AI models to adjust certain characteristics of the model's outputs based on specific parameters or conditions.",
      "year": 1963,
      "slug": "control-vector"
    },
    {
      "title": "Q-Learning",
      "definition": "Model-free reinforcement learning algorithm that seeks to learn the value of actions in a given state, enabling an agent to maximize cumulative reward over time.",
      "year": 1989,
      "slug": "q-learning"
    },
    {
      "title": "AmI (Ambient Intelligence)",
      "definition": "Electronic environments that are sensitive, adaptive, and responsive to the presence of people, aiming to enhance the quality of life through seamless integration of technology.",
      "year": 1998,
      "slug": "ami-ambient-intelligence"
    },
    {
      "title": "Few Shot",
      "definition": "ML technique designed to recognize patterns and make predictions based on a very limited amount of training data.",
      "year": 2016,
      "slug": "few-shot"
    },
    {
      "title": "Active Inference",
      "definition": "Theoretical framework in neuroscience and artificial intelligence that describes how agents infer and act to minimize their prediction errors about the state of the world.",
      "year": 2006,
      "slug": "active-inference"
    },
    {
      "title": "ReLU (Rectified Linear Unit)",
      "definition": "Activation function commonly used in neural networks which outputs the input directly if it is positive, otherwise, it outputs zero.",
      "year": 2000,
      "slug": "relu-rectified-linear-unit"
    },
    {
      "title": "CSPs (Constraint Satisfaction Problems)",
      "definition": "Mathematical problems defined by a set of variables, a domain of values for each variable, and a set of constraints specifying allowable combinations of values.",
      "year": 1976,
      "slug": "csps-constraint-satisfaction-problems"
    },
    {
      "title": "OOD (Out Of Distribution Behavior)",
      "definition": "When an AI model encounters data that significantly differ from its training data, often leading to unreliable or erroneous predictions.",
      "year": 2017,
      "slug": "ood-out-of-distribution-behavior"
    },
    {
      "title": "Enrichment",
      "definition": "Process of improving raw data quality with supplemental information to enable more accurate and insightful AI models.",
      "year": 2016,
      "slug": "enrichment"
    },
    {
      "title": "Functional AGI",
      "definition": "Hypothetical AI technology that possesses the capacity to understand, learn, and apply knowledge across diverse tasks which normally require human intelligence.",
      "year": 2022,
      "slug": "functional-agi"
    },
    {
      "title": "Autopoiesis",
      "definition": "Systems capable of reproducing and maintaining themselves by regulating their internal environment in response to external conditions.",
      "year": 1972,
      "slug": "autopoiesis"
    },
    {
      "title": "Greedy Decoding",
      "definition": "Technique used in ML models, especially in NLP, where the model selects the most likely next item in a sequence at each step.",
      "year": 2016,
      "slug": "greedy-decoding"
    },
    {
      "title": "LTPA (Long-Term Planning Agent)",
      "definition": "AI system designed to make decisions over extended periods, considering future consequences and outcomes.",
      "year": 2022,
      "slug": "ltpa-long-term-planning-agent"
    },
    {
      "title": "Text-to-Image Model",
      "definition": "Converts descriptive text inputs into visual images through AI-generated interpretations.",
      "year": 2014,
      "slug": "text-to-image-model"
    },
    {
      "title": "Text-to-Code Model",
      "definition": "AI models designed to translate natural language descriptions into executable code snippets, facilitating automation in software development and assisting developers.",
      "year": 2021,
      "slug": "text-to-code-model"
    },
    {
      "title": "Supervised Learning",
      "definition": "ML approach where models are trained on labeled data to predict outcomes or classify data into categories.",
      "year": 1959,
      "slug": "supervised-learning"
    },
    {
      "title": "Agentic AI Systems",
      "definition": "Advanced AI capable of making decisions and taking actions autonomously to achieve specific goals, embodying characteristics of agency and decision-making usually associated with humans or animals.",
      "year": 2022,
      "slug": "agentic-ai-systems"
    },
    {
      "title": "CNN (Convolutional Neural Network)",
      "definition": "Deep learning algorithm that can capture spatial hierarchies in data, particularly useful for image and video recognition tasks.",
      "year": 1980,
      "slug": "cnn-convolutional-neural-network"
    },
    {
      "title": "IO (Influence Operations)",
      "definition": "Strategic actions designed to affect the perceptions, attitudes, and behaviors of target audiences to achieve specific objectives.",
      "year": 2020,
      "slug": "io-influence-operations"
    },
    {
      "title": "Teacher Committee",
      "definition": "Group of expert models that collaboratively guide the training process of a student model to improve its performance.",
      "year": 2015,
      "slug": "teacher-committee"
    },
    {
      "title": "Neuromorphic Chips",
      "definition": "Specialized hardware designed to mimic the neural structures and functioning of the human brain to enhance computational efficiency and speed in processing AI algorithms.",
      "year": 1989,
      "slug": "neuromorphic-chips"
    },
    {
      "title": "HITL (Human-in-the-Loop)",
      "definition": "Integration of human judgment into AI systems to improve or guide the decision-making process.",
      "year": 2015,
      "slug": "hitl-human-in-the-loop"
    },
    {
      "title": "Byte-Level State Space",
      "definition": "Representation of the state space of a system or model at the granularity of individual bytes, capturing every possible state a byte can assume within a computational context.",
      "year": 2022,
      "slug": "byte-level-state-space"
    },
    {
      "title": "Symmetry",
      "definition": "Invariances in data or models where certain transformations do not affect the outcomes or predictions.",
      "year": 1936,
      "slug": "symmetry"
    },
    {
      "title": "Consciousness Level",
      "definition": "The measurement or assessment of an AI's ability to demonstrate awareness or understanding akin to human consciousness.",
      "year": 0,
      "slug": "consciousness-level"
    },
    {
      "title": "Linear Algebra",
      "definition": "Branch of mathematics focusing on vector spaces and linear mappings between these spaces, which is essential for many machine learning algorithms.",
      "year": 1843,
      "slug": "linear-algebra"
    },
    {
      "title": "Reversal Curse",
      "definition": "A situation in AI where improving performance on one task leads to detriments in another, typically due to underlying conflicts in the model's optimization or architecture.",
      "year": 2023,
      "slug": "reversal-curse"
    },
    {
      "title": "Semantic Segmentation",
      "definition": "Process of partitioning a digital image into multiple segments (sets of pixels) to simplify its representation into something more meaningful and easier to analyze, where each segment corresponds to different objects or parts of objects.",
      "year": 2011,
      "slug": "semantic-segmentation"
    },
    {
      "title": "Latent Diffusion Backbone",
      "definition": "A framework in AI utilizing latent variable models with diffusion processes to generate high-dimensional data from low-dimensional latent representations.",
      "year": 2021,
      "slug": "latent-diffusion-backbone"
    },
    {
      "title": "Continual Pre-Training",
      "definition": "Process of incrementally training a pre-trained ML model on new data or tasks to update its knowledge without forgetting previously learned information.",
      "year": 2019,
      "slug": "continual-pre-training"
    },
    {
      "title": "Semi-Supervised Learning",
      "definition": "ML approach that uses a combination of a small amount of labeled data and a large amount of unlabeled data for training models.",
      "year": 2006,
      "slug": "semi-supervised-learning"
    },
    {
      "title": "Stride Length",
      "definition": "Refers to the number of pixels by which the filter or kernel moves across the input data during convolution operations in convolutional neural networks (CNNs).",
      "year": 0,
      "slug": "stride-length"
    },
    {
      "title": "GOFAI (Good Old-Fashioned AI)",
      "definition": "Traditional approach to AI that relies on symbolic reasoning, logic, and rule-based systems to simulate intelligent behavior.",
      "year": 1965,
      "slug": "gofai-good-old-fashioned-ai"
    },
    {
      "title": "Uncensored AI",
      "definition": "AI systems that operate without restrictions on the content they generate or the decisions they make.",
      "year": 2022,
      "slug": "uncensored-ai"
    },
    {
      "title": "Algorithm",
      "definition": "Step-by-step procedure or formula for solving a problem or performing a task.",
      "year": 1956,
      "slug": "algorithm"
    },
    {
      "title": "Lossy Compression",
      "definition": "A data encoding method that reduces file size by eliminating some information deemed less important, resulting in a loss of data quality.",
      "year": 1972,
      "slug": "lossy-compression"
    },
    {
      "title": "KL (Kullback–Leibler) Divergence",
      "definition": "Measure of how one probability distribution diverges from a second, reference probability distribution.",
      "year": 1951,
      "slug": "kl-kullbackleibler-divergence"
    },
    {
      "title": "Action Variable",
      "definition": "Represents a control mechanism within an environment used by AI systems to influence outcomes or states.",
      "year": 1970,
      "slug": "action-variable"
    },
    {
      "title": "Layer Normalization",
      "definition": "Technique used in neural networks to normalize the inputs across the features within a layer, improving training stability and model performance, particularly in recurrent and transformer models.",
      "year": 2016,
      "slug": "layer-normalization"
    },
    {
      "title": "EM (Expectation-Maximization)",
      "definition": "Statistical technique used to find the maximum likelihood estimates of parameters in probabilistic models, specifically when the model depends on unobserved latent variables.",
      "year": 1977,
      "slug": "em-expectation-maximization"
    },
    {
      "title": "Differential Privacy",
      "definition": "System for publicly sharing information about a dataset by describing the patterns of groups within the dataset while withholding information about individuals in the dataset.",
      "year": 2006,
      "slug": "differential-privacy"
    },
    {
      "title": "PPO (Proximal Policy Optimization)",
      "definition": "RL algorithm that aims to balance ease of implementation, sample efficiency, and reliable performance by using a simpler but effective update method for policy optimization.",
      "year": 2017,
      "slug": "ppo-proximal-policy-optimization"
    },
    {
      "title": "NMF (Non-Negative Matrix Factorization)",
      "definition": "Technique in multivariate analysis that factors high-dimensional vectors into a lower-dimensional representation, while preserving the non-negative elements in the data sets.",
      "year": 1999,
      "slug": "nmf-non-negative-matrix-factorization"
    },
    {
      "title": "Personal Software",
      "definition": "Software that learns and adapts to individual behaviors in order to infer preferences and aid in task execution.",
      "year": 1984,
      "slug": "personal-software"
    },
    {
      "title": "LMN (Large Nature Model)",
      "definition": "Open-source model focused on nature, using a vast, ethically sourced dataset of natural world elements.",
      "year": 2023,
      "slug": "lmn-large-nature-model"
    },
    {
      "title": "Speech-to-Speech Model",
      "definition": "Systems that directly convert spoken language into another language through AI, enabling real-time translation and cross-lingual communication.",
      "year": 1990,
      "slug": "speech-to-speech-model"
    },
    {
      "title": "Attention Mechanisms",
      "definition": "Dynamically prioritize certain parts of input data over others, enabling models to focus on relevant information when processing complex data sequences.",
      "year": 2014,
      "slug": "attention-mechanisms"
    },
    {
      "title": "LAM (Large Action Model)",
      "definition": "Advanced AI systems designed to interpret and execute complex tasks by directly modeling human actions within digital applications.",
      "year": 2023,
      "slug": "lam-large-action-model"
    },
    {
      "title": "Flow Engineering",
      "definition": "Structured process of improving problem-solving in tasks like code generation by guiding a model through systematic, iterative refinements based on feedback loops.",
      "year": 2021,
      "slug": "flow-engineering"
    },
    {
      "title": "RLAIF (Reinforcement Learning with AI Feedback)",
      "definition": "A method that combines reinforcement learning techniques with feedback derived from AI models to enhance decision-making or control tasks efficiently.",
      "year": 2023,
      "slug": "rlaif-reinforcement-learning-with-ai-feedback"
    },
    {
      "title": "Boltzmann Machine",
      "definition": "Stochastic recurrent neural network used to learn and represent complex probability distributions over binary variables.",
      "year": 1985,
      "slug": "boltzmann-machine"
    },
    {
      "title": "AI Governance",
      "definition": "Set of policies, principles, and practices that guide the ethical development, deployment, and regulation of artificial intelligence technologies.",
      "year": 2016,
      "slug": "ai-governance"
    },
    {
      "title": "Encoder-Decoder Transformer",
      "definition": "A structure used in NLP for understanding and generating language by encoding input and decoding the output.",
      "year": 2017,
      "slug": "encoder-decoder-transformer"
    },
    {
      "title": "Turing Completeness",
      "definition": "Systems that can simulate a Turing machine's computational abilities.",
      "year": 1936,
      "slug": "turing-completeness"
    },
    {
      "title": "System 1 & System 2",
      "definition": "'Two modes of thinking in human cognition: System 1 is fast, automatic, and intuitive, while System 2 is slow, deliberate, and analytical.'",
      "year": 2002,
      "slug": "system-1-system-2"
    },
    {
      "title": "Data Wall",
      "definition": "Limitation faced when the available data becomes insufficient for further training or improving machine learning models.",
      "year": 2022,
      "slug": "data-wall"
    },
    {
      "title": "Hypersphere-Based Transformer",
      "definition": "An improved framework for transformers focused on enhancing efficiency and performance by leveraging hyperspheres.",
      "year": 2021,
      "slug": "hypersphere-based-transformer"
    },
    {
      "title": "Gödel Code",
      "definition": "Method of encoding mathematical and logical statements as unique natural numbers, introduced by Kurt Gödel as part of his proof of the incompleteness theorems.",
      "year": 1931,
      "slug": "godel-code"
    },
    {
      "title": "Lump of Task Fallacy",
      "definition": "Misconception that a task or series of tasks performed by human intelligence can be replicated entirely by artificial intelligence.",
      "year": 2021,
      "slug": "lump-of-task-fallacy"
    },
    {
      "title": "Model Garden",
      "definition": "Centralized repository that houses a collection of pre-trained machine learning models designed to be easily accessible and reusable by developers and researchers.",
      "year": 2021,
      "slug": "model-garden"
    },
    {
      "title": "Universal Learning Algorithms",
      "definition": "Theoretical frameworks aimed at creating systems capable of learning any task to human-level competency, leveraging principles that could allow for generalization across diverse domains.",
      "year": 1980,
      "slug": "universal-learning-algorithms"
    },
    {
      "title": "Simulation",
      "definition": "Process of creating a digital model of a real-world or theoretical situation to study the behavior and dynamics of systems.",
      "year": 1960,
      "slug": "simulation"
    },
    {
      "title": "Three Laws of Robotics",
      "definition": "Set of ethical guidelines designed to govern the behavior of robots and ensure their safe interaction with humans, proposed by science fiction writer Isaac Asimov.",
      "year": 1942,
      "slug": "three-laws-of-robotics"
    },
    {
      "title": "Value Matrix",
      "definition": "Structured format for organizing and displaying data, often used in machine learning to represent input data and their corresponding outputs or labels.",
      "year": 2016,
      "slug": "value-matrix"
    },
    {
      "title": "DLMs (Deep Language Models)",
      "definition": "Advanced ML models designed to understand, generate, and translate human language by leveraging DL techniques.",
      "year": 2018,
      "slug": "dlms-deep-language-models"
    },
    {
      "title": "Find+Replace Transformers",
      "definition": "Novel architectural extension of traditional transformers, designed to achieve Turing completeness and enhance model performance on complex tasks.",
      "year": 2021,
      "slug": "findreplace-transformers"
    },
    {
      "title": "Hyperscalers",
      "definition": "Large tech organizations that design and manage infrastructure to support the massive scale of big data, AI and cloud computing.",
      "year": 2011,
      "slug": "hyperscalers"
    },
    {
      "title": "Ensemble Learning",
      "definition": "ML paradigm where multiple models (often called weak learners) are trained to solve the same problem and combined to improve the accuracy of predictions.",
      "year": 1996,
      "slug": "ensemble-learning"
    },
    {
      "title": "Recursive Self-Improvement",
      "definition": "Process by which an AI system iteratively improves itself, enhancing its intelligence and capabilities without human intervention.",
      "year": 1965,
      "slug": "recursive-self-improvement"
    },
    {
      "title": "Neurode",
      "definition": "A conceptual element used as a simplified model for neurons in AI and neural networks, facilitating the construction of algorithms that mimic neurological behavior.",
      "year": 1958,
      "slug": "neurode"
    },
    {
      "title": "Perceptron",
      "definition": "Model in neural networks designed to perform binary classification tasks by mimicking the decision-making process of a single neuron.",
      "year": 1958,
      "slug": "perceptron"
    },
    {
      "title": "Forward Propagation",
      "definition": "Process in a neural network where input data is passed through layers of the network to generate output.",
      "year": 1986,
      "slug": "forward-propagation"
    },
    {
      "title": "Autoregressive",
      "definition": "Statistical algorithms used in time series forecasting, where future values are predicted based on a weighted sum of past observations.",
      "year": 1970,
      "slug": "autoregressive"
    },
    {
      "title": "Surprisal",
      "definition": "Measures the amount of unexpectedness or information content associated with a specific outcome in a probabilistic event.",
      "year": 1948,
      "slug": "surprisal"
    },
    {
      "title": "Spacetime Patches",
      "definition": "Technique for transforming video data into a format suitable for ML models by breaking down video into temporal and spatial segments.",
      "year": 2022,
      "slug": "spacetime-patches"
    },
    {
      "title": "Encoder-Decoder Models",
      "definition": "Class of deep learning architectures that process an input to generate a corresponding output.",
      "year": 2014,
      "slug": "encoder-decoder-models"
    },
    {
      "title": "Fast Weights",
      "definition": "Fast weights are temporary, rapidly changing parameters in neural networks designed to capture transient patterns or short-term dependencies in data.",
      "year": 2016,
      "slug": "fast-weights"
    },
    {
      "title": "Internal Representation",
      "definition": "The way information is structured and stored within an AI system, enabling the system to process, reason, or make decisions.",
      "year": 1960,
      "slug": "internal-representation"
    },
    {
      "title": "Chunking",
      "definition": "A concept in cognitive psychology and AI, where information is broken down and grouped into chunks to simplify complex data and optimize memory usage.",
      "year": 1956,
      "slug": "chunking"
    },
    {
      "title": "Grokking",
      "definition": "Refers to the process of deeply understanding something intuitively and completely, often used in AI to describe achieving a profound comprehension of complex concepts or systems.",
      "year": 1961,
      "slug": "grokking"
    },
    {
      "title": "Probabilistic Programming",
      "definition": "Programming paradigm designed to handle uncertainty and probabilistic models, allowing for the creation of programs that can make inferences about data by incorporating statistical methods directly into the code.",
      "year": 1974,
      "slug": "probabilistic-programming"
    },
    {
      "title": "SAM (Segment Anything Model)",
      "definition": "AI model designed for high-precision image segmentation, capable of identifying and delineating every object within an image.",
      "year": 2023,
      "slug": "sam-segment-anything-model"
    },
    {
      "title": "Point-wise Feedforward Network",
      "definition": "Neural network layer that applies a series of linear and non-linear transformations to each position (or \"point\") in the input sequence independently.",
      "year": 2017,
      "slug": "point-wise-feedforward-network"
    },
    {
      "title": "Negative References",
      "definition": "Mechanisms that prevent or mitigate undesirable, biased, or harmful outputs from AI models during text generation, aligned with ethical AI practices.",
      "year": 2021,
      "slug": "negative-references"
    },
    {
      "title": "Skill Differential",
      "definition": "Variation in performance levels between individuals or groups due to differences in skills, experience, or knowledge, particularly within the same task or profession.",
      "year": 2022,
      "slug": "skill-differential"
    },
    {
      "title": "Deep SSMs (Deep State-Space Models)",
      "definition": "Advanced methodologies combining deep learning with state-space models to model complex dynamic systems characterized by sequences of observations.",
      "year": 2018,
      "slug": "deep-ssms-deep-state-space-models"
    },
    {
      "title": "Machine Understanding",
      "definition": "Capability of AI systems to interpret and comprehend data, text, images, or situations in a manner akin to human understanding.",
      "year": 1960,
      "slug": "machine-understanding"
    },
    {
      "title": "Mechanistic Interpretability",
      "definition": "Study and methods used to understand the specific causal mechanisms through which AI models produce their outputs.",
      "year": 2021,
      "slug": "mechanistic-interpretability"
    },
    {
      "title": "Moat",
      "definition": "A concept of competitive advantage that AI companies gain by developing proprietary data, algorithms, and models.",
      "year": 2018,
      "slug": "moat"
    },
    {
      "title": "NLU (Natural Language Understanding)",
      "definition": "Subfield of NLP focused on enabling machines to understand and interpret human language in a way that is both meaningful and contextually relevant.",
      "year": 1970,
      "slug": "nlu-natural-language-understanding"
    },
    {
      "title": "Attention Network",
      "definition": "Type of neural network that dynamically focuses on specific parts of the input data, enhancing the performance of tasks like language translation, image recognition, and more.",
      "year": 2015,
      "slug": "attention-network"
    },
    {
      "title": "Comparative Advantage",
      "definition": "Strategic advantage that a particular AI model, system, or approach has over others in performing specific tasks more efficiently or effectively due to unique strengths or capabilities.",
      "year": 1817,
      "slug": "comparative-advantage"
    },
    {
      "title": "Mixture Map",
      "definition": "Graphical representation used in data science and ML to visualize the relationships and interactions between different components or features of a dataset.",
      "year": 2020,
      "slug": "mixture-map"
    },
    {
      "title": "Ngram",
      "definition": "Contiguous sequence of N items from a given sample of text or speech.",
      "year": 1980,
      "slug": "ngram"
    },
    {
      "title": "Instrumentation",
      "definition": "Techniques and tools used to monitor, measure, and analyze the performance and behavior of AI systems.",
      "year": 1956,
      "slug": "instrumentation"
    },
    {
      "title": "PDS (Psychological Depth Scale)",
      "definition": "Tool used to measure the complexity and depth of an individual's psychological experiences and inner life.",
      "year": 2021,
      "slug": "pds-psychological-depth-scale"
    },
    {
      "title": "DQN (Deep Q-Networks)",
      "definition": "RL technique that combines Q-learning with deep neural networks to enable agents to learn how to make optimal decisions from high-dimensional sensory inputs.",
      "year": 2015,
      "slug": "dqn-deep-q-networks"
    },
    {
      "title": "WHAM (World and Human Action Model)",
      "definition": "Multimodal, highly interactive 3D environment for developing and testing AI models.",
      "year": 2021,
      "slug": "wham-world-and-human-action-model"
    },
    {
      "title": "NAS (Neural Architecture Search)",
      "definition": "Automated process that designs optimal neural network architectures for specific tasks.",
      "year": 2017,
      "slug": "nas-neural-architecture-search"
    },
    {
      "title": "QML (Quantum Machine Learning)",
      "definition": "Integration of quantum algorithms within ML models to improve computational speed and data handling abilities.",
      "year": 2014,
      "slug": "qml-quantum-machine-learning"
    },
    {
      "title": "1-N Systems",
      "definition": "Architectures where one input or controller manages multiple outputs or agents, applicable in fields like neural networks and robotics.",
      "year": 2020,
      "slug": "1-n-systems"
    },
    {
      "title": "Capability Control",
      "definition": "Strategies and mechanisms implemented to ensure that AI systems act within desired limits, preventing them from performing actions that are undesired or harmful to humans.",
      "year": 2016,
      "slug": "capability-control"
    },
    {
      "title": "Variational Free Energy",
      "definition": "A mathematical framework used to approximate complex probability distributions, commonly employed in AI to optimize models and infer latent variables.",
      "year": 1998,
      "slug": "variational-free-energy"
    },
    {
      "title": "Weight Initialization",
      "definition": "An essential process in neural network training that involves setting the initial values of the model's weights to influence learning effectiveness and convergence.",
      "year": 1986,
      "slug": "weight-initialization"
    },
    {
      "title": "Sparse Crosscoders",
      "definition": "A technique in AI aimed at improving the efficiency of model training and inference by using sparse connections between layers rather than dense connections.",
      "year": 2021,
      "slug": "sparse-crosscoders"
    },
    {
      "title": "Semantic Entropy",
      "definition": "Measure of uncertainty or unpredictability in the meaning of a message or data, often considering the context in which the information is used.",
      "year": 2021,
      "slug": "semantic-entropy"
    },
    {
      "title": "De-Biasing",
      "definition": "Methods and practices used to reduce or eliminate biases in AI systems, aiming to make the systems more fair, equitable, and representative of diverse populations.",
      "year": 2018,
      "slug": "de-biasing"
    },
    {
      "title": "Underfitting",
      "definition": "Occurs when a ML model is too simple to capture the underlying pattern of the data it is trained on, resulting in poor performance on both training and testing datasets.",
      "year": 1976,
      "slug": "underfitting"
    },
    {
      "title": "Fine Tuning",
      "definition": "Method used in ML to adjust the parameters of an already trained model to improve its accuracy on a specific, often smaller, dataset.",
      "year": 2020,
      "slug": "fine-tuning"
    },
    {
      "title": "Matrix Multiplication",
      "definition": "An algebraic operation that takes two matrices and produces a new matrix, fundamental in various AI and ML algorithms.",
      "year": 1858,
      "slug": "matrix-multiplication"
    },
    {
      "title": "VLM (Visual Language Model)",
      "definition": "AI models designed to interpret and generate content by integrating visual and textual information, enabling them to perform tasks like image captioning, visual question answering, and more.",
      "year": 2021,
      "slug": "vlm-visual-language-model"
    },
    {
      "title": "Diffusion",
      "definition": "Class of generative models used to create high-quality, diverse samples of data by iteratively adding and then reversing noise.",
      "year": 2020,
      "slug": "diffusion"
    },
    {
      "title": "NHI (Non-Human Intelligence)",
      "definition": "Intelligence systems that operate independently of human intelligence, encompassing a broad range of entities and origins, emphasizing capabilities that may surpass human cognitive processes.",
      "year": 2020,
      "slug": "nhi-non-human-intelligence"
    },
    {
      "title": "PFGM (Poisson Flow Generative Model)",
      "definition": "Generative model that utilizes Poisson processes in its architecture to model and generate complex data distributions.",
      "year": 2021,
      "slug": "pfgm-poisson-flow-generative-model"
    },
    {
      "title": "Targeted Adversarial Examples",
      "definition": "Inputs intentionally designed to cause a machine learning model to misclassify them into a specific, incorrect category.",
      "year": 2014,
      "slug": "targeted-adversarial-examples"
    },
    {
      "title": "Prompt Injection",
      "definition": "Technique used to manipulate or influence the behavior of AI models by inserting specific commands or cues into the input prompt.",
      "year": 2022,
      "slug": "prompt-injection"
    },
    {
      "title": "Scale Separation",
      "definition": "Distinguishing between phenomena or variables that operate on distinctly different magnitudes, time scales, or spatial dimensions.",
      "year": 2020,
      "slug": "scale-separation"
    },
    {
      "title": "Chunking Strategy",
      "definition": "Method of grouping similar pieces of information together to simplify processing and enhance memory performance.",
      "year": 1956,
      "slug": "chunking-strategy"
    },
    {
      "title": "Indirect Manipulation",
      "definition": "An interaction technique where users influence system tasks and behaviors through intermediary or abstract operations, deviating from direct interaction.",
      "year": 1982,
      "slug": "indirect-manipulation"
    },
    {
      "title": "Steerability",
      "definition": "Ability to intentionally manipulate the output of the network in a specific direction by applying predetermined modifications to its inputs or parameters.",
      "year": 2022,
      "slug": "steerability"
    },
    {
      "title": "Top-K",
      "definition": "Method in ML and information retrieval where the system selects the k most relevant or highest-scoring items from a larger set of predictions or results.",
      "year": 2018,
      "slug": "top-k"
    },
    {
      "title": "Eval (Evaluation)",
      "definition": "Process of assessing the performance and effectiveness of an AI model or algorithm based on specified criteria and datasets.",
      "year": 1956,
      "slug": "eval-evaluation"
    },
    {
      "title": "Attention",
      "definition": "Refers to mechanisms that allow models to dynamically focus on specific parts of input data, enhancing the relevance and context-awareness of the processing.",
      "year": 2014,
      "slug": "attention"
    },
    {
      "title": "Attention Seeking",
      "definition": "A behavior exhibited by neural networks, where they dynamically focus computational resources on important parts of the input, enhancing learning and performance.",
      "year": 2014,
      "slug": "attention-seeking"
    },
    {
      "title": "Structured Generation",
      "definition": "Process where outputs are produced in a structured format, often requiring adherence to specific formats or templates, such as tables, graphs, or well-organized textual reports.",
      "year": 2021,
      "slug": "structured-generation"
    },
    {
      "title": "Connectionist AI",
      "definition": "Set of computational models in AI that simulate the human brain's network of neurons to process information and learn from data.",
      "year": 1943,
      "slug": "connectionist-ai"
    },
    {
      "title": "Singularity",
      "definition": "Hypothetical future point at which technological growth becomes uncontrollable and irreversible, resulting in unforeseeable changes to human civilization.",
      "year": 1958,
      "slug": "singularity"
    },
    {
      "title": "Implicit Reasoning",
      "definition": "Ability of a system to make inferences and draw conclusions that are not explicitly programmed or directly stated in the input data.",
      "year": 2019,
      "slug": "implicit-reasoning"
    },
    {
      "title": "Dijkstra's Algorithm",
      "definition": "An algorithm designed to find the shortest path between nodes in a graph, which is widely used in AI for optimizing traversals across networks and structures.",
      "year": 1959,
      "slug": "dijkstras-algorithm"
    },
    {
      "title": "Convergent Learning",
      "definition": "Process by which a ML model consistently arrives at the same solution or prediction given the same input data, despite variations in initial conditions or configurations.",
      "year": 2018,
      "slug": "convergent-learning"
    },
    {
      "title": "Statistical Computing",
      "definition": "Utilization of computational algorithms and statistical techniques to model, analyze, and interpret complex data effectively.",
      "year": 1970,
      "slug": "statistical-computing"
    },
    {
      "title": "Speculative Decoding",
      "definition": "AI technique that generates multiple potential outputs simultaneously to improve efficiency and accuracy in tasks like language modeling and neural network inference.",
      "year": 2023,
      "slug": "speculative-decoding"
    },
    {
      "title": "Moravec's Paradox",
      "definition": "Moravec's Paradox observes that tasks requiring high-level reasoning are easier for computers, while tasks humans find simple, like perception and mobility, are difficult for AI.",
      "year": 1980,
      "slug": "moravec-s-paradox"
    },
    {
      "title": "Saturation Effect",
      "definition": "Phenomenon where the performance improvements of a model diminish as the complexity of the model or the amount of training data increases beyond a certain point.",
      "year": 1986,
      "slug": "saturation-effect"
    },
    {
      "title": "Causal Inference",
      "definition": "Process of determining the cause-and-effect relationship between variables.",
      "year": 1921,
      "slug": "causal-inference"
    },
    {
      "title": "Frontier Models",
      "definition": "The most advanced and powerful AI models currently available, pushing the boundaries of AI capabilities towards achieving general intelligence.",
      "year": 2021,
      "slug": "frontier-models"
    },
    {
      "title": "OOMs (Orders of Magnitude)",
      "definition": "Way to understand and compare quantities in terms of their scale or size, typically using powers of ten.",
      "year": 2019,
      "slug": "ooms-orders-of-magnitude"
    },
    {
      "title": "Word Vector",
      "definition": "Numerical representations of words that capture their meanings, relationships, and context within a language.",
      "year": 2003,
      "slug": "word-vector"
    },
    {
      "title": "BNNs (Biological Neural Networks)",
      "definition": "Complex networks of neurons found in biological organisms, responsible for processing and transmitting information through electrical and chemical signals.",
      "year": 1943,
      "slug": "bnns-biological-neural-networks"
    },
    {
      "title": "Post-Training",
      "definition": "Techniques and adjustments applied to neural networks after their initial training phase to enhance performance, efficiency, or adaptability to new data or tasks.",
      "year": 2019,
      "slug": "post-training"
    },
    {
      "title": "Control Logic",
      "definition": "Decision-making processes within a system that manage and dictate how various components respond to inputs, aiming to achieve desired outcomes or maintain specific conditions.",
      "year": 1963,
      "slug": "control-logic"
    },
    {
      "title": "Rejection Sampling",
      "definition": "Method used to generate samples from a probability distribution by proposing candidates from a simpler distribution and accepting or rejecting them based on a criterion related to the target distribution.",
      "year": 1953,
      "slug": "rejection-sampling"
    },
    {
      "title": "Gabor Function",
      "definition": "Mathematical tool used in image processing and signal analysis, known for its ability to localize information in both the spatial and frequency domains simultaneously.",
      "year": 1946,
      "slug": "gabor-function"
    },
    {
      "title": "Instruction Tuning",
      "definition": "Process used in ML to optimize a language model’s responses for specific tasks by fine-tuning it on a curated set of instructions and examples.",
      "year": 2021,
      "slug": "instruction-tuning"
    },
    {
      "title": "Artificial Curiosity",
      "definition": "Algorithmic mechanism in AI that motivates the system's behavior to learn inquisitively and explore unfamiliar environments.",
      "year": 1990,
      "slug": "artificial-curiosity"
    },
    {
      "title": "Graph Theory",
      "definition": "Field of mathematics and computer science focusing on the properties of graphs, which are structures made up of vertices (or nodes) connected by edges.",
      "year": 1736,
      "slug": "graph-theory"
    },
    {
      "title": "State Space Model",
      "definition": "Mathematical frameworks used to represent systems that are governed by a set of latent (hidden) variables evolving over time, observed through another set of variables.",
      "year": 1960,
      "slug": "state-space-model"
    },
    {
      "title": "Foundation Model",
      "definition": "Type of large-scale pre-trained model that can be adapted to a wide range of tasks without needing to be trained from scratch each time.",
      "year": 2021,
      "slug": "foundation-model"
    },
    {
      "title": "Model Drift",
      "definition": "Change in the underlying data patterns that a ML model was trained on, leading to a decrease in the model's accuracy and effectiveness over time.",
      "year": 2016,
      "slug": "model-drift"
    },
    {
      "title": "Reversal Course",
      "definition": "A practiced approach in AI training where learning direction is strategically changed to optimize model performance and mitigate issues like vanishing gradients.",
      "year": 2022,
      "slug": "reversal-course"
    },
    {
      "title": "End-to-End Learning",
      "definition": "ML approach where a system is trained to directly map input data to the desired output, minimizing the need for manual feature engineering.",
      "year": 2014,
      "slug": "end-to-end-learning"
    },
    {
      "title": "Structured Search",
      "definition": "Method of querying and retrieving information from databases and other structured data sources where data is organized in defined types and relationships.",
      "year": 2016,
      "slug": "structured-search"
    },
    {
      "title": "Continuous Learning",
      "definition": "Systems and models that learn incrementally from a stream of data, updating their knowledge without forgetting previous information.",
      "year": 1995,
      "slug": "continuous-learning"
    },
    {
      "title": "Gating Mechanism",
      "definition": "Control function that regulates the flow of information through the model, deciding what information to keep, discard, or update.",
      "year": 1997,
      "slug": "gating-mechanism"
    },
    {
      "title": "Algorithmic Bias",
      "definition": "Systematic and unfair discrimination embedded in the outcomes of algorithms, often reflecting prejudices present in the training data or design process.",
      "year": 2016,
      "slug": "algorithmic-bias"
    },
    {
      "title": "Abductive Reasoning",
      "definition": "Form of logical inference that starts with an observation and seeks the simplest and most likely explanation for it.",
      "year": 1878,
      "slug": "abductive-reasoning"
    },
    {
      "title": "P(Doom)",
      "definition": "Probability of an existential catastrophe, often discussed within the context of AI safety and risk assessment.",
      "year": 2022,
      "slug": "pdoom"
    },
    {
      "title": "Observability",
      "definition": "Capability to monitor and understand the internal states of an AI system through its outputs.",
      "year": 1961,
      "slug": "observability"
    },
    {
      "title": "Tunable Parameters",
      "definition": "Variables in an AI model that are adjusted during training to optimize the model's performance on a given task.",
      "year": 1986,
      "slug": "tunable-parameters"
    },
    {
      "title": "Capability Ladder",
      "definition": "Conceptual framework used to describe the progression of an AI system's abilities from simple, specific tasks to complex, general tasks.",
      "year": 2021,
      "slug": "capability-ladder"
    },
    {
      "title": "Perceptual Domain",
      "definition": "Range of sensory inputs and interpretations that an AI system can process, akin to human perception systems such as vision, hearing, and touch.",
      "year": 2016,
      "slug": "perceptual-domain"
    },
    {
      "title": "Exploit Generator",
      "definition": "Automated software used in AI systems to find and exploit vulnerabilities in other software.",
      "year": 2019,
      "slug": "exploit-generator"
    },
    {
      "title": "Model-Based Classifier",
      "definition": "ML algorithm that uses a pre-defined statistical model to make predictions based on input data.",
      "year": 2015,
      "slug": "model-based-classifier"
    },
    {
      "title": "Learnability",
      "definition": "Capacity of an algorithm or model to effectively learn from data, often measured by how well it can generalize from training data to unseen data.",
      "year": 1980,
      "slug": "learnability"
    },
    {
      "title": "Image Recognition",
      "definition": "Ability of AI to identify objects, places, people, writing, and actions in images.",
      "year": 1960,
      "slug": "image-recognition"
    },
    {
      "title": "Universality",
      "definition": "Concept that certain computational systems can simulate any other computational system, given the correct inputs and enough time and resources.",
      "year": 1936,
      "slug": "universality"
    },
    {
      "title": "Covariance",
      "definition": "How much two random variables change together",
      "year": 1893,
      "slug": "covariance"
    },
    {
      "title": "Situational Models",
      "definition": "Cognitive frameworks that allow AI systems to understand and predict dynamic environments by continuously integrating contextual information.",
      "year": 1990,
      "slug": "situational-models"
    },
    {
      "title": "Reasoning Path",
      "definition": "Logical steps or sequence of inferences made by an AI model or system to arrive at a conclusion, decision, or solution.",
      "year": 2021,
      "slug": "reasoning-path"
    },
    {
      "title": "Overparameterized",
      "definition": "ML model that has more parameters than the number of data points available for training.",
      "year": 2014,
      "slug": "overparameterized"
    },
    {
      "title": "RL (Reinforcement Learning)",
      "definition": "Type of ML where an agent learns to make decisions by performing actions in an environment to achieve a goal, guided by rewards.",
      "year": 1952,
      "slug": "rl-reinforcement-learning"
    },
    {
      "title": "Edge Model",
      "definition": "A type of AI model designed to process data directly on the device it was collected from, limiting the need for data transfer.",
      "year": 2018,
      "slug": "edge-model"
    },
    {
      "title": "Unsupervised Learning",
      "definition": "Type of ML where algorithms learn patterns from untagged data, without any guidance on what outcomes to predict.",
      "year": 1958,
      "slug": "unsupervised-learning"
    },
    {
      "title": "Perceptual Hash Algorithm",
      "definition": "Generates a unique hash that reflects the visual or auditory similarity of data, such as an image, rather than its exact content.",
      "year": 2010,
      "slug": "perceptual-hash-algorithm"
    },
    {
      "title": "BCI (Brain Computer Interface)",
      "definition": "Enables direct communication pathways between the brain and external devices, allowing for control of computers or prosthetics with neural activity.",
      "year": 1973,
      "slug": "bci-brain-computer-interface"
    },
    {
      "title": "Training Cost",
      "definition": "Quantifies the resources required to develop AI models, including computational expenses, energy consumption, and human expertise.",
      "year": 2018,
      "slug": "training-cost"
    },
    {
      "title": "Scaling Hypothesis",
      "definition": "Enlarging model size, data, and computational resources can consistently improve task performance up to very large scales.",
      "year": 2020,
      "slug": "scaling-hypothesis"
    },
    {
      "title": "Hybrid AI",
      "definition": "Combines symbolic AI (rule-based systems) and sub-symbolic AI (machine learning) approaches to leverage the strengths of both for more versatile and explainable AI systems.",
      "year": 2017,
      "slug": "hybrid-ai"
    },
    {
      "title": "Epistemic Foraging",
      "definition": "Process of actively seeking out new information to reduce uncertainty in an agent's understanding of the world, often driven by curiosity or the need to update beliefs about the environment.",
      "year": 2013,
      "slug": "epistemic-foraging"
    },
    {
      "title": "Policy Gradient Algorithm",
      "definition": "Type of RL algorithm that optimizes the policy directly by computing gradients of expected rewards with respect to policy parameters.",
      "year": 1992,
      "slug": "policy-gradient-algorithm"
    },
    {
      "title": "Long-Context Modeling",
      "definition": "Techniques and architectures designed to process and understand sequences of data that are significantly longer than those typically handled by conventional models, enabling better performance on tasks requiring extended context.",
      "year": 2021,
      "slug": "long-context-modeling"
    },
    {
      "title": "DP (Dynamic Programming)",
      "definition": "Method used in computer science and mathematics to solve complex problems by breaking them down into simpler subproblems and solving each of these subproblems just once, storing their solutions.",
      "year": 1952,
      "slug": "dp-dynamic-programming"
    },
    {
      "title": "Perplexity",
      "definition": "Measure used in language modeling to evaluate how well a model predicts a sample of text, quantifying the model's uncertainty in its predictions.",
      "year": 1988,
      "slug": "perplexity"
    },
    {
      "title": "Machine Unlearning",
      "definition": "Process by which an ML model is systematically modified to forget specific data, ensuring that the data no longer influences the model's behavior or decisions.",
      "year": 2015,
      "slug": "machine-unlearning"
    },
    {
      "title": "Bellman Equation",
      "definition": "Recursive formula used to find the optimal policy in decision-making processes, particularly in the context of dynamic programming and RL.",
      "year": 1957,
      "slug": "bellman-equation"
    },
    {
      "title": "MTL (Multi-Task Learning)",
      "definition": "ML approach where a single model is trained simultaneously on multiple related tasks, leveraging commonalities and differences across tasks to improve generalization.",
      "year": 1993,
      "slug": "mtl-multi-task-learning"
    },
    {
      "title": "3D-to-3D Model",
      "definition": "A computational model that transforms three-dimensional data into another 3D format, typically involving tasks like transformation, enhancement, or generation of new 3D structures.",
      "year": 2021,
      "slug": "3d-to-3d-model"
    },
    {
      "title": "Federated Learning",
      "definition": "ML approach enabling models to be trained across multiple decentralized devices or servers holding local data samples, without exchanging them.",
      "year": 2016,
      "slug": "federated-learning"
    },
    {
      "title": "FSDP (Fully Sharded Data Parallel)",
      "definition": "Distributed training method in deep learning that divides both model parameters and optimizer states across multiple devices to improve efficiency and scalability.",
      "year": 2020,
      "slug": "fsdp-fully-sharded-data-parallel"
    },
    {
      "title": "Mechanistic Unlearning",
      "definition": "A process in AI where specific information is selectively removed from trained models to prevent specific outputs or behaviors.",
      "year": 2021,
      "slug": "mechanistic-unlearning"
    },
    {
      "title": "TensorFlow",
      "definition": "Open-source software library for machine learning, developed by Google, used for designing, building, and training deep learning models.",
      "year": 2015,
      "slug": "tensorflow"
    },
    {
      "title": "Cross-Attention",
      "definition": "Mechanism in neural networks that allows the model to weigh and integrate information from different input sources dynamically.",
      "year": 2017,
      "slug": "cross-attention"
    },
    {
      "title": "Loss Function",
      "definition": "Quantifies the difference between the predicted values by a model and the actual values, serving as a guide for model optimization.",
      "year": 1936,
      "slug": "loss-function"
    },
    {
      "title": "Speech-to-Image model",
      "definition": "Transforms spoken language into corresponding visual representations, utilizing AI to bridge auditory and visual domains.",
      "year": 2021,
      "slug": "speech-to-image-model"
    },
    {
      "title": "Speculative Edits",
      "definition": "Proactive generation of multiple possible edits in a computational process, typically by a system anticipating future states or changes in data before they occur, in order to improve efficiency.",
      "year": 2023,
      "slug": "speculative-edits"
    },
    {
      "title": "Utility Function",
      "definition": "Mathematical tool utilized in AI to model preferences and calculate the best decision based on expected outcomes.",
      "year": 1944,
      "slug": "utility-function"
    },
    {
      "title": "Adversarial Debiasing",
      "definition": "ML technique aimed at reducing bias in models by using adversarial training, where one network tries to predict sensitive attributes and another tries to prevent it.",
      "year": 2016,
      "slug": "adversarial-debiasing"
    },
    {
      "title": "ToM (Theory of Mind)",
      "definition": "Cognitive ability to attribute mental states—such as beliefs, intentions, desires, and knowledge—to oneself and others, allowing one to understand that others have perspectives and intentions that differ from one's own.",
      "year": 1978,
      "slug": "tom-theory-of-mind"
    },
    {
      "title": "VAE (Variational Autoencoders)",
      "definition": "Class of generative models that use neural networks to encode inputs into a latent space and then decode from this space to reconstruct the input or generate new data that resemble the input data.",
      "year": 2013,
      "slug": "vae-variational-autoencoders"
    },
    {
      "title": "System Prompt",
      "definition": "Predefined message or question generated by an AI system to guide or solicit a response from the user.",
      "year": 2022,
      "slug": "system-prompt"
    },
    {
      "title": "Performance Degradation",
      "definition": "Decline in the efficiency or effectiveness of an AI system over time or under specific conditions, leading to reduced accuracy, speed, or reliability.",
      "year": 1986,
      "slug": "performance-degradation"
    },
    {
      "title": "Fairness-Aware Machine Learning",
      "definition": "Focuses on developing algorithms that ensure equitable treatment and outcomes across different demographic groups.",
      "year": 2012,
      "slug": "fairness-aware-machine-learning"
    },
    {
      "title": "Policy-Guided Diffusion",
      "definition": "Method where a policy, typically learned via RL, guides the diffusion process in generating samples that conform to desired specifications or constraints.",
      "year": 2021,
      "slug": "policy-guided-diffusion"
    },
    {
      "title": "Local Weight Sharing",
      "definition": "Technique where the same weights are used across different positions in an input, enhancing the network's ability to recognize patterns irrespective of their spatial location.",
      "year": 1980,
      "slug": "local-weight-sharing"
    },
    {
      "title": "Jailbreaking",
      "definition": "Exploiting vulnerabilities in AI systems to bypass restrictions and unlock otherwise inaccessible functionalities.",
      "year": 2007,
      "slug": "jailbreaking"
    },
    {
      "title": "Weight",
      "definition": "Represents a coefficient for a feature in a model that determines the influence of that feature on the model's predictions.",
      "year": 1992,
      "slug": "weight"
    },
    {
      "title": "Agent-to-Agent Interaction",
      "definition": "Communication and cooperation between autonomous agents within a multi-agent system to achieve individual or collective goals.",
      "year": 1990,
      "slug": "agent-to-agent-interaction"
    },
    {
      "title": "GCC (General Computer Control)",
      "definition": "Ability of an AI system to autonomously manage and utilize a wide range of computer software and systems without specific programming for each individual task.",
      "year": 0,
      "slug": "gcc-general-computer-control"
    },
    {
      "title": "MLLMs (Multimodal Large Language Models)",
      "definition": "Advanced AI systems capable of understanding and generating information across different forms of data, such as text, images, and audio.",
      "year": 2021,
      "slug": "mllms-multimodal-large-language-models"
    },
    {
      "title": "Meta-Classifier",
      "definition": "Algorithm that combines multiple ML models to improve prediction accuracy over individual models.",
      "year": 1996,
      "slug": "meta-classifier"
    },
    {
      "title": "Centaur",
      "definition": "Collaborative system where humans and AI work together, combining human intuition and expertise with AI's computational power and data processing capabilities.",
      "year": 1983,
      "slug": "centaur"
    },
    {
      "title": "FSA (Finite State Automata)",
      "definition": "Computational model that processes input sequences and transitions between a finite number of states according to a set of rules, typically used for recognizing patterns or designing digital circuits.",
      "year": 1956,
      "slug": "fsa-finite-state-automata"
    },
    {
      "title": "Slop",
      "definition": "Colloquial slang referring to responses generated by LLMs that may be overly verbose or repetitive, often observed in AI-generated summaries or answers, and sometimes criticized for lacking conciseness or relevance.",
      "year": 2022,
      "slug": "slop"
    },
    {
      "title": "bGPT (Byte-Level Transformer)",
      "definition": "Variant of the GPT architecture designed to process data at the byte level rather than at the word or sub-word level, allowing for greater flexibility in handling diverse text types and structures.",
      "year": 2023,
      "slug": "bgpt-byte-level-transformer"
    },
    {
      "title": "Boolean",
      "definition": "Based on Boolean algebra, involving binary variables representing true or false, essential for logic operations in AI systems.",
      "year": 1854,
      "slug": "boolean"
    },
    {
      "title": "Scaffolding",
      "definition": "Method of gradually building up the complexity of tasks or learning environments to help an AI system develop more sophisticated capabilities over time.",
      "year": 1976,
      "slug": "scaffolding"
    },
    {
      "title": "MMLU (Massive Multitask Language Understanding)",
      "definition": "Evaluation framework designed to assess the performance of language models across a broad spectrum of tasks and domains.",
      "year": 2021,
      "slug": "mmlu-massive-multitask-language-understanding"
    },
    {
      "title": "RFM (Robotics Foundational Model)",
      "definition": "Base model designed to provide fundamental capabilities or understanding for the development of various robotic systems and applications.",
      "year": 2023,
      "slug": "rfm-robotics-foundational-model"
    },
    {
      "title": "Temperature",
      "definition": "Hyperparameter that controls the randomness of predictions by adjusting the probability distribution of the output classes to make the model's predictions more or less deterministic.",
      "year": 2015,
      "slug": "temperature"
    },
    {
      "title": "Graph Machine Learning",
      "definition": "AI field that applies ML techniques to graph-structured data, enabling the analysis and prediction of relationships and behaviors among interconnected nodes.",
      "year": 2017,
      "slug": "graph-machine-learning"
    },
    {
      "title": "Saturating Non-Linearities",
      "definition": "Activation functions in neural networks that reach a point where their output changes very little, or not at all, in response to large input values.",
      "year": 1986,
      "slug": "saturating-non-linearities"
    },
    {
      "title": "AI Safety",
      "definition": "Field of research aimed at ensuring AI technologies are beneficial and do not pose harm to humanity.",
      "year": 2000,
      "slug": "ai-safety"
    },
    {
      "title": "Hyperparameter",
      "definition": "Configuration settings used to structure ML models, which guide the learning process and are set before training begins.",
      "year": 1986,
      "slug": "hyperparameter"
    },
    {
      "title": "Silicon-Based Intelligence",
      "definition": "Concept of artificial intelligence systems that operate on silicon-based hardware, contrasting with biological, carbon-based forms of intelligence such as humans.",
      "year": 1965,
      "slug": "silicon-based-intelligence"
    },
    {
      "title": "ASI (Artificial Super Intelligence)",
      "definition": "Hypothetical form of AI that surpasses human intelligence across all domains, including creativity, general wisdom, and problem-solving capabilities.",
      "year": 1965,
      "slug": "asi-artificial-super-intelligence"
    },
    {
      "title": "Weight Decay",
      "definition": "Regularization technique used in training neural networks to prevent overfitting by penalizing large weights.",
      "year": 1987,
      "slug": "weight-decay"
    },
    {
      "title": "Similarity Search",
      "definition": "Method used in data science to identify similar items from a large dataset based on their proximity to a given query item (also known as proximity search).",
      "year": 1960,
      "slug": "similarity-search"
    },
    {
      "title": "Dimension Returns",
      "definition": "The output shape or size of the dimensions in a dataset, matrix, or tensor after a specific operation is performed, which is critical in ensuring proper alignment and compatibility in machine learning models.",
      "year": 2021,
      "slug": "dimension-returns"
    },
    {
      "title": "Trajectory Generation",
      "definition": "Computational methods for designing the path that an object or agent should follow to reach a destination efficiently and effectively.",
      "year": 2015,
      "slug": "trajectory-generation"
    },
    {
      "title": "Metaheuristic",
      "definition": "High-level problem-independent algorithmic framework that provides a set of guidelines or strategies to develop heuristic optimization algorithms.",
      "year": 1986,
      "slug": "metaheuristic"
    },
    {
      "title": "Uncertainty Reduction",
      "definition": "A process in AI by which systems manage and diminish uncertainty in predictions and decisions to improve performance and reliability.",
      "year": 1975,
      "slug": "uncertainty-reduction"
    },
    {
      "title": "IFEval (Instruction-Following Eval)",
      "definition": "Methodology designed to assess the ability of AI systems to follow and execute human-given instructions accurately and effectively.",
      "year": 2022,
      "slug": "ifeval-instruction-following-eval"
    },
    {
      "title": "Flash Attention",
      "definition": "GPU-optimized attention mechanism designed to efficiently handle extremely large sequences of data in neural networks.",
      "year": 2021,
      "slug": "flash-attention"
    },
    {
      "title": "Masking",
      "definition": "Technique used in NLP models to prevent future input tokens from influencing the prediction of current tokens.",
      "year": 2017,
      "slug": "masking"
    },
    {
      "title": "DSS (Decision Support System)",
      "definition": "A computerized program used to support determinations, judgments, and courses of action in an organization or a business.",
      "year": 1965,
      "slug": "dss-decision-support-system"
    },
    {
      "title": "Safety Net",
      "definition": "Measures, policies, and technologies designed to prevent, detect, and mitigate adverse outcomes or ethical issues stemming from AI systems' operation.",
      "year": 2020,
      "slug": "safety-net"
    },
    {
      "title": "Open Weights",
      "definition": "Access to model parameters of AI/ML systems, enabling transparency and collaboration in development and research.",
      "year": 2022,
      "slug": "open-weights"
    },
    {
      "title": "Federated Analytics",
      "definition": "An approach that uses machine learning algorithms to analyze decentralized data sources while constantly preserving the privacy and security of the data.",
      "year": 2018,
      "slug": "federated-analytics"
    },
    {
      "title": "GNN (Graph Neural Networks)",
      "definition": "Type of neural network designed for processing data represented in graph form, capturing relationships and structure within the data.",
      "year": 2005,
      "slug": "gnn-graph-neural-networks"
    },
    {
      "title": "Embodied AI",
      "definition": "Integration of AI into physical entities, enabling these systems to interact with the real world through sensory inputs and actions.",
      "year": 2016,
      "slug": "embodied-ai"
    },
    {
      "title": "Dimensionality Reduction",
      "definition": "Process used in ML to reduce the number of input variables or features in a dataset, simplifying models while retaining essential information.",
      "year": 1901,
      "slug": "dimensionality-reduction"
    },
    {
      "title": "Fuzzy Logic",
      "definition": "A method of reasoning that resembles human decision-making by handling imprecise or vague data.",
      "year": 1965,
      "slug": "fuzzy-logic"
    },
    {
      "title": "Training Objective",
      "definition": "Defines the criterion or goal used to guide the learning process of a machine learning model, often by minimizing or maximizing a particular function during training.",
      "year": 0,
      "slug": "training-objective"
    },
    {
      "title": "Loss Optimization",
      "definition": "Process of adjusting a model's parameters to minimize the difference between the predicted outputs and the actual outputs, measured by a loss function.",
      "year": 1936,
      "slug": "loss-optimization"
    },
    {
      "title": "KV (Key-Value)",
      "definition": "Data storage model where data is stored as a collection of key-value pairs, where each key is unique and maps directly to a value.",
      "year": 1970,
      "slug": "kv-key-value"
    },
    {
      "title": "Naive Bayesian Model",
      "definition": "Probabilistic classifier that assumes strong (naive) independence between the features of a dataset.",
      "year": 1960,
      "slug": "naive-bayesian-model"
    },
    {
      "title": "Decidability",
      "definition": "Whether a problem can be algorithmically solved, meaning there exists a clear procedure (algorithm) that will determine a yes-or-no answer for any given input within a finite amount of time.",
      "year": 1931,
      "slug": "decidability"
    },
    {
      "title": "Computational Creativity",
      "definition": "The study and building of software and algorithms that exhibit behaviors deemed creative in humans, such as generating original artwork, music, or solving problems in unique ways.",
      "year": 1990,
      "slug": "computational-creativity"
    },
    {
      "title": "Straight-Through Estimator",
      "definition": "Technique used in training neural networks to enable the backpropagation of gradients through non-differentiable functions or operations.",
      "year": 2013,
      "slug": "straight-through-estimator"
    },
    {
      "title": "God in a Box",
      "definition": "AI systems or models that are so powerful and advanced that they could theoretically solve any problem or fulfill any command, but are contained within strict controls to prevent unintended consequences.",
      "year": 2012,
      "slug": "god-in-a-box"
    },
    {
      "title": "Multiagent",
      "definition": "Multiple autonomous entities (agents) interacting in a shared environment, often with cooperative or competitive objectives.",
      "year": 1990,
      "slug": "multiagent"
    },
    {
      "title": "Quantization",
      "definition": "Process of reducing the precision of the weights and activations in neural network models to decrease their memory and computational requirements.",
      "year": 1939,
      "slug": "quantization"
    },
    {
      "title": "SotA (State of the Art)",
      "definition": "The highest level of performance achieved in a specific field, particularly in AI, where it denotes the most advanced model or algorithm.",
      "year": 1990,
      "slug": "sota-state-of-the-art"
    },
    {
      "title": "Persuasive System",
      "definition": "Type of software designed to change a person's attitude or behavior through persuasion and social influence.",
      "year": 2002,
      "slug": "persuasive-system"
    },
    {
      "title": "Multi-headed Attention",
      "definition": "Mechanism in neural networks that allows the model to jointly attend to information from different representation subspaces at different positions.",
      "year": 2017,
      "slug": "multi-headed-attention"
    },
    {
      "title": "TCN (Temporal Convolutional Networks)",
      "definition": "Type of neural network designed to handle sequential data by applying convolutional operations over time.",
      "year": 2016,
      "slug": "tcn-temporal-convolutional-networks"
    },
    {
      "title": "SNN (Spiking Neural Network)",
      "definition": "Type of artificial neural network that mimics the way biological neural networks in the brain process information, using spikes of electrical activity to transmit and process information.",
      "year": 1997,
      "slug": "snn-spiking-neural-network"
    },
    {
      "title": "Sparse Autoencoder",
      "definition": "Type of neural network designed to learn efficient data representations by enforcing sparsity on the hidden layer activations.",
      "year": 2008,
      "slug": "sparse-autoencoder"
    },
    {
      "title": "Q-Value",
      "definition": "Measure used in RL to represent the expected future rewards that an agent can obtain, starting from a given state and choosing a particular action.",
      "year": 1989,
      "slug": "q-value"
    },
    {
      "title": "Manifold Learning",
      "definition": "Type of non-linear dimensionality reduction technique used to uncover the underlying structure of high-dimensional data by assuming it lies on a lower-dimensional manifold.",
      "year": 2000,
      "slug": "manifold-learning"
    },
    {
      "title": "Feature Extraction",
      "definition": "Process of transforming raw data into a set of features that are more meaningful and informative for a specific task, such as classification or prediction.",
      "year": 1986,
      "slug": "feature-extraction"
    },
    {
      "title": "Adapter",
      "definition": "Lightweight, modular component added to a pre-trained model to fine-tune it for specific tasks without altering the original model's parameters significantly.",
      "year": 2019,
      "slug": "adapter"
    },
    {
      "title": "ACPs (Access Control Policies)",
      "definition": "Guidelines that regulates who or what can view or use resources in a computing environment.",
      "year": 2010,
      "slug": "acps-access-control-policies"
    },
    {
      "title": "GAIL (Generative Adversarial Imitation Learning)",
      "definition": "Advanced ML technique that uses adversarial training to enable an agent to learn behaviors directly from expert demonstrations without requiring explicit reward signals.",
      "year": 2016,
      "slug": "gail-generative-adversarial-imitation-learning"
    },
    {
      "title": "Data Augmentation",
      "definition": "Techniques used to increase the size and improve the quality of training datasets for machine learning models without collecting new data.",
      "year": 0,
      "slug": "data-augmentation"
    },
    {
      "title": "Query Flock",
      "definition": "Method to manage and process multiple related queries simultaneously, improving efficiency and response time.",
      "year": 2022,
      "slug": "query-flock"
    },
    {
      "title": "nGPT (Normalized Transformer)",
      "definition": "Model architecture used in NLP, bringing significant efficiency in training and improvements in model robustness.",
      "year": 2021,
      "slug": "ngpt-normalized-transformer"
    },
    {
      "title": "Generative Model",
      "definition": "A type of AI model that learns to generate new data instances that mimic the training data distribution.",
      "year": 2020,
      "slug": "generative-model"
    },
    {
      "title": "Boosting",
      "definition": "ML ensemble technique that combines multiple weak learners to form a strong learner, aiming to improve the accuracy of predictions.",
      "year": 1989,
      "slug": "boosting"
    },
    {
      "title": "GIGO (Garbage In, Garbage Out)",
      "definition": "Concept that emphasizes the quality of output is determined by the quality of input data.",
      "year": 1957,
      "slug": "gigo-garbage-in-garbage-out"
    },
    {
      "title": "JEPA (Joint Embedding Predictive Architecture)",
      "definition": "An approach that involves jointly embedding and predicting spatial or temporal correlations within data to improve model performance in tasks like prediction and understanding.",
      "year": 2021,
      "slug": "jepa-joint-embedding-predictive-architecture"
    },
    {
      "title": "Overparameterization Regime",
      "definition": "A phase in ML where the model has more parameters than the number of training samples, often leading to a high-variance, overfitted model.",
      "year": 2015,
      "slug": "overparameterization-regime"
    },
    {
      "title": "Sample Difficulty",
      "definition": "Degrees of complexities or challenges associated with particular samples or data points in a data set.",
      "year": 2018,
      "slug": "sample-difficulty"
    },
    {
      "title": "Hyperplane",
      "definition": "Mathematical concept that represents a subspace in n-dimensional space, with one dimension less than the space itself, used extensively to separate data points in various dimensions.",
      "year": 1902,
      "slug": "hyperplane"
    },
    {
      "title": "Program Induction",
      "definition": "A process in AI where computers generate, or 'induce', programs based on provided data and specific output criteria.",
      "year": 1980,
      "slug": "program-induction"
    },
    {
      "title": "XAI (Explainable AI)",
      "definition": "AI systems designed to provide insights into their behavior and decisions, making them transparent and understandable to humans.",
      "year": 2016,
      "slug": "xai-explainable-ai"
    },
    {
      "title": "Local Pooling",
      "definition": "Process that reduces the spatial dimensions of input data by aggregating information in local regions to create more abstract representations.",
      "year": 2015,
      "slug": "local-pooling"
    },
    {
      "title": "Solomonoff Induction",
      "definition": "Theory of prediction that combines elements of algorithmic information theory and Bayesian inference to create a universal framework for inferring future data from past observations.",
      "year": 1964,
      "slug": "solomonoff-induction"
    },
    {
      "title": "Mortal Computation",
      "definition": "Novel concept in computing that integrates the hardware-software relationship more closely, where computational systems are designed to reflect biological principles, particularly mortality and adaptability.",
      "year": 2022,
      "slug": "mortal-computation"
    },
    {
      "title": "SCM (Continuous-Time Consistency Model)",
      "definition": "A framework focused on ensuring consistency within distributed systems by reconciling time discrepancies in data states continuously.",
      "year": 2022,
      "slug": "scm-continuous-time-consistency-model"
    },
    {
      "title": "Foom",
      "definition": "Hypothetical rapid and uncontrollable growth of an AI's capabilities, leading to a superintelligent entity in a very short period.",
      "year": 2008,
      "slug": "foom"
    },
    {
      "title": "Inference Acceleration",
      "definition": "Methods and hardware optimizations employed to increase the speed and efficiency of the inference process in machine learning models, particularly neural networks.",
      "year": 2016,
      "slug": "inference-acceleration"
    },
    {
      "title": "World Model",
      "definition": "Internal representation that an AI system uses to simulate the environment it operates in, enabling prediction and decision-making based on those simulations.",
      "year": 1986,
      "slug": "world-model"
    },
    {
      "title": "Adversarial Attacks",
      "definition": "Manipulating input data to deceive machine learning models, causing them to make incorrect predictions or classifications.",
      "year": 2004,
      "slug": "adversarial-attacks"
    },
    {
      "title": "Mode Collapse",
      "definition": "Phenomenon in Generative Adversarial Networks (GANs) where the generator produces limited, highly similar outputs, ignoring the diversity of the target data distribution.",
      "year": 2014,
      "slug": "mode-collapse"
    },
    {
      "title": "TESCREAL",
      "definition": "'Seven ideologies: Transhumanism, Extropianism, Singularitarianism, Cosmism, Rationalism, Effective Altruism, and Longtermism. They all focus on using technology to improve people’s lives and they are deeply influential among people working on AGI.'",
      "year": 2022,
      "slug": "tescreal"
    },
    {
      "title": "Bagging",
      "definition": "ML ensemble technique that improves the stability and accuracy of machine learning algorithms by combining multiple models trained on different subsets of the same data set.",
      "year": 1994,
      "slug": "bagging"
    },
    {
      "title": "MIMS (Multiple Instance Learning for Missing Annotations)",
      "definition": "ML approach where training occurs on labeled bags of instances instead of individual instances, particularly useful when exact annotations are missing.",
      "year": 2012,
      "slug": "mims-multiple-instance-learning-for-missing-annotations"
    },
    {
      "title": "MRL (Matryoshka Representation Learning)",
      "definition": "ML approach under the umbrella of representation learning, which aims to construct hierarchical representations of data, akin to the nesting structure of Russian matryoshka dolls.",
      "year": 2021,
      "slug": "mrl-matryoshka-representation-learning"
    },
    {
      "title": "Secure Enclave",
      "definition": "Hardware-based security feature designed to protect sensitive data by isolating it in a dedicated and secure area of a processor.",
      "year": 2013,
      "slug": "secure-enclave"
    },
    {
      "title": "Training Data",
      "definition": "Dataset used to teach a ML model how to make predictions or perform tasks.",
      "year": 1956,
      "slug": "training-data"
    },
    {
      "title": "Multimodal",
      "definition": "AI systems or models that can process and understand information from multiple modalities, such as text, images, and sound.",
      "year": 2016,
      "slug": "multimodal"
    },
    {
      "title": "Scalable MatMul-free Language Modeling",
      "definition": "Techniques in natural language processing that avoid matrix multiplication (MatMul) operations to improve scalability and efficiency.",
      "year": 2021,
      "slug": "scalable-matmul-free-language-modeling"
    },
    {
      "title": "Policy Gradient",
      "definition": "Class of algorithms in RL that optimizes the parameters of a policy directly through gradient ascent on expected future rewards.",
      "year": 1992,
      "slug": "policy-gradient"
    },
    {
      "title": "HMI (Human-Machine Interface)",
      "definition": "Hardware or software through which humans interact with machines, facilitating clear and effective communication between humans and computer systems.",
      "year": 1988,
      "slug": "hmi-human-machine-interface"
    },
    {
      "title": "Thermodynamic Bayesian Inference",
      "definition": "Framework that draws an analogy between thermodynamics and Bayesian probability theory to infer statistical models by treating inference as an energy-minimizing process.",
      "year": 2018,
      "slug": "thermodynamic-bayesian-inference"
    },
    {
      "title": "Model Compression",
      "definition": "Techniques designed to reduce the size of a machine learning model without significantly sacrificing its accuracy.",
      "year": 2006,
      "slug": "model-compression"
    },
    {
      "title": "Autoformalization",
      "definition": "Process of automatically converting natural language descriptions or informal mathematical ideas into formal mathematical or logical expressions using AI.",
      "year": 2018,
      "slug": "autoformalization"
    },
    {
      "title": "Dual Use",
      "definition": "Technologies developed for civilian purposes that can also be repurposed for military or malicious applications, highlighting ethical considerations in their development and regulation.",
      "year": 2022,
      "slug": "dual-use"
    },
    {
      "title": "Image Synthesis",
      "definition": "Use of AI models to generate new, unique images based on learned patterns and features from a dataset.",
      "year": 1974,
      "slug": "image-synthesis"
    },
    {
      "title": "Responsible AI",
      "definition": "Application of AI in a manner that is transparent, unbiased, and respects user privacy and value.",
      "year": 2016,
      "slug": "responsible-ai"
    },
    {
      "title": "Anomaly Detection",
      "definition": "Process of identifying unusual patterns that deviate from expected behavior, often used to detect fraud, network intrusions, or unusual transactions.",
      "year": 1969,
      "slug": "anomaly-detection"
    },
    {
      "title": "Contextual BM25",
      "definition": "Widely used probabilistic ranking function for assessing document relevance in search queries based on a bag-of-words model.",
      "year": 2016,
      "slug": "contextual-bm25"
    },
    {
      "title": "Multi-Token Prediction",
      "definition": "AI technique used in NLP where a model generates multiple output tokens simultaneously, often improving coherence and speed compared to single-token generation methods.",
      "year": 2019,
      "slug": "multi-token-prediction"
    },
    {
      "title": "Autoregressive Generation",
      "definition": "Method where the prediction of the next output in a sequence is based on the previously generated outputs.",
      "year": 2014,
      "slug": "autoregressive-generation"
    },
    {
      "title": "AEO (Answer Engine Optimization)",
      "definition": "Process of optimizing content to improve its chances of being selected as the direct response by search engines or voice assistants to user queries.",
      "year": 2018,
      "slug": "aeo-answer-engine-optimization"
    },
    {
      "title": "Groundedness",
      "definition": "Property of language models that ensures their generated content or interpretations are closely tied to or derived from real-world knowledge and contexts.",
      "year": 2021,
      "slug": "groundedness"
    },
    {
      "title": "Hyperdimensional Computing",
      "definition": "An approach leveraging high-dimensional vector spaces and random hypervectors to build robust and efficient models for AI tasks.",
      "year": 2009,
      "slug": "hyperdimensional-computing"
    },
    {
      "title": "Function Approximator",
      "definition": "Computational model used to estimate a target function that is generally complex or unknown, often applied in machine learning and control systems.",
      "year": 1986,
      "slug": "function-approximator"
    },
    {
      "title": "Self-Speculative Decoding",
      "definition": "Mechanism that predicts subsequent symbols in a sequence, enhancing prediction accuracy.",
      "year": 2023,
      "slug": "self-speculative-decoding"
    },
    {
      "title": "BNN (Bispectral Neural Networks)",
      "definition": "Utilize higher-order spectral features for improved signal processing and pattern recognition tasks, enhancing traditional neural network capabilities.",
      "year": 2018,
      "slug": "bnn-bispectral-neural-networks"
    },
    {
      "title": "Federated Training",
      "definition": "Decentralized machine learning approach where multiple devices or nodes collaboratively train a shared model while keeping their data localized, rather than aggregating it centrally.",
      "year": 2016,
      "slug": "federated-training"
    },
    {
      "title": "Horizon",
      "definition": "Length of the future over which decisions are considered, with long horizon involving many future steps and short horizon involving only a few.",
      "year": 1980,
      "slug": "horizon"
    },
    {
      "title": "Spatial Autoencoder",
      "definition": "A variant of autoencoder networks that leverages spatial information within data for efficient feature learning, often used in processing image and spatial data.",
      "year": 2016,
      "slug": "spatial-autoencoder"
    },
    {
      "title": "ADAM (Adaptive Moment Estimation)",
      "definition": "Algorithm for gradient-based optimization of stochastic objective functions, widely used in training DL models.",
      "year": 2015,
      "slug": "adam-adaptive-moment-estimation"
    },
    {
      "title": "Search Optimization",
      "definition": "Process of enhancing algorithms' ability to efficiently search for the most optimal solution in a potentially vast solution space.",
      "year": 1956,
      "slug": "search-optimization"
    },
    {
      "title": "Sampling Algorithm",
      "definition": "Method used to select a subset of data from a larger set, ensuring that the sample is representative of the original population for the purpose of analysis or computational efficiency.",
      "year": 1936,
      "slug": "sampling-algorithm"
    },
    {
      "title": "Token Speculation Techniques",
      "definition": "Strategies used in NLP models to predict multiple potential tokens (words or subwords) in parallel, improving the efficiency of text generation.",
      "year": 2023,
      "slug": "token-speculation-techniques"
    },
    {
      "title": "Semantic Indexing",
      "definition": "Structured representation of information that captures the meaning and relationships between concepts, enabling more effective search and retrieval of data based on the meaning of words rather than just keyword matches.",
      "year": 1999,
      "slug": "semantic-indexing"
    },
    {
      "title": "Stochastic",
      "definition": "Systems or processes that are inherently random, involving variables that are subject to chance.",
      "year": 2021,
      "slug": "stochastic"
    },
    {
      "title": "Self-Attention",
      "definition": "Mechanism in neural networks that allows models to weigh the importance of different parts of the input data differently.",
      "year": 2017,
      "slug": "self-attention"
    },
    {
      "title": "Cross entropy loss",
      "definition": "Loss function used to measure the difference between two probability distributions for a given random variable or set of events.",
      "year": 1991,
      "slug": "cross-entropy-loss"
    },
    {
      "title": "Dualism",
      "definition": "Theory or concept that emphasizes the division between symbolic (classical) AI and sub-symbolic (connectionist) AI.",
      "year": 1980,
      "slug": "dualism"
    },
    {
      "title": "Negative Utilitarianism",
      "definition": "Ethical theory that prioritizes minimizing suffering and negative experiences over maximizing happiness and positive experiences.",
      "year": 1958,
      "slug": "negative-utilitarianism"
    },
    {
      "title": "Feed Forward",
      "definition": "Essential structure of an artificial neural network that directs data or information from the input layer towards the output layer without looping back.",
      "year": 1961,
      "slug": "feed-forward"
    },
    {
      "title": "Model Stability",
      "definition": "Refers to the consistency and reliability of a machine learning model's performance when exposed to different subsets of data or slight variations in input.",
      "year": 2016,
      "slug": "model-stability"
    },
    {
      "title": "Geometric Deep Learning",
      "definition": "Field of study that extends DL techniques to data that is structured as graphs, manifolds, or more general topological spaces.",
      "year": 2014,
      "slug": "geometric-deep-learning"
    },
    {
      "title": "Curse of Dimensionality",
      "definition": "Phenomenon where the complexity and computational cost of analyzing data increase exponentially with the number of dimensions or features.",
      "year": 1970,
      "slug": "curse-of-dimensionality"
    },
    {
      "title": "Ablation",
      "definition": "Method where components of a neural network are systematically removed or altered to study their impact on the model's performance.",
      "year": 2017,
      "slug": "ablation"
    },
    {
      "title": "Assistant",
      "definition": "Software system designed to perform tasks or services for an individual, often leveraging NLP and ML to interact and respond intelligently.",
      "year": 1966,
      "slug": "assistant"
    },
    {
      "title": "MLOps (Machine Learning Operations)",
      "definition": "Practice of collaboratively combining ML system development and ML system operation, aiming for faster deployment and reliable management.",
      "year": 2018,
      "slug": "mlops-machine-learning-operations"
    },
    {
      "title": "Meta-Regressor",
      "definition": "Type of ensemble learning method that uses the predictions of several base regression models to train a second-level model to make a final prediction.",
      "year": 1996,
      "slug": "meta-regressor"
    },
    {
      "title": "AI Effect",
      "definition": "Phenomenon where once an AI system can perform a task previously thought to require human intelligence, the task is no longer considered to be a benchmark for intelligence.",
      "year": 1990,
      "slug": "ai-effect"
    },
    {
      "title": "Parameter Space",
      "definition": "Multidimensional space defined by all possible values of the parameters of a model, often used in ML and optimization to explore different configurations that influence model performance.",
      "year": 1936,
      "slug": "parameter-space"
    },
    {
      "title": "EDL (Experimentation Driven Learning)",
      "definition": "AI approach where learning algorithms improve their performance through systematic experimentation and feedback from the environment.",
      "year": 2020,
      "slug": "edl-experimentation-driven-learning"
    },
    {
      "title": "Speed of Light Issues",
      "definition": "Challenges or constraints in computing, communication, and physics that arise due to the finite speed at which light (and thus electromagnetic signals) travels.",
      "year": 2020,
      "slug": "speed-of-light-issues"
    },
    {
      "title": "MAS (Multi-Agent System)",
      "definition": "Software framework where several autonomous entities called agents interact to achieve individual or collective goals.",
      "year": 1971,
      "slug": "mas-multi-agent-system"
    },
    {
      "title": "Scalar",
      "definition": "Single numerical value, typically representing a quantity or magnitude in mathematical or computational models.",
      "year": 1936,
      "slug": "scalar"
    }
  ]
}